{"I've been spending a lot of time on Substack notes. This is mostly because I have twitter and instagram blocked off my phone until 6PM, and I have nothing else to look at when I'm bored. It's telling that I don't feel a need to block Substack as well, because it's a lot less engaging. ": [{"content": "I've been spending a lot of time on Substack notes. This is mostly because I have twitter and instagram blocked off my phone until 6PM, and I have nothing else to look at when I'm bored. It's telling that I don't feel a need to block Substack as well, because it's a lot less engaging. ", "parent": "Substack.txt", "score": 7.04972472640566e-07}, {"content": "The thing I actually like about Substack is mostly just following newsletters from people I know in some capacity, either IRL friends or twitter mutuals. It feels great getting a dispatch from someone you kind of know. I imagine it feels something like getting a letter from a friend by carrier pigeon in the early 1900s. I only pay for one Substack, have basically 0 interest in paying for any others and harbor no ambitions of ever getting paid to write here, but I really really really really like getting emails in my inbox with essays written by my friends. ", "parent": "Substack.txt", "score": 0.8486848719904084}, {"content": "Substack notes feels weirdly earnest in an offputting way, like a different flavor of LinkedIn cringe where you're being sold navel gazing existentialism instead of careerist striving. It also feels like parts of Substack have a weird hierarchical structure, where at the bottom there are people writing empty existential platitudes about how to live, above them there are people criticizing them for that, then above that a group of people engaging in meta criticism about how too much Substack writing is people criticizing Substack writing. I'm aware I'm doing that right now, and I promise to avoid ever writing about Substack again if I can avoid it. It also seems true that these criticisms probably apply to basically any literary scene and maybe these problems are just unavoidable. ", "parent": "Substack.txt", "score": 0.8921212256753187}, {"content": "I have long distance friendships that are sustained almost entirely by exchanging tweets or instagram reels over DMs. I think this is a habit my generation has developed since the days of tagging friends in the comments of memes on Facebook meme pages. On some level this seems really dumb, but it's also helped me stay in touch with some of my closest friends who live across the continent. Substack seems like another avenue to do this, and that seems pretty nice. ", "parent": "Substack.txt", "score": 0.9358249709677808}, {"content": "Upset at this state of affairs, I found [a chrome extension](https://chrome.google.com/webstore/detail/news-feed-eradicator/fjcldmjmjhkklehbacihaiopjklihlgg?hl=en) that disabled the \"feeds\" on a number of sites (Facebook, Youtube, LinkedIn, even HackerNews). This helped immediately. The unconscious, muscle-memory impulse to press Y and autocomplete into Youtube was still there, but when I opened the page, the algorithmic suggestions were all gone. Staring at the blank space, I would realize that I hadn't opened Youtube because I really wanted to watch anything, I had opened it because it was my impulse to do that while bored. ", "parent": "Controlling what you see.txt", "score": 1.0122185945510864}, {"content": "I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]] ", "parent": "untitled-9-24-2021.txt", "score": 1.0372416973114014}, {"content": "It is current year. Armed with fleets of server racks and neural nets trained upon eons of GPU compute time, social media conglomerates have razed and pillaged your attention span with a steady drip feed of content algorithmically optimized to deliver maximal doses of dopamine. Half the time you open your phone, you forget what you opened it for in the first place (checking the weather? for an important email?) and somehow end up on one of the many like farms installed on your phone, your thumbs scrolling like runners on a treadmill.", "parent": "Manifesto.txt", "score": 1.0701836347579956}, {"content": "I have not had as much time to work on programming side projects. In general, I've been spending more spare time on music rather than programming. There's nothing intrinsically wrong with that, but I feel like it's less a reflection of what I want than it is a reflection of my environment. ", "parent": "NOW PAGE.txt", "score": 1.0955676760740964}, {"content": "I spend an inordinate amount of time on Youtube. Having noticed this one morning, I quietly told myself that I wouldn't check Youtube for the rest of the work session - only to find that I would unconsciously press \"Y+enter\" and let the address bar's autocomplete lead me to Youtube. I would find myself on the site, not remembering how I had gotten there. More importantly, the home page recommendations had learned my preferences incredibly well. As soon as I landed on Youtube, there would be at least one video there ready for me to watch. That morning, I got nothing done. Youtube's algorithm had figured out that I really liked watching short clips of Mad Men and provided me a steady drip-feed of them, which I gorged on instead of getting anything done. ", "parent": "Controlling what you see.txt", "score": 1.1208555698394775}, {"content": "Here's a mystery that's been on my mind for a while now: I never take notes in class, I never use [[exegesis]] to take notes, so how is it that I ended up making something that most people would classify as a \"note taking app\"? ", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 1.1229612827301025}], "": [{"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 1.2026228078123622}, {"content": "~", "parent": "Fragments.txt", "score": 1.202622890472412}, {"content": "~", "parent": "The making of Nomad Hypertext.txt", "score": 1.202627182006836}, {"content": "~", "parent": "The making of Nomad Hypertext.txt", "score": 1.2026363611221313}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 1.2026889059926669}, {"content": "~", "parent": "NOW PAGE.txt", "score": 1.2026889059926669}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 1.2026889059926669}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 1.2026889059926669}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 1.2026889059926669}, {"content": "~", "parent": "NOW PAGE.txt", "score": 1.2026889059926669}], "Substack notes feels weirdly earnest in an offputting way, like a different flavor of LinkedIn cringe where you're being sold navel gazing existentialism instead of careerist striving. It also feels like parts of Substack have a weird hierarchical structure, where at the bottom there are people writing empty existential platitudes about how to live, above them there are people criticizing them for that, then above that a group of people engaging in meta criticism about how too much Substack writing is people criticizing Substack writing. I'm aware I'm doing that right now, and I promise to avoid ever writing about Substack again if I can avoid it. It also seems true that these criticisms probably apply to basically any literary scene and maybe these problems are just unavoidable. ": [{"content": "Substack notes feels weirdly earnest in an offputting way, like a different flavor of LinkedIn cringe where you're being sold navel gazing existentialism instead of careerist striving. It also feels like parts of Substack have a weird hierarchical structure, where at the bottom there are people writing empty existential platitudes about how to live, above them there are people criticizing them for that, then above that a group of people engaging in meta criticism about how too much Substack writing is people criticizing Substack writing. I'm aware I'm doing that right now, and I promise to avoid ever writing about Substack again if I can avoid it. It also seems true that these criticisms probably apply to basically any literary scene and maybe these problems are just unavoidable. ", "parent": "Substack.txt", "score": 0.0}, {"content": "The thing I actually like about Substack is mostly just following newsletters from people I know in some capacity, either IRL friends or twitter mutuals. It feels great getting a dispatch from someone you kind of know. I imagine it feels something like getting a letter from a friend by carrier pigeon in the early 1900s. I only pay for one Substack, have basically 0 interest in paying for any others and harbor no ambitions of ever getting paid to write here, but I really really really really like getting emails in my inbox with essays written by my friends. ", "parent": "Substack.txt", "score": 0.7659014535564814}, {"content": "I've been spending a lot of time on Substack notes. This is mostly because I have twitter and instagram blocked off my phone until 6PM, and I have nothing else to look at when I'm bored. It's telling that I don't feel a need to block Substack as well, because it's a lot less engaging. ", "parent": "Substack.txt", "score": 0.8921510796622522}, {"content": "I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.", "parent": "Second Brains.txt", "score": 1.006847620010376}, {"content": "2. My critique here is nothing original - it echoes a lot of what Andy [[Matuschak]] and [[Linus Lee]] have touched upon in their essays. Here's a brief excerpt from [Linus' blog post](https://thesephist.com/posts/browser/) that expresses the point more eloquently: ", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 1.040793776512146}, {"content": "I have long distance friendships that are sustained almost entirely by exchanging tweets or instagram reels over DMs. I think this is a habit my generation has developed since the days of tagging friends in the comments of memes on Facebook meme pages. On some level this seems really dumb, but it's also helped me stay in touch with some of my closest friends who live across the continent. Substack seems like another avenue to do this, and that seems pretty nice. ", "parent": "Substack.txt", "score": 1.047917867745672}, {"content": "Working on exegesis was a grueling affair at times. I rewrote the schema multiple times, rewrote the backend from scratch 2 months before release, chased countless UI bugs, and manually patched abandoned NPM packages. Part of it may have been due to my inexperience, but [working with ](https://nichwch.medium.com/making-yana-e3fade3f56e7)[rich text](https://medium.engineering/why-contenteditable-is-terrible-122d8a40e480) is just a [difficult task](https://twitter.com/thesephist/status/1360298464349999108), period. At one point, I considered giving up after finding a rival writing app I thought I simply couldn't compete with - I have a copy of an unfinished essay I started writing on why I had given up tucked away somewhere. ", "parent": "Prometheus.txt", "score": 1.0693228244781494}, {"content": "Class starts tomorrow. It's been a while since I've read the strangely authoritarian language of a course syllabus, a long string of \"thou shalt not\"s followed by more prohibitions and percentages. Thinking about the anti-educational-institution streak in certain tech circles and the many projects aiming to replace the university, I wonder if this kind of authoritarianism is inherent to education. Most alt-ed projects promise to liberate students from pointless assessments and the caprice of individual instructors but I wonder if these might be empty promises, like how most revolutionary movements end up becoming oppressive themselves.[[meta-acropolis]] [[ideas]] ", "parent": "untitled-9-21-2021.txt", "score": 1.0797845125198364}, {"content": "There is a time and place for minimalism, and all in all I don't think it is an intrinsically bad thing. I should also point out that I like all three writers mentioned above. However, I do think it's overused as an aesthetic philosophy, and that this overuse is a symptom of a deeper cultural illness: a general lack of conviction and courage. ", "parent": "Minimalism.txt", "score": 1.0876131057739258}, {"content": "Eventually I want exegesis to be a social platform - you can already publish notes, but I want social features like profiles, groups, follows, etc. etc. Similar tools like [[roam]] can already be used as CRMs. So can exegesis. But, if I'm going to be building profiles into the app for social features, it may make sense to build additional affordances around managing people and relationships. For example, hovering over a link to a person could show all their social media profiles, in addition to places where you've tagged them in your notes.[[exegesis]] [[ideas]] [[roam]] ", "parent": "untitled-9-20-2021.txt", "score": 1.089614748954773}], "The thing I actually like about Substack is mostly just following newsletters from people I know in some capacity, either IRL friends or twitter mutuals. It feels great getting a dispatch from someone you kind of know. I imagine it feels something like getting a letter from a friend by carrier pigeon in the early 1900s. I only pay for one Substack, have basically 0 interest in paying for any others and harbor no ambitions of ever getting paid to write here, but I really really really really like getting emails in my inbox with essays written by my friends. ": [{"content": "The thing I actually like about Substack is mostly just following newsletters from people I know in some capacity, either IRL friends or twitter mutuals. It feels great getting a dispatch from someone you kind of know. I imagine it feels something like getting a letter from a friend by carrier pigeon in the early 1900s. I only pay for one Substack, have basically 0 interest in paying for any others and harbor no ambitions of ever getting paid to write here, but I really really really really like getting emails in my inbox with essays written by my friends. ", "parent": "Substack.txt", "score": 8.724767705655717e-07}, {"content": "Substack notes feels weirdly earnest in an offputting way, like a different flavor of LinkedIn cringe where you're being sold navel gazing existentialism instead of careerist striving. It also feels like parts of Substack have a weird hierarchical structure, where at the bottom there are people writing empty existential platitudes about how to live, above them there are people criticizing them for that, then above that a group of people engaging in meta criticism about how too much Substack writing is people criticizing Substack writing. I'm aware I'm doing that right now, and I promise to avoid ever writing about Substack again if I can avoid it. It also seems true that these criticisms probably apply to basically any literary scene and maybe these problems are just unavoidable. ", "parent": "Substack.txt", "score": 0.765859422534464}, {"content": "I have long distance friendships that are sustained almost entirely by exchanging tweets or instagram reels over DMs. I think this is a habit my generation has developed since the days of tagging friends in the comments of memes on Facebook meme pages. On some level this seems really dumb, but it's also helped me stay in touch with some of my closest friends who live across the continent. Substack seems like another avenue to do this, and that seems pretty nice. ", "parent": "Substack.txt", "score": 0.7815590318254331}, {"content": "I've been spending a lot of time on Substack notes. This is mostly because I have twitter and instagram blocked off my phone until 6PM, and I have nothing else to look at when I'm bored. It's telling that I don't feel a need to block Substack as well, because it's a lot less engaging. ", "parent": "Substack.txt", "score": 0.8487893037449988}, {"content": "I want to write more. I don't really care about writing \"better\" or more \"professionally\", because I don't write for a living, and I'm not really interested in selling people on my opinions. Instead, I want to write to broadcast my interests, so I can attract others who have similar interests. Hopefully, [[exegesis]] will be an able and capable platform for me to do this. ", "parent": "Reflections for the New Year.txt", "score": 1.1502721309661865}, {"content": "The second would be [All you need is links](https://subconscious.substack.com/p/all-you-need-is-links) by Gordon Brander. He puts forth the case that you can implement pretty much any feature you might want a tool for thought to have, using only hyperlinks. I found the idea that you could create a myriad of functionality with just one powerful feature extremely fascinating. ", "parent": "What is Nomad Hypertext.txt", "score": 1.2236704413923745}, {"content": "This is not groundbreaking news, but it's groundbreaking for me. I started my software engineering career writing code with cloud applications in mind, and the idea that you can ship cool projects without running database migrations or doing extensive backtesting against your monolith *is* groundbreaking to me. In college I wanted my own blog and instead of getting a static site generator I built out a cloud application with NextJS, PostgreSQL and Heroku. I did learn a lot and it helped me land my first internship, but now it strikes me as an incredibly wrong minded approach. ", "parent": "NOW PAGE.txt", "score": 1.226638152548915}, {"content": "I haven't enjoyed reading something this much in a while. Usually I struggle to read more than 10 pages of something at a time, but I found this really engaging. Feels like the right level of philosophical sophistication for me right now - the concepts are comprehensible but still challenging and novel, and the biographical element adds a level of allure as well. ", "parent": "untitled-2-6-2022.txt", "score": 1.2304282188415527}, {"content": "I enjoy the process of sitting with my guitar, generating riff ideas on the fly, soloing over 8 bar progressions on my looper, but I'm not excited at all about creating a song. In many ways, my feelings about software are kind of the opposite. I have mixed, love/hate feelings about the process of writing software (reading documentation, chasing down bugs, writing tests, etc), but I feel incredibly excited about the end product. ", "parent": "NOW PAGE.txt", "score": 1.2546388850018446}, {"content": "If I start an exegesis brain dump (what I call my [[journal]] entries when I post them to twitter) and post it, it makes me more likely to continue writing in it throughout the day. Once I start writing, more thoughts and ideas come to me. It's as if my brain suddenly realizes there's an outlet for thoughts, and so it generates more of them. Having good conversations has a similar effect. [[writing]] [[personal-reflection]]", "parent": "untitled-10-1-2021.txt", "score": 1.2546452283859253}], "I have long distance friendships that are sustained almost entirely by exchanging tweets or instagram reels over DMs. I think this is a habit my generation has developed since the days of tagging friends in the comments of memes on Facebook meme pages. On some level this seems really dumb, but it's also helped me stay in touch with some of my closest friends who live across the continent. Substack seems like another avenue to do this, and that seems pretty nice. ": [{"content": "I have long distance friendships that are sustained almost entirely by exchanging tweets or instagram reels over DMs. I think this is a habit my generation has developed since the days of tagging friends in the comments of memes on Facebook meme pages. On some level this seems really dumb, but it's also helped me stay in touch with some of my closest friends who live across the continent. Substack seems like another avenue to do this, and that seems pretty nice. ", "parent": "Substack.txt", "score": 1.895069769030904e-06}, {"content": "The thing I actually like about Substack is mostly just following newsletters from people I know in some capacity, either IRL friends or twitter mutuals. It feels great getting a dispatch from someone you kind of know. I imagine it feels something like getting a letter from a friend by carrier pigeon in the early 1900s. I only pay for one Substack, have basically 0 interest in paying for any others and harbor no ambitions of ever getting paid to write here, but I really really really really like getting emails in my inbox with essays written by my friends. ", "parent": "Substack.txt", "score": 0.7816249543954144}, {"content": "I've been spending a lot of time on Substack notes. This is mostly because I have twitter and instagram blocked off my phone until 6PM, and I have nothing else to look at when I'm bored. It's telling that I don't feel a need to block Substack as well, because it's a lot less engaging. ", "parent": "Substack.txt", "score": 0.9359341629075102}, {"content": "Substack notes feels weirdly earnest in an offputting way, like a different flavor of LinkedIn cringe where you're being sold navel gazing existentialism instead of careerist striving. It also feels like parts of Substack have a weird hierarchical structure, where at the bottom there are people writing empty existential platitudes about how to live, above them there are people criticizing them for that, then above that a group of people engaging in meta criticism about how too much Substack writing is people criticizing Substack writing. I'm aware I'm doing that right now, and I promise to avoid ever writing about Substack again if I can avoid it. It also seems true that these criticisms probably apply to basically any literary scene and maybe these problems are just unavoidable. ", "parent": "Substack.txt", "score": 1.0480809133728741}, {"content": "Eventually I want exegesis to be a social platform - you can already publish notes, but I want social features like profiles, groups, follows, etc. etc. Similar tools like [[roam]] can already be used as CRMs. So can exegesis. But, if I'm going to be building profiles into the app for social features, it may make sense to build additional affordances around managing people and relationships. For example, hovering over a link to a person could show all their social media profiles, in addition to places where you've tagged them in your notes.[[exegesis]] [[ideas]] [[roam]] ", "parent": "untitled-9-20-2021.txt", "score": 1.1133261919021606}, {"content": "My dream is to enable something I term \"generational computing.\" I want my kids and my grandkids to someday be able to interface with the artifacts of my digital life. I want them to be able to read my notes and ask an LLM about what I've learned over my life. I want them to be able to chat with a replica of me trained on my writings. I want them to be able to look through the music I made and the music I listened to, and see the connections between the two. I want them to be able to upload their own musical ideas or writings, and see the connections between what they've made and what I've made. ", "parent": "Generational Computing.txt", "score": 1.1204024394282412}, {"content": "That was an interesting reply, and it really got me thinking. She said something along the lines of [[twitter]] being her favorite [[tools for thought]]. ", "parent": "untitled-9-24-2021.txt", "score": 1.1330206394195557}, {"content": "If I start an exegesis brain dump (what I call my [[journal]] entries when I post them to twitter) and post it, it makes me more likely to continue writing in it throughout the day. Once I start writing, more thoughts and ideas come to me. It's as if my brain suddenly realizes there's an outlet for thoughts, and so it generates more of them. Having good conversations has a similar effect. [[writing]] [[personal-reflection]]", "parent": "untitled-10-1-2021.txt", "score": 1.14333176612854}, {"content": "Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]] ", "parent": "Controlling what you see.txt", "score": 1.1530650854110718}, {"content": "There is a particular kind of second order effect that is of special interest: technologies can create entire new types of people. Instagram created the influencer, Youtube produced the Youtuber, Soundcloud spawned its own eponymous kind of rapper. The more extreme political factions in America trace their lineages to 4Chan and Tumblr. To give an older example, the factory birthed the proletariat a century ago. ", "parent": "Creating new kinds of people.txt", "score": 1.1581597328186035}]}