{"Sitting in the MU again, this time with a view of the quad. Listening to \"The Time of the Season\" by the Zombies.": [{"content": "Sitting in the MU again, this time with a view of the quad. Listening to \"The Time of the Season\" by the Zombies.", "parent": "untitled-9-24-2021.txt", "score": 1.1324882507324219e-06}, {"content": "Sitting the UC Davis MU, listening to King Crimson.", "parent": "untitled-9-21-2021.txt", "score": 0.40337270498275757}, {"content": "First day of school. Sitting in the UC Davis Coffee House for the first time in forever. Recently I've gone on a streak of listening to boomer music - yesterday I was listening to the Beatles, today I'm listening to Cream. [[music]] ", "parent": "untitled-9-22-2021.txt", "score": 0.486846923828125}, {"content": "Felt good to be back at university, surrounded by other students. Just enjoying the feeling of walking across the quad, enjoying the morning sun, avoiding eye contact with people marketing their clubs, spotting a familiar face in a crowd, etc. etc.", "parent": "untitled-9-22-2021.txt", "score": 0.557189404964447}, {"content": "Some thoughts from this morning. Sitting in the Peet's cafe near the gym at UC Davis, listening to 80s synthwave. ", "parent": "untitled-9-21-2021.txt", "score": 0.5619487762451172}, {"content": "Listening to music", "parent": "untitled-9-21-2021.txt", "score": 0.5901346802711487}, {"content": "Something weird is happening here - we have access to more music and genres than ever before in human history, and yet it feels like something important is missing. Many of the people I talk to listen to music all the time, but I get the sense that it's more to ward off the dreaded experience of silence than it is to actually enjoy music. ", "parent": "Context and community makes music more enjoyable, and it's missing from modern streaming services.txt", "score": 0.659115195274353}, {"content": "[Watch this performance of Autumn Leaves.](https://www.youtube.com/watch?v=7t3xBqAWLaU&list=PLo-DRv8z8J7ouU1ksk8YvSVjXCYLOKPEp&index=75) ", "parent": "Context and community makes music more enjoyable, and it's missing from modern streaming services.txt", "score": 0.659753680229187}, {"content": "Feeling Good", "parent": "untitled-9-30-2021.txt", "score": 0.6795510053634644}, {"content": "Listening to [[music]] can either be a great aid to [[focus]], or a huge impediment. Sometimes it helps me get in the zone. When it happens, usually the music fades into the background and I'm not even noticing it - this is the sweet spot for focus. Music that I like too much actually distracts me, and music that I don't like enough bores me and I end up wasting time switching what music I listen to. Working without music doesn't seem to be an option at all. I hope maybe [[synesthesia]] will help change my music listening habits? [[personal-reflection]] ", "parent": "untitled-9-21-2021.txt", "score": 0.6847596764564514}], "": [{"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 0.6012972593307495}, {"content": "~", "parent": "The making of Nomad Hypertext.txt", "score": 0.6013116240501404}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 0.6013116240501404}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 0.6013116240501404}, {"content": "~", "parent": "Fragments.txt", "score": 0.6013129949569702}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 0.6013135506879113}, {"content": "~", "parent": "Second Brains.txt", "score": 0.6013180017471313}, {"content": "~", "parent": "Fragments.txt", "score": 0.6013447046279907}, {"content": "~", "parent": "untitled-1-4-2022.txt", "score": 0.6013447046279907}, {"content": "~", "parent": "The making of Nomad Hypertext.txt", "score": 0.6013447046279907}], "I did not do a braindump yesterday, the words did not flow easily. Best not to force these things. [[journal]] ": [{"content": "I did not do a braindump yesterday, the words did not flow easily. Best not to force these things. [[journal]] ", "parent": "untitled-9-24-2021.txt", "score": -1.1920928955078125e-07}, {"content": "Having done this daily exegesis braindump [[journal]] thing for a bit, I think there's something of value to her response. I get down my thoughts *easier* in my journal posts than I do in my private exegesis posts.", "parent": "untitled-9-24-2021.txt", "score": 0.4398502707481384}, {"content": "If I start an exegesis brain dump (what I call my [[journal]] entries when I post them to twitter) and post it, it makes me more likely to continue writing in it throughout the day. Once I start writing, more thoughts and ideas come to me. It's as if my brain suddenly realizes there's an outlet for thoughts, and so it generates more of them. Having good conversations has a similar effect. [[writing]] [[personal-reflection]]", "parent": "untitled-10-1-2021.txt", "score": 0.46368610858917236}, {"content": "I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world. ", "parent": "untitled-9-20-2021.txt", "score": 0.5039849281311035}, {"content": "\"I do not want to hamper myself with anything in preparing my notes. I will not introduce any order or system. Whatever I recall, I will write down\"", "parent": "Second Brains.txt", "score": 0.5543256402015686}, {"content": "The world cannot be distilled into neat, concrete categories. Neither can your thoughts. Isn't it time your notes got a little messier?", "parent": "Manifesto.txt", "score": 0.5586263537406921}, {"content": "None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking. ", "parent": "untitled-9-20-2021.txt", "score": 0.5601251125335693}, {"content": "Working on exegesis was a grueling affair at times. I rewrote the schema multiple times, rewrote the backend from scratch 2 months before release, chased countless UI bugs, and manually patched abandoned NPM packages. Part of it may have been due to my inexperience, but [working with ](https://nichwch.medium.com/making-yana-e3fade3f56e7)[rich text](https://medium.engineering/why-contenteditable-is-terrible-122d8a40e480) is just a [difficult task](https://twitter.com/thesephist/status/1360298464349999108), period. At one point, I considered giving up after finding a rival writing app I thought I simply couldn't compete with - I have a copy of an unfinished essay I started writing on why I had given up tucked away somewhere. ", "parent": "Prometheus.txt", "score": 0.5909799933433533}, {"content": "In writing this essay, I checked everything tagged \"exegesis\" and \"personal-reflection\" in exegesis. I didn't tag those thoughts for the purpose of writing this essay, they were written down spontaneously. That they have helped me write this essay is serendipitous. ", "parent": "Second Brains.txt", "score": 0.6017116904258728}, {"content": "I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.", "parent": "Second Brains.txt", "score": 0.6031550168991089}], "rhizome.world": [{"content": "rhizome.world", "parent": "untitled-9-24-2021.txt", "score": 0.0}, {"content": "Two, we will maintain a collective website at [https://rhizome.world/.](https://rhizome.world/.) The site is open source, you can find the repo here: [https://github.com/nichwch/rhizome-club.](https://github.com/nichwch/rhizome-club.) ", "parent": "untitled-9-24-2021.txt", "score": 0.45147353410720825}, {"content": "Nomad Hypertext", "parent": "What is Nomad Hypertext.txt", "score": 0.6875048211709709}, {"content": "projects are cool!", "parent": "Small Projects.txt", "score": 0.7010325789451599}, {"content": "There is yet another world to be discovered - and more than one. Embark, philosophers!\"", "parent": "Why I made exegesis.txt", "score": 0.7266188859939575}, {"content": "At the Recurse center, grinding leetcode and working on nomad hypertext, a collection of interface ideas that center around local-first notetaking powered by semantic search and AI. ", "parent": "NOW-Jan-05-2024.txt", "score": 0.7326679229736328}, {"content": " [[ideas]]: A tool that analyzes a react project and shows your component structure for you in a nice and visual way. Probably already exists, idk", "parent": "untitled-9-20-2021.txt", "score": 0.7411266565322876}, {"content": "Yesterday I had an idea for a club, and I've decided to start it. It will be called the [[Davis Hypertext Society]].", "parent": "untitled-9-24-2021.txt", "score": 0.7412242889404297}, {"content": "If the internet is a hurricane of information, let us build steely exoskeletons to weather the storm.", "parent": "Giant Robots.txt", "score": 0.7441385984420776}, {"content": "This quote reflects a common strain of thinking in Silicon Valley, that our biological selves are hopeless broken, that we need to hack into our brains dopamine-systems and rewire them for maximal productivity, that everything natural is ripe for disruption. This thinking is especially prevalent with the recent rise of PKMs (personal knowledge management systems) like Roam and Notion. Here, an electronic notetaking app is the \"blessed machine\", and your natural memory is the \"flesh that will decay and fail you.\"", "parent": "Second Brains.txt", "score": 0.7498371601104736}], "Yesterday I had an idea for a club, and I've decided to start it. It will be called the [[Davis Hypertext Society]].": [{"content": "Yesterday I had an idea for a club, and I've decided to start it. It will be called the [[Davis Hypertext Society]].", "parent": "untitled-9-24-2021.txt", "score": -5.960464477539062e-07}, {"content": "Tagging this all meta-acropolis, an edtech project I'm in the early stages of working on. Don't have any code for it, just ideas, but I plan on putting something together soon™. [[meta-acropolis]] [[ideas]] ", "parent": "untitled-9-21-2021.txt", "score": 0.5293018817901611}, {"content": "Two, we will maintain a collective website at [https://rhizome.world/.](https://rhizome.world/.) The site is open source, you can find the repo here: [https://github.com/nichwch/rhizome-club.](https://github.com/nichwch/rhizome-club.) ", "parent": "untitled-9-24-2021.txt", "score": 0.5389677882194519}, {"content": "I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-20-2021.txt", "score": 0.553673505783081}, {"content": "That's why I picked the name nomad hypertext. ", "parent": "What is Nomad Hypertext.txt", "score": 0.5703595876693726}, {"content": "Nomad Hypertext", "parent": "What is Nomad Hypertext.txt", "score": 0.5726764236096946}, {"content": "One, it meets up every week to critique a website chosen by members. The website might be one with exceptional design/animations/content/functionality. As a group, we'll discuss what we like about it, what we don't like, and then ideas for using the website's concepts in our own work. We'll also take guesses at how the website works technically, and take a look under the hood to see if our guesses are correct.", "parent": "untitled-9-24-2021.txt", "score": 0.5952229499816895}, {"content": "I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world. ", "parent": "untitled-9-20-2021.txt", "score": 0.5994811058044434}, {"content": "Class starts tomorrow. It's been a while since I've read the strangely authoritarian language of a course syllabus, a long string of \"thou shalt not\"s followed by more prohibitions and percentages. Thinking about the anti-educational-institution streak in certain tech circles and the many projects aiming to replace the university, I wonder if this kind of authoritarianism is inherent to education. Most alt-ed projects promise to liberate students from pointless assessments and the caprice of individual instructors but I wonder if these might be empty promises, like how most revolutionary movements end up becoming oppressive themselves.[[meta-acropolis]] [[ideas]] ", "parent": "untitled-9-21-2021.txt", "score": 0.6055622100830078}, {"content": "The idea will be for members to create their own pages on the site, to experiment with one-off ideas inspired by the website critiques.", "parent": "untitled-9-24-2021.txt", "score": 0.6097626090049744}], " The goal is to recreate the feeling of a musical jam session, but in a website. ": [{"content": " The goal is to recreate the feeling of a musical jam session, but in a website. ", "parent": "untitled-9-24-2021.txt", "score": 0.0}, {"content": "Here, there is context (the theming of the video/playlist), and community (the commenters playing along with the theme). Taken together, they create something that can only be described as a vibe. I don't think you could even come close to doing something this cool with a Spotify playlist.", "parent": "Context and community makes music more enjoyable, and it's missing from modern streaming services.txt", "score": 0.5260998606681824}, {"content": "I'm not really sure how to square this. One idea I've been obsessed with is how I can make the process of writing software more like the process of making music. ", "parent": "NOW PAGE.txt", "score": 0.5270308256149292}, {"content": "The idea will be for members to create their own pages on the site, to experiment with one-off ideas inspired by the website critiques.", "parent": "untitled-9-24-2021.txt", "score": 0.5520583391189575}, {"content": "My dream is to enable something I term \"generational computing.\" I want my kids and my grandkids to someday be able to interface with the artifacts of my digital life. I want them to be able to read my notes and ask an LLM about what I've learned over my life. I want them to be able to chat with a replica of me trained on my writings. I want them to be able to look through the music I made and the music I listened to, and see the connections between the two. I want them to be able to upload their own musical ideas or writings, and see the connections between what they've made and what I've made. ", "parent": "Generational Computing.txt", "score": 0.5571680068969727}, {"content": "One, it meets up every week to critique a website chosen by members. The website might be one with exceptional design/animations/content/functionality. As a group, we'll discuss what we like about it, what we don't like, and then ideas for using the website's concepts in our own work. We'll also take guesses at how the website works technically, and take a look under the hood to see if our guesses are correct.", "parent": "untitled-9-24-2021.txt", "score": 0.5644049644470215}, {"content": "I want this new site to be a space for that.", "parent": "Fragments.txt", "score": 0.5749188661575317}, {"content": "The goal is to keep things creative and lighthearted, to mess around with as many ideas as possible.", "parent": "untitled-9-24-2021.txt", "score": 0.5811483860015869}, {"content": "I enjoy the process of sitting with my guitar, generating riff ideas on the fly, soloing over 8 bar progressions on my looper, but I'm not excited at all about creating a song. In many ways, my feelings about software are kind of the opposite. I have mixed, love/hate feelings about the process of writing software (reading documentation, chasing down bugs, writing tests, etc), but I feel incredibly excited about the end product. ", "parent": "NOW PAGE.txt", "score": 0.5877600908279419}, {"content": "Right now I'm listening to [Something About Us by Daft Punk](https://open.spotify.com/track/1NeLwFETswx8Fzxl2AFl91?si=bc9f206d498e4fdd), which might have something to do with how I'm feeling. What if words aren't enough to express a certain feeling? What if it's only the conjunction of words, images, videos and music, combined not in a determinate order like a moving picture or video, but presented indeterminately, in some form resembling a moodboard? That's the thesis behind [[synesthesia]] (a project I'm working on that will be closely integrated with [[exegesis]]).", "parent": "untitled-9-30-2021.txt", "score": 0.5900663137435913}], "The club does 2 things. ": [{"content": "The club does 2 things. ", "parent": "untitled-9-24-2021.txt", "score": 5.960464477539063e-08}, {"content": "Two, we will maintain a collective website at [https://rhizome.world/.](https://rhizome.world/.) The site is open source, you can find the repo here: [https://github.com/nichwch/rhizome-club.](https://github.com/nichwch/rhizome-club.) ", "parent": "untitled-9-24-2021.txt", "score": 0.6445356607437134}, {"content": "One, it meets up every week to critique a website chosen by members. The website might be one with exceptional design/animations/content/functionality. As a group, we'll discuss what we like about it, what we don't like, and then ideas for using the website's concepts in our own work. We'll also take guesses at how the website works technically, and take a look under the hood to see if our guesses are correct.", "parent": "untitled-9-24-2021.txt", "score": 0.6620898246765137}, {"content": "Yesterday I had an idea for a club, and I've decided to start it. It will be called the [[Davis Hypertext Society]].", "parent": "untitled-9-24-2021.txt", "score": 0.6835410594940186}, {"content": "Learn guitar at least 2 times a week", "parent": "Goals for Spring Quarter.txt", "score": 0.7249748706817627}, {"content": "Priority 2: Activities that are a break from code-related creative work (piano, guitar, fiction/nonfiction reading, drawing, fitness)", "parent": "Goals for Spring Quarter.txt", "score": 0.7444615960121155}, {"content": "Learn piano at least 2 times a week", "parent": "Goals for Spring Quarter.txt", "score": 0.7453104853630066}, {"content": "I'm playing guitar in two bands (one is a cover band, the other is an indie rock band). I'm glad I'm no longer a bedroom guitarist and it feels good to play music with other people, for other people.", "parent": "NOW PAGE.txt", "score": 0.7468558549880981}, {"content": "Lift 3 times a week", "parent": "Goals for Spring Quarter.txt", "score": 0.7486343383789062}, {"content": "It's these details that we miss about music. A song should never just be a song, but on a streaming platform, that's all it can really be - just another row in a playlist. ", "parent": "Context and community makes music more enjoyable, and it's missing from modern streaming services.txt", "score": 0.765315055847168}], "One, it meets up every week to critique a website chosen by members. The website might be one with exceptional design/animations/content/functionality. As a group, we'll discuss what we like about it, what we don't like, and then ideas for using the website's concepts in our own work. We'll also take guesses at how the website works technically, and take a look under the hood to see if our guesses are correct.": [{"content": "One, it meets up every week to critique a website chosen by members. The website might be one with exceptional design/animations/content/functionality. As a group, we'll discuss what we like about it, what we don't like, and then ideas for using the website's concepts in our own work. We'll also take guesses at how the website works technically, and take a look under the hood to see if our guesses are correct.", "parent": "untitled-9-24-2021.txt", "score": -2.384185791015625e-07}, {"content": "The idea will be for members to create their own pages on the site, to experiment with one-off ideas inspired by the website critiques.", "parent": "untitled-9-24-2021.txt", "score": 0.40990549325942993}, {"content": "Two, we will maintain a collective website at [https://rhizome.world/.](https://rhizome.world/.) The site is open source, you can find the repo here: [https://github.com/nichwch/rhizome-club.](https://github.com/nichwch/rhizome-club.) ", "parent": "untitled-9-24-2021.txt", "score": 0.5071665048599243}, {"content": " The goal is to recreate the feeling of a musical jam session, but in a website. ", "parent": "untitled-9-24-2021.txt", "score": 0.5644049644470215}, {"content": "Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.", "parent": "Fragments.txt", "score": 0.5697674751281738}, {"content": "Yesterday I had an idea for a club, and I've decided to start it. It will be called the [[Davis Hypertext Society]].", "parent": "untitled-9-24-2021.txt", "score": 0.5952175855636597}, {"content": "2. My critique here is nothing original - it echoes a lot of what Andy [[Matuschak]] and [[Linus Lee]] have touched upon in their essays. Here's a brief excerpt from [Linus' blog post](https://thesephist.com/posts/browser/) that expresses the point more eloquently: ", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.5965442657470703}, {"content": "Write about progress with code, hobbies, or some idea at least once a week (don't have to publish!)", "parent": "Goals for Spring Quarter.txt", "score": 0.6027761101722717}, {"content": "At the Recurse center, grinding leetcode and working on nomad hypertext, a collection of interface ideas that center around local-first notetaking powered by semantic search and AI. ", "parent": "NOW-Jan-05-2024.txt", "score": 0.6075987219810486}, {"content": "Working on a refactor for [[exegesis]] and [[synesthesia]], thinking about how to budget time. Working strategy is to take estimate for each feature, and double the time for each to account for stupid roadblocks (wifi not working, interrupted by something, bad documentation, etc. etc.) [[code]] [[devlog]] ", "parent": "untitled-9-21-2021.txt", "score": 0.6138250231742859}], "Two, we will maintain a collective website at [https://rhizome.world/.](https://rhizome.world/.) The site is open source, you can find the repo here: [https://github.com/nichwch/rhizome-club.](https://github.com/nichwch/rhizome-club.) ": [{"content": "Two, we will maintain a collective website at [https://rhizome.world/.](https://rhizome.world/.) The site is open source, you can find the repo here: [https://github.com/nichwch/rhizome-club.](https://github.com/nichwch/rhizome-club.) ", "parent": "untitled-9-24-2021.txt", "score": -1.1920928955078125e-07}, {"content": "rhizome.world", "parent": "untitled-9-24-2021.txt", "score": 0.45147353410720825}, {"content": "One, it meets up every week to critique a website chosen by members. The website might be one with exceptional design/animations/content/functionality. As a group, we'll discuss what we like about it, what we don't like, and then ideas for using the website's concepts in our own work. We'll also take guesses at how the website works technically, and take a look under the hood to see if our guesses are correct.", "parent": "untitled-9-24-2021.txt", "score": 0.5071665048599243}, {"content": "Yesterday I had an idea for a club, and I've decided to start it. It will be called the [[Davis Hypertext Society]].", "parent": "untitled-9-24-2021.txt", "score": 0.5389367341995239}, {"content": "The idea will be for members to create their own pages on the site, to experiment with one-off ideas inspired by the website critiques.", "parent": "untitled-9-24-2021.txt", "score": 0.5810980796813965}, {"content": "I want this new site to be a space for that.", "parent": "Fragments.txt", "score": 0.5980347990989685}, {"content": "Fortunately, it looks like there's progress being made here, with projects like [https://github.com/blocks/blocks.](https://github.com/blocks/blocks.) I want to build my own solutions, maybe borrowing from current projects.[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.6139158606529236}, {"content": " The goal is to recreate the feeling of a musical jam session, but in a website. ", "parent": "untitled-9-24-2021.txt", "score": 0.6144962310791016}, {"content": "At the Recurse center, grinding leetcode and working on nomad hypertext, a collection of interface ideas that center around local-first notetaking powered by semantic search and AI. ", "parent": "NOW-Jan-05-2024.txt", "score": 0.6207703948020935}, {"content": "Tagging this all meta-acropolis, an edtech project I'm in the early stages of working on. Don't have any code for it, just ideas, but I plan on putting something together soon™. [[meta-acropolis]] [[ideas]] ", "parent": "untitled-9-21-2021.txt", "score": 0.6235596537590027}], "The idea will be for members to create their own pages on the site, to experiment with one-off ideas inspired by the website critiques.": [{"content": "The idea will be for members to create their own pages on the site, to experiment with one-off ideas inspired by the website critiques.", "parent": "untitled-9-24-2021.txt", "score": -1.1920928955078125e-07}, {"content": "One, it meets up every week to critique a website chosen by members. The website might be one with exceptional design/animations/content/functionality. As a group, we'll discuss what we like about it, what we don't like, and then ideas for using the website's concepts in our own work. We'll also take guesses at how the website works technically, and take a look under the hood to see if our guesses are correct.", "parent": "untitled-9-24-2021.txt", "score": 0.40990549325942993}, {"content": "I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-20-2021.txt", "score": 0.5160160064697266}, {"content": "Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.", "parent": "Fragments.txt", "score": 0.5177814960479736}, {"content": "I want this new site to be a space for that.", "parent": "Fragments.txt", "score": 0.543473482131958}, {"content": " The goal is to recreate the feeling of a musical jam session, but in a website. ", "parent": "untitled-9-24-2021.txt", "score": 0.5520583391189575}, {"content": "Two, we will maintain a collective website at [https://rhizome.world/.](https://rhizome.world/.) The site is open source, you can find the repo here: [https://github.com/nichwch/rhizome-club.](https://github.com/nichwch/rhizome-club.) ", "parent": "untitled-9-24-2021.txt", "score": 0.5810980796813965}, {"content": "I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world. ", "parent": "untitled-9-20-2021.txt", "score": 0.5824781656265259}, {"content": "On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future. ", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.5838941335678101}, {"content": "The goal is to keep things creative and lighthearted, to mess around with as many ideas as possible.", "parent": "untitled-9-24-2021.txt", "score": 0.58925861120224}], "The goal is to keep things creative and lighthearted, to mess around with as many ideas as possible.": [{"content": "The goal is to keep things creative and lighthearted, to mess around with as many ideas as possible.", "parent": "untitled-9-24-2021.txt", "score": 5.960464477539063e-08}, {"content": "My philosophy here is this: it is better to try and make something authentic, beautiful, and expressive and have it turn out bad than it is to hide behind the safeness of minimalism. If you're writing, go ahead and try to sound clever. You might fail and sound incredibly immature, but a fear of failure is disastrous for any creative endeavor. If you're designing something, go all out. Make it bold and loud, and if it turns out gaudy, you can fix it on the next iteration. This was what I tried to do [[exegesis]]' redesign, and so far I'm very happy with it.", "parent": "Minimalism.txt", "score": 0.5232056379318237}, {"content": "I think it's important to have free time to just mess around and be bored, and explore dumb things that might turn out to be not so dumb - after all, \"boredom is that disagreeable 'windless calm' of the soul that precedes a happy voyage and cheerful winds.\" Every activity I eventually took seriously - Model UN in high school, programming in college - started out as an casual hobby I never planned to take seriously. So, I'd rather have slow progress towards my goals and a sizeable chunk of time to mess around, than to fill my days to the point where I have no time to explore at all.", "parent": "Goals for Spring Quarter.txt", "score": 0.5287232995033264}, {"content": "I want to return to my roots. I want to get excited by little ideas and not worry about scaling them, or fitting them into a huge vision, or turning them into legible accomplishments. I still want to be ambitious, but I don't want to let my ambition choke my creativity.", "parent": "Fragments.txt", "score": 0.5504538416862488}, {"content": "Anyone doing creative work must carefully toe the line between two extremes: the collaborative extreme of butchering ideas by putting them into words, the auteur's extreme of refusing to communicate anything about an idea at all. ", "parent": "On auteurs and language.txt", "score": 0.5536806583404541}, {"content": "The compromise that I've arrived at, and that I've tried so far with a decent amount of success, is to draw with my preferred medium (pen), in my own style, while also using a reference. I use the reference for the pose and some of the details, and use my imagination to make up the rest. This is infinitely more interesting for me, and doesn't feel like a dreary technical exercise. I've also given up on using pencil, or charcoal, or anything except pen. I used to harbor a lot of guilt over this, because shouldn't an artist be able to use any medium? Of course, this is ridiculous, it'd be like asking a musician to be familiar with every instrument. It makes far more sense to get really good with one medium than to be mediocre with multiple (feeling some cognitive dissonance here with my desire to learn both the [[piano]] and the [[guitar]]...). Of course, professional artists (and musicians) really should be learning multiple mediums, but I have no aspiration to be professional at either, only to have some fun. [[drawing]] [[piano]] [[guitar]] ", "parent": "Reflections for the New Year.txt", "score": 0.5784099102020264}, {"content": "The assumption behind every collaborative creative endeavor is that language can capture ideas, and that language can mediate between ideas. Those who believe creative collaboration is possible believe that multiple creatives can enter the same room, use language to successfully communicate their ideas, use language to successfully mediate between their ideas, and use language to combine their ideas into a worthwhile final product. ", "parent": "On auteurs and language.txt", "score": 0.579653263092041}, {"content": " The goal is to recreate the feeling of a musical jam session, but in a website. ", "parent": "untitled-9-24-2021.txt", "score": 0.5811483860015869}, {"content": "The idea will be for members to create their own pages on the site, to experiment with one-off ideas inspired by the website critiques.", "parent": "untitled-9-24-2021.txt", "score": 0.58925861120224}, {"content": "Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.", "parent": "Fragments.txt", "score": 0.5993778705596924}], "Fast Jazz": [{"content": "Fast Jazz", "parent": "untitled-9-24-2021.txt", "score": 0.0}, {"content": "I looked up \"fast jazz\" on Spotify and it's not nearly fast enough. Maybe it's the red bull I had this morning.", "parent": "untitled-9-24-2021.txt", "score": 0.47682076692581177}, {"content": "I want to get better at music. I went to [[piano]] classes as a kid and never really enjoyed them or took them seriously. Now I regret it. I also picked up guitar over quarantine, and want to get into a regular practice regimen for both of these instruments. For piano, I want to learn jazz, and how to improvise - I can't say I have much interest in building up my classical repertoire. For guitar, my current plan is to learn the blues, because I hear that's the root of many musical genres, and maybe branch off into rock or jazz later. A short term goal for both instruments is to familiarize myself with their scales. ", "parent": "Reflections for the New Year.txt", "score": 0.6287466883659363}, {"content": "Playing a lot of guitar. Thinking about how fundamental rhythm is to the guitar, even when playing lead lines. Thinking about how you can approach solos like a series of improvised rhythmic riffs. Listening to a lot of King Crimson. ", "parent": "NOW-Jan-05-2024.txt", "score": 0.6332995891571045}, {"content": "[Watch this performance of Autumn Leaves.](https://www.youtube.com/watch?v=7t3xBqAWLaU&list=PLo-DRv8z8J7ouU1ksk8YvSVjXCYLOKPEp&index=75) ", "parent": "Context and community makes music more enjoyable, and it's missing from modern streaming services.txt", "score": 0.6550272703170776}, {"content": " The goal is to recreate the feeling of a musical jam session, but in a website. ", "parent": "untitled-9-24-2021.txt", "score": 0.6568766832351685}, {"content": "I have not really settled into a good practice schedule for either piano or guitar. For the past couple of weeks, I've neglected guitar after moving my electric keyboard into my room, though my piano progress has hardly been good either - I have spent the past couple months playing the same pentatonic licks over Autumn Leaves. My goal for both instruments is to learn a couple of jazz standards with my housemates so we can jam together more. ", "parent": "Goals for Spring Quarter.txt", "score": 0.6684918403625488}, {"content": "Feeling Good", "parent": "untitled-9-30-2021.txt", "score": 0.6730239987373352}, {"content": "Get good at piano", "parent": "Goals for Spring Quarter.txt", "score": 0.6830825805664062}, {"content": "Listening to music", "parent": "untitled-9-21-2021.txt", "score": 0.6856375336647034}], "I looked up \"fast jazz\" on Spotify and it's not nearly fast enough. Maybe it's the red bull I had this morning.": [{"content": "I looked up \"fast jazz\" on Spotify and it's not nearly fast enough. Maybe it's the red bull I had this morning.", "parent": "untitled-9-24-2021.txt", "score": 0.0}, {"content": "Fast Jazz", "parent": "untitled-9-24-2021.txt", "score": 0.47682076692581177}, {"content": "You could easily strip the audio from the video, touch it up a bit, and upload it as Spotify track. However, you'd miss out on so many precious details - how thrilled the old violinist is with the bassist's playing, the chatter from the onlookers praising their playing, the moment the camera pans to show the picturesque Italian street they're playing on, how they stop for a bit and the audience starts clapping prematurely, only to be pleasantly surprised when they start playing again with a faster rhythm.", "parent": "Context and community makes music more enjoyable, and it's missing from modern streaming services.txt", "score": 0.6404149532318115}, {"content": "Some thoughts from this morning. Sitting in the Peet's cafe near the gym at UC Davis, listening to 80s synthwave. ", "parent": "untitled-9-21-2021.txt", "score": 0.6484767198562622}, {"content": "I want to get better at music. I went to [[piano]] classes as a kid and never really enjoyed them or took them seriously. Now I regret it. I also picked up guitar over quarantine, and want to get into a regular practice regimen for both of these instruments. For piano, I want to learn jazz, and how to improvise - I can't say I have much interest in building up my classical repertoire. For guitar, my current plan is to learn the blues, because I hear that's the root of many musical genres, and maybe branch off into rock or jazz later. A short term goal for both instruments is to familiarize myself with their scales. ", "parent": "Reflections for the New Year.txt", "score": 0.6650405526161194}, {"content": "Listening to [[music]] can either be a great aid to [[focus]], or a huge impediment. Sometimes it helps me get in the zone. When it happens, usually the music fades into the background and I'm not even noticing it - this is the sweet spot for focus. Music that I like too much actually distracts me, and music that I don't like enough bores me and I end up wasting time switching what music I listen to. Working without music doesn't seem to be an option at all. I hope maybe [[synesthesia]] will help change my music listening habits? [[personal-reflection]] ", "parent": "untitled-9-21-2021.txt", "score": 0.6654834747314453}, {"content": "Right now I'm listening to [Something About Us by Daft Punk](https://open.spotify.com/track/1NeLwFETswx8Fzxl2AFl91?si=bc9f206d498e4fdd), which might have something to do with how I'm feeling. What if words aren't enough to express a certain feeling? What if it's only the conjunction of words, images, videos and music, combined not in a determinate order like a moving picture or video, but presented indeterminately, in some form resembling a moodboard? That's the thesis behind [[synesthesia]] (a project I'm working on that will be closely integrated with [[exegesis]]).", "parent": "untitled-9-30-2021.txt", "score": 0.6670552492141724}, {"content": "Something weird is happening here - we have access to more music and genres than ever before in human history, and yet it feels like something important is missing. Many of the people I talk to listen to music all the time, but I get the sense that it's more to ward off the dreaded experience of silence than it is to actually enjoy music. ", "parent": "Context and community makes music more enjoyable, and it's missing from modern streaming services.txt", "score": 0.6712399125099182}, {"content": "[Take this video for example.](https://www.youtube.com/watch?v=uMCSdgkdOJc&t=363s) It's titled 'this playlist will make you feel like a 19th century villain,' and it's a playlist full of mostly romantic-era orchestral pieces. But here, the music isn't just the music: there is a stylish photo of classical architecture to go with it, Tchaikovsky is introduced as 'Pyotr F*CKING Tchaikovsky,' and the description contains an edgy sounding Oscar Wilde quote to really set the mood.  Most importantly, the comments section is full of people playing along with the 19th century villain premise, cracking jokes about how the Youtube algorithm clearly wants them to join the Dark Side. One commenter describes the playlist with this pithy remark: \"committing serial homicide at the 1893 world's fair type beat.\"", "parent": "Context and community makes music more enjoyable, and it's missing from modern streaming services.txt", "score": 0.6816368699073792}, {"content": "Here, there is context (the theming of the video/playlist), and community (the commenters playing along with the theme). Taken together, they create something that can only be described as a vibe. I don't think you could even come close to doing something this cool with a Spotify playlist.", "parent": "Context and community makes music more enjoyable, and it's missing from modern streaming services.txt", "score": 0.6843945980072021}], "Focus[[focus]] [[focus-machine]] [[ideas]] ": [{"content": "Focus[[focus]] [[focus-machine]] [[ideas]] ", "parent": "untitled-9-24-2021.txt", "score": -2.384185791015625e-07}, {"content": "The two of these combined could be a powerful tool for focus - something to help you decompose a larger goal into smaller tasks, and something to remind you which particular little task you're working on so you don't get distracted. The less powerful it is the better, because at a certain point having enough features in your todo list means figuring out how to input todos become another todo item. [[focus]] [[focus-machine]] [[ideas]] ", "parent": "untitled-9-24-2021.txt", "score": 0.4042070508003235}, {"content": "I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]] ", "parent": "untitled-9-24-2021.txt", "score": 0.41433417797088623}, {"content": "I've noticed a huge productivity problem for me is not being able to decompose tasks effectively. If I'm in a focused state of mind, this is easy and I can get work done. If I'm not, then something as simple as getting out of bed becomes difficult, because even getting out of bed constitutes a number of distinct tasks that need to be separated and ordered and then executed - physically getting out of bed, brushing my teeth, putting in my contacts, making breakfast, etc. etc. [[focus]] [[focus-machine]] [[ideas]] ", "parent": "untitled-9-24-2021.txt", "score": 0.5154156684875488}, {"content": "At the Recurse center, grinding leetcode and working on nomad hypertext, a collection of interface ideas that center around local-first notetaking powered by semantic search and AI. ", "parent": "NOW-Jan-05-2024.txt", "score": 0.5276823043823242}, {"content": "Tools for creative thought", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.5316122770309448}, {"content": "In my view, the whole movement of [[tools for thought]] (Roam, personal knowledge management systems, etc, etc.) is to make computers help us think better. That was the point from the very start, it was what Steve Jobs meant when he called the computer \"a bicycle for the mind.\" In the last decade, we've seen the very opposite - the use of the computer as an extractive tool, a weapon to siphon attention and harvest data. ", "parent": "Controlling what you see.txt", "score": 0.5447826981544495}, {"content": "Listening to [[music]] can either be a great aid to [[focus]], or a huge impediment. Sometimes it helps me get in the zone. When it happens, usually the music fades into the background and I'm not even noticing it - this is the sweet spot for focus. Music that I like too much actually distracts me, and music that I don't like enough bores me and I end up wasting time switching what music I listen to. Working without music doesn't seem to be an option at all. I hope maybe [[synesthesia]] will help change my music listening habits? [[personal-reflection]] ", "parent": "untitled-9-21-2021.txt", "score": 0.5542269945144653}, {"content": "Fortunately, it looks like there's progress being made here, with projects like [https://github.com/blocks/blocks.](https://github.com/blocks/blocks.) I want to build my own solutions, maybe borrowing from current projects.[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.5560852289199829}, {"content": "In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]", "parent": "untitled-9-24-2021.txt", "score": 0.5570235252380371}], "I've noticed a huge productivity problem for me is not being able to decompose tasks effectively. If I'm in a focused state of mind, this is easy and I can get work done. If I'm not, then something as simple as getting out of bed becomes difficult, because even getting out of bed constitutes a number of distinct tasks that need to be separated and ordered and then executed - physically getting out of bed, brushing my teeth, putting in my contacts, making breakfast, etc. etc. [[focus]] [[focus-machine]] [[ideas]] ": [{"content": "I've noticed a huge productivity problem for me is not being able to decompose tasks effectively. If I'm in a focused state of mind, this is easy and I can get work done. If I'm not, then something as simple as getting out of bed becomes difficult, because even getting out of bed constitutes a number of distinct tasks that need to be separated and ordered and then executed - physically getting out of bed, brushing my teeth, putting in my contacts, making breakfast, etc. etc. [[focus]] [[focus-machine]] [[ideas]] ", "parent": "untitled-9-24-2021.txt", "score": 0.0}, {"content": "I've noticed a strange tradeoff, where the more things I pile into my morning routine (getting in a run, doing hw, etc. etc.) the freer I feel for the rest of the day, but the harder it makes it to actually get out of bed and face these mundane tasks. If I just do what I want in the morning - code side projects - I jump out of bed easily, but then I feel the weight of obligations over me. If I handle obligations in the morning, then the thought of doing boring things makes it hard to get out of bed [[focus]] [[focus-machine]] [[ideas]] ", "parent": "untitled-9-24-2021.txt", "score": 0.3155675530433655}, {"content": "I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]] ", "parent": "untitled-9-24-2021.txt", "score": 0.3190595507621765}, {"content": "The two of these combined could be a powerful tool for focus - something to help you decompose a larger goal into smaller tasks, and something to remind you which particular little task you're working on so you don't get distracted. The less powerful it is the better, because at a certain point having enough features in your todo list means figuring out how to input todos become another todo item. [[focus]] [[focus-machine]] [[ideas]] ", "parent": "untitled-9-24-2021.txt", "score": 0.3704169988632202}, {"content": "Actually, I'm not sure which I prefer yet. I have noticed, however, that sometimes I'll sit down to work for 2 hours, and proceed to waste it all, until the last 20 minutes or so, when I become desperate to get something done so the entire period wasn't a waste of time. That 20 minutes is often incredibly productive. When I only have pockets of 30 minute breaks throughout the day to work on a project, it's like every break is that last 20 minutes of a 2 hour work period. Or not, sometimes I end up getting nothing done, wishing I had 2 hours to do deep, focused work. [[focus]] [[personal-reflection]] ", "parent": "untitled-10-1-2021.txt", "score": 0.42050957679748535}, {"content": "The steady rhythm of school and myriad 30-minute break periods it produces throughout the day have a good effect on my productivity, which is surprising. There's that famous [Paul Graham essay](http://www.paulgraham.com/makersschedule.html) where he talks about hacker schedules, or how programmers/creators prefer long periods of focused time over short fragmented work periods (that managers tend to prefer) because there's an overhead cost to loading a project into your head. [[focus]] [[personal-reflection]] ", "parent": "untitled-10-1-2021.txt", "score": 0.4473905563354492}, {"content": "Listening to [[music]] can either be a great aid to [[focus]], or a huge impediment. Sometimes it helps me get in the zone. When it happens, usually the music fades into the background and I'm not even noticing it - this is the sweet spot for focus. Music that I like too much actually distracts me, and music that I don't like enough bores me and I end up wasting time switching what music I listen to. Working without music doesn't seem to be an option at all. I hope maybe [[synesthesia]] will help change my music listening habits? [[personal-reflection]] ", "parent": "untitled-9-21-2021.txt", "score": 0.5124115347862244}, {"content": "Focus[[focus]] [[focus-machine]] [[ideas]] ", "parent": "untitled-9-24-2021.txt", "score": 0.5154156684875488}, {"content": "This is a lot. I doubt I'll be able to do all of this, and if I fall short on time, I'll have to cut back on some of these activities. They are not listed in order of importance, I plan on figuring that out at a later date. What is important to me is that I actually think about what I want to do, and the priorities for them. It's all to easy to spend a day noodling on guitar, wanting to get better solely because I saw some guy play a fancy solo on Youtube, or to spend a day learning a programming language I'll never use because someone on Twitter praised it. This is a recipe for mediocrity, because progress takes sustained practice, and I can't sustain these sorts of \"inspirations.\" Instead, I want to think slowly and deliberately about what I want to get better at, and stick to a slow and steady plan to improve at it. That is my \"big-picture\" goal for this year. ", "parent": "Reflections for the New Year.txt", "score": 0.5246944427490234}, {"content": "I do think, however, that it's important to have priorities. In the first draft of this, I ordered each of those goals in a list of priorities from top to bottom, but I don't think that was a good way of looking at it. For one, a lot of them are highly related - for example, working on personal projects and learning to code. ", "parent": "Goals for Spring Quarter.txt", "score": 0.5545226335525513}], "I've noticed a strange tradeoff, where the more things I pile into my morning routine (getting in a run, doing hw, etc. etc.) the freer I feel for the rest of the day, but the harder it makes it to actually get out of bed and face these mundane tasks. If I just do what I want in the morning - code side projects - I jump out of bed easily, but then I feel the weight of obligations over me. If I handle obligations in the morning, then the thought of doing boring things makes it hard to get out of bed [[focus]] [[focus-machine]] [[ideas]] ": [{"content": "I've noticed a strange tradeoff, where the more things I pile into my morning routine (getting in a run, doing hw, etc. etc.) the freer I feel for the rest of the day, but the harder it makes it to actually get out of bed and face these mundane tasks. If I just do what I want in the morning - code side projects - I jump out of bed easily, but then I feel the weight of obligations over me. If I handle obligations in the morning, then the thought of doing boring things makes it hard to get out of bed [[focus]] [[focus-machine]] [[ideas]] ", "parent": "untitled-9-24-2021.txt", "score": 2.962350845336914e-05}, {"content": "I've noticed a huge productivity problem for me is not being able to decompose tasks effectively. If I'm in a focused state of mind, this is easy and I can get work done. If I'm not, then something as simple as getting out of bed becomes difficult, because even getting out of bed constitutes a number of distinct tasks that need to be separated and ordered and then executed - physically getting out of bed, brushing my teeth, putting in my contacts, making breakfast, etc. etc. [[focus]] [[focus-machine]] [[ideas]] ", "parent": "untitled-9-24-2021.txt", "score": 0.3158453702926636}, {"content": "The steady rhythm of school and myriad 30-minute break periods it produces throughout the day have a good effect on my productivity, which is surprising. There's that famous [Paul Graham essay](http://www.paulgraham.com/makersschedule.html) where he talks about hacker schedules, or how programmers/creators prefer long periods of focused time over short fragmented work periods (that managers tend to prefer) because there's an overhead cost to loading a project into your head. [[focus]] [[personal-reflection]] ", "parent": "untitled-10-1-2021.txt", "score": 0.43024617433547974}, {"content": "I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]] ", "parent": "untitled-9-24-2021.txt", "score": 0.4485114812850952}, {"content": "Actually, I'm not sure which I prefer yet. I have noticed, however, that sometimes I'll sit down to work for 2 hours, and proceed to waste it all, until the last 20 minutes or so, when I become desperate to get something done so the entire period wasn't a waste of time. That 20 minutes is often incredibly productive. When I only have pockets of 30 minute breaks throughout the day to work on a project, it's like every break is that last 20 minutes of a 2 hour work period. Or not, sometimes I end up getting nothing done, wishing I had 2 hours to do deep, focused work. [[focus]] [[personal-reflection]] ", "parent": "untitled-10-1-2021.txt", "score": 0.4763451814651489}, {"content": "This is a lot. I doubt I'll be able to do all of this, and if I fall short on time, I'll have to cut back on some of these activities. They are not listed in order of importance, I plan on figuring that out at a later date. What is important to me is that I actually think about what I want to do, and the priorities for them. It's all to easy to spend a day noodling on guitar, wanting to get better solely because I saw some guy play a fancy solo on Youtube, or to spend a day learning a programming language I'll never use because someone on Twitter praised it. This is a recipe for mediocrity, because progress takes sustained practice, and I can't sustain these sorts of \"inspirations.\" Instead, I want to think slowly and deliberately about what I want to get better at, and stick to a slow and steady plan to improve at it. That is my \"big-picture\" goal for this year. ", "parent": "Reflections for the New Year.txt", "score": 0.49375003576278687}, {"content": "I think it's important to have free time to just mess around and be bored, and explore dumb things that might turn out to be not so dumb - after all, \"boredom is that disagreeable 'windless calm' of the soul that precedes a happy voyage and cheerful winds.\" Every activity I eventually took seriously - Model UN in high school, programming in college - started out as an casual hobby I never planned to take seriously. So, I'd rather have slow progress towards my goals and a sizeable chunk of time to mess around, than to fill my days to the point where I have no time to explore at all.", "parent": "Goals for Spring Quarter.txt", "score": 0.5165041089057922}, {"content": "The two of these combined could be a powerful tool for focus - something to help you decompose a larger goal into smaller tasks, and something to remind you which particular little task you're working on so you don't get distracted. The less powerful it is the better, because at a certain point having enough features in your todo list means figuring out how to input todos become another todo item. [[focus]] [[focus-machine]] [[ideas]] ", "parent": "untitled-9-24-2021.txt", "score": 0.5208083391189575}, {"content": "I stopped working on little projects. The voice in my head that would get excited by little hints of an idea was drowned out by demands that everything be in the service of something ambitious, something legible, something monetizable. I let my ambition trap me.", "parent": "Fragments.txt", "score": 0.5275821685791016}, {"content": "If I start an exegesis brain dump (what I call my [[journal]] entries when I post them to twitter) and post it, it makes me more likely to continue writing in it throughout the day. Once I start writing, more thoughts and ideas come to me. It's as if my brain suddenly realizes there's an outlet for thoughts, and so it generates more of them. Having good conversations has a similar effect. [[writing]] [[personal-reflection]]", "parent": "untitled-10-1-2021.txt", "score": 0.5337226390838623}], "I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]] ": [{"content": "I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]] ", "parent": "untitled-9-24-2021.txt", "score": -1.1920928955078125e-07}, {"content": "I've noticed a huge productivity problem for me is not being able to decompose tasks effectively. If I'm in a focused state of mind, this is easy and I can get work done. If I'm not, then something as simple as getting out of bed becomes difficult, because even getting out of bed constitutes a number of distinct tasks that need to be separated and ordered and then executed - physically getting out of bed, brushing my teeth, putting in my contacts, making breakfast, etc. etc. [[focus]] [[focus-machine]] [[ideas]] ", "parent": "untitled-9-24-2021.txt", "score": 0.3190595507621765}, {"content": "The two of these combined could be a powerful tool for focus - something to help you decompose a larger goal into smaller tasks, and something to remind you which particular little task you're working on so you don't get distracted. The less powerful it is the better, because at a certain point having enough features in your todo list means figuring out how to input todos become another todo item. [[focus]] [[focus-machine]] [[ideas]] ", "parent": "untitled-9-24-2021.txt", "score": 0.3241530656814575}, {"content": "The main focus here is personal projects - learning more code and writing more are auxiliary activities that help this end. First among these personal projects is [[exegesis]], but I have a number of other personal projects that I want to work on as well. ", "parent": "Goals for Spring Quarter.txt", "score": 0.3982435464859009}, {"content": "Focus[[focus]] [[focus-machine]] [[ideas]] ", "parent": "untitled-9-24-2021.txt", "score": 0.41433417797088623}, {"content": "If this sounds silly, that's because it is. Reality check: note taking apps are just note taking apps; it is supremely arrogant to think that you think you can replicate with a couple KLOCs of javascript code what took evolution thousands of years to perfect. I have stopped thinking about exegesis as a personal knowledge management system or a notetaking app. For me it is the mental equivalent of [perpetual stew](https://en.wikipedia.org/wiki/Perpetual_stew) - I leave it on the stove and toss ideas in whenever its convenient. The effortlessness is the point; if I ever find myself drawing a diagram to have to figure out how to use it, that defeats the purpose of the whole thing.", "parent": "Second Brains.txt", "score": 0.4156094789505005}, {"content": "I want to continue working on [[exegesis]]. There are still a plethora of features I want to build into the app. I have wanted to build something like this for a long time - I sort of did with my last project [YANA](https://yananotes.com/), but the core text engine was so limited that I had to start over from scratch (the product of which is exegesis). I want to sort out a formal list of features before a beta release, and an eventual public release. I will probably use exegesis as a devlog of sorts as well.", "parent": "Reflections for the New Year.txt", "score": 0.4218062162399292}, {"content": "I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.", "parent": "Second Brains.txt", "score": 0.4219459295272827}, {"content": "Also encouraging was the fact that I started hearing about similar notetaking apps a couple months into developing exegesis. Apps like Roam Research, and Obsidian were making waves on Twitter, and were taking a similar approach to nonlinear writing that I wanted to take exegesis in. This proved that I wasn't alone in needing this kind of product. ", "parent": "Second Brains.txt", "score": 0.4245153069496155}, {"content": "I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world. ", "parent": "untitled-9-20-2021.txt", "score": 0.42957764863967896}], "The two of these combined could be a powerful tool for focus - something to help you decompose a larger goal into smaller tasks, and something to remind you which particular little task you're working on so you don't get distracted. The less powerful it is the better, because at a certain point having enough features in your todo list means figuring out how to input todos become another todo item. [[focus]] [[focus-machine]] [[ideas]] ": [{"content": "The two of these combined could be a powerful tool for focus - something to help you decompose a larger goal into smaller tasks, and something to remind you which particular little task you're working on so you don't get distracted. The less powerful it is the better, because at a certain point having enough features in your todo list means figuring out how to input todos become another todo item. [[focus]] [[focus-machine]] [[ideas]] ", "parent": "untitled-9-24-2021.txt", "score": -1.1920928955078125e-07}, {"content": "I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]] ", "parent": "untitled-9-24-2021.txt", "score": 0.3241530656814575}, {"content": "I've noticed a huge productivity problem for me is not being able to decompose tasks effectively. If I'm in a focused state of mind, this is easy and I can get work done. If I'm not, then something as simple as getting out of bed becomes difficult, because even getting out of bed constitutes a number of distinct tasks that need to be separated and ordered and then executed - physically getting out of bed, brushing my teeth, putting in my contacts, making breakfast, etc. etc. [[focus]] [[focus-machine]] [[ideas]] ", "parent": "untitled-9-24-2021.txt", "score": 0.3704169988632202}, {"content": "Focus[[focus]] [[focus-machine]] [[ideas]] ", "parent": "untitled-9-24-2021.txt", "score": 0.4042070508003235}, {"content": "Actually, I'm not sure which I prefer yet. I have noticed, however, that sometimes I'll sit down to work for 2 hours, and proceed to waste it all, until the last 20 minutes or so, when I become desperate to get something done so the entire period wasn't a waste of time. That 20 minutes is often incredibly productive. When I only have pockets of 30 minute breaks throughout the day to work on a project, it's like every break is that last 20 minutes of a 2 hour work period. Or not, sometimes I end up getting nothing done, wishing I had 2 hours to do deep, focused work. [[focus]] [[personal-reflection]] ", "parent": "untitled-10-1-2021.txt", "score": 0.5030933618545532}, {"content": "Listening to [[music]] can either be a great aid to [[focus]], or a huge impediment. Sometimes it helps me get in the zone. When it happens, usually the music fades into the background and I'm not even noticing it - this is the sweet spot for focus. Music that I like too much actually distracts me, and music that I don't like enough bores me and I end up wasting time switching what music I listen to. Working without music doesn't seem to be an option at all. I hope maybe [[synesthesia]] will help change my music listening habits? [[personal-reflection]] ", "parent": "untitled-9-21-2021.txt", "score": 0.517296552658081}, {"content": "I've noticed a strange tradeoff, where the more things I pile into my morning routine (getting in a run, doing hw, etc. etc.) the freer I feel for the rest of the day, but the harder it makes it to actually get out of bed and face these mundane tasks. If I just do what I want in the morning - code side projects - I jump out of bed easily, but then I feel the weight of obligations over me. If I handle obligations in the morning, then the thought of doing boring things makes it hard to get out of bed [[focus]] [[focus-machine]] [[ideas]] ", "parent": "untitled-9-24-2021.txt", "score": 0.519978940486908}, {"content": "I do think, however, that it's important to have priorities. In the first draft of this, I ordered each of those goals in a list of priorities from top to bottom, but I don't think that was a good way of looking at it. For one, a lot of them are highly related - for example, working on personal projects and learning to code. ", "parent": "Goals for Spring Quarter.txt", "score": 0.5222612619400024}, {"content": "\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]] ", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.5293828845024109}, {"content": "That leads to a broader question: why is it that most [[tools for thought]] are also seen as \"note taking apps?\" The introduction of [[roam]] research has inspired a number of other products with the same core backlinking functionality - all of which bill themselves as both tools for thought and note taking apps. This implies that tools for thought and notetaking apps are synonymous, but nobody really thinks this; a decent amount of creators in the tools for thought space object to their creations being called \"note taking apps\", and even the ones who self-describe their projects as note taking apps insist that they're more than just that. This makes sense - the term \"[[tools for thought]]\" evokes something incredibly broad and ambitious, while note taking is a mundane (and arduous) activity. Indeed, it'd be a crying shame if tools for thought were limited to just note taking tools.", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.5352699160575867}], "Visual developer tools": [{"content": "Visual developer tools", "parent": "untitled-9-24-2021.txt", "score": -1.1920928955078125e-07}, {"content": "Front end development should be way more visual. A great deal of front-end development pain points cannot be fixed with fancier libraries and languages, because the fundamental mismatch is trying to create something visual with a text-based tool.[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.45185190439224243}, {"content": "[[ideas]]: As I've matured as a [[React]] developer, I've found certain standard methods of handling things like state management, routing, styling, and data fetching. Because I've standardized on this approach, I've been writing higher order functions that abstract away a lot of the boilerplate. This has me thinking - it would almost certainly be possible to build some kind of visual tool to help scaffold a react app. Something in between no-code and a developer tool - like the [Nx.dev extension for VSCode](https://marketplace.visualstudio.com/items?itemName=nrwl.angular-console). [[code]] ", "parent": "untitled-9-20-2021.txt", "score": 0.4598987102508545}, {"content": "Building tools", "parent": "untitled-9-20-2021.txt", "score": 0.47171342372894287}, {"content": "The vision is to have a tool that provides a visual interface for creating layouts, and maybe even rigging up basic stateful logic, or data fetching logic. I've more or less nailed down a preferred personal stack for creating projects with React, Express and Postgres, so it shouldn't be terribly difficult to even integrate database logic/fetching logic into such a tool (so long as some flexibility is lost on technology choice).[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.48557257652282715}, {"content": "Tools for creative thought", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.5160739421844482}, {"content": " [[ideas]]: A tool that analyzes a react project and shows your component structure for you in a nice and visual way. Probably already exists, idk", "parent": "untitled-9-20-2021.txt", "score": 0.5170661807060242}, {"content": "I want to clarify that I'm not bullish at all on no-code. I think \"no-code\" and \"low-code\" are the wrong way to frame things. There is a place for tools like this, but it's more productive to think of them as \"visual developer tools.\"[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.5288143157958984}, {"content": "For example, I'm starting to suspect that no styling library is going to provide a good experience, because the fundamental pain point is trying to express a visual idea with a text-based set of rules. A styling library can provide some affordances that make things easier - easy theming, dark mode, conditional styles, etc. etc - but the fundamental painful experience of trying to express a visual idea in code cannot be ameliorated with better code tools.[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.5561577677726746}, {"content": "The two big shortcuts I took were using Javascript instead of Typescript and using Electron instead of Tauri. ", "parent": "The making of Nomad Hypertext.txt", "score": 0.5630713701248169}], "Front end development should be way more visual. A great deal of front-end development pain points cannot be fixed with fancier libraries and languages, because the fundamental mismatch is trying to create something visual with a text-based tool.[[code]] [[ideas]] [[tools for thought]] ": [{"content": "Front end development should be way more visual. A great deal of front-end development pain points cannot be fixed with fancier libraries and languages, because the fundamental mismatch is trying to create something visual with a text-based tool.[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": -1.1920928955078125e-07}, {"content": "For example, I'm starting to suspect that no styling library is going to provide a good experience, because the fundamental pain point is trying to express a visual idea with a text-based set of rules. A styling library can provide some affordances that make things easier - easy theming, dark mode, conditional styles, etc. etc - but the fundamental painful experience of trying to express a visual idea in code cannot be ameliorated with better code tools.[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.279681921005249}, {"content": "The vision is to have a tool that provides a visual interface for creating layouts, and maybe even rigging up basic stateful logic, or data fetching logic. I've more or less nailed down a preferred personal stack for creating projects with React, Express and Postgres, so it shouldn't be terribly difficult to even integrate database logic/fetching logic into such a tool (so long as some flexibility is lost on technology choice).[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.418534517288208}, {"content": "[[ideas]]: As I've matured as a [[React]] developer, I've found certain standard methods of handling things like state management, routing, styling, and data fetching. Because I've standardized on this approach, I've been writing higher order functions that abstract away a lot of the boilerplate. This has me thinking - it would almost certainly be possible to build some kind of visual tool to help scaffold a react app. Something in between no-code and a developer tool - like the [Nx.dev extension for VSCode](https://marketplace.visualstudio.com/items?itemName=nrwl.angular-console). [[code]] ", "parent": "untitled-9-20-2021.txt", "score": 0.4412636160850525}, {"content": "I want to clarify that I'm not bullish at all on no-code. I think \"no-code\" and \"low-code\" are the wrong way to frame things. There is a place for tools like this, but it's more productive to think of them as \"visual developer tools.\"[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.4498118758201599}, {"content": "Visual developer tools", "parent": "untitled-9-24-2021.txt", "score": 0.45185190439224243}, {"content": "I hate how flat computer interfaces are. I hate how disembodied sitting in front of a screen makes me feel. I hate straining my eyes to dig through a mountain of text, while my other senses lay unused and completely idle. I hate gigantic codebases with massive piles of dependencies and hour long build processes, where you must test every little idea you have against a mountain of assumptions to make sure it doesn't break anything.", "parent": "NOW PAGE.txt", "score": 0.4656893014907837}, {"content": "Working on exegesis was a grueling affair at times. I rewrote the schema multiple times, rewrote the backend from scratch 2 months before release, chased countless UI bugs, and manually patched abandoned NPM packages. Part of it may have been due to my inexperience, but [working with ](https://nichwch.medium.com/making-yana-e3fade3f56e7)[rich text](https://medium.engineering/why-contenteditable-is-terrible-122d8a40e480) is just a [difficult task](https://twitter.com/thesephist/status/1360298464349999108), period. At one point, I considered giving up after finding a rival writing app I thought I simply couldn't compete with - I have a copy of an unfinished essay I started writing on why I had given up tucked away somewhere. ", "parent": "Prometheus.txt", "score": 0.517606258392334}, {"content": " [[ideas]]: A tool that analyzes a react project and shows your component structure for you in a nice and visual way. Probably already exists, idk", "parent": "untitled-9-20-2021.txt", "score": 0.5256885886192322}, {"content": "I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-20-2021.txt", "score": 0.5400230884552002}], "For example, I'm starting to suspect that no styling library is going to provide a good experience, because the fundamental pain point is trying to express a visual idea with a text-based set of rules. A styling library can provide some affordances that make things easier - easy theming, dark mode, conditional styles, etc. etc - but the fundamental painful experience of trying to express a visual idea in code cannot be ameliorated with better code tools.[[code]] [[ideas]] [[tools for thought]] ": [{"content": "For example, I'm starting to suspect that no styling library is going to provide a good experience, because the fundamental pain point is trying to express a visual idea with a text-based set of rules. A styling library can provide some affordances that make things easier - easy theming, dark mode, conditional styles, etc. etc - but the fundamental painful experience of trying to express a visual idea in code cannot be ameliorated with better code tools.[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": -3.5762786865234375e-07}, {"content": "Front end development should be way more visual. A great deal of front-end development pain points cannot be fixed with fancier libraries and languages, because the fundamental mismatch is trying to create something visual with a text-based tool.[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.279681921005249}, {"content": "[[ideas]]: As I've matured as a [[React]] developer, I've found certain standard methods of handling things like state management, routing, styling, and data fetching. Because I've standardized on this approach, I've been writing higher order functions that abstract away a lot of the boilerplate. This has me thinking - it would almost certainly be possible to build some kind of visual tool to help scaffold a react app. Something in between no-code and a developer tool - like the [Nx.dev extension for VSCode](https://marketplace.visualstudio.com/items?itemName=nrwl.angular-console). [[code]] ", "parent": "untitled-9-20-2021.txt", "score": 0.4471454620361328}, {"content": "The vision is to have a tool that provides a visual interface for creating layouts, and maybe even rigging up basic stateful logic, or data fetching logic. I've more or less nailed down a preferred personal stack for creating projects with React, Express and Postgres, so it shouldn't be terribly difficult to even integrate database logic/fetching logic into such a tool (so long as some flexibility is lost on technology choice).[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.45207738876342773}, {"content": "I want to clarify that I'm not bullish at all on no-code. I think \"no-code\" and \"low-code\" are the wrong way to frame things. There is a place for tools like this, but it's more productive to think of them as \"visual developer tools.\"[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.4550716280937195}, {"content": "I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-20-2021.txt", "score": 0.5156053304672241}, {"content": "I hate how flat computer interfaces are. I hate how disembodied sitting in front of a screen makes me feel. I hate straining my eyes to dig through a mountain of text, while my other senses lay unused and completely idle. I hate gigantic codebases with massive piles of dependencies and hour long build processes, where you must test every little idea you have against a mountain of assumptions to make sure it doesn't break anything.", "parent": "NOW PAGE.txt", "score": 0.5167170763015747}, {"content": "\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]] ", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.5257867574691772}, {"content": "Fortunately, it looks like there's progress being made here, with projects like [https://github.com/blocks/blocks.](https://github.com/blocks/blocks.) I want to build my own solutions, maybe borrowing from current projects.[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.5267701148986816}, {"content": "My philosophy here is this: it is better to try and make something authentic, beautiful, and expressive and have it turn out bad than it is to hide behind the safeness of minimalism. If you're writing, go ahead and try to sound clever. You might fail and sound incredibly immature, but a fear of failure is disastrous for any creative endeavor. If you're designing something, go all out. Make it bold and loud, and if it turns out gaudy, you can fix it on the next iteration. This was what I tried to do [[exegesis]]' redesign, and so far I'm very happy with it.", "parent": "Minimalism.txt", "score": 0.5268807411193848}], "Fortunately, it looks like there's progress being made here, with projects like [https://github.com/blocks/blocks.](https://github.com/blocks/blocks.) I want to build my own solutions, maybe borrowing from current projects.[[code]] [[ideas]] [[tools for thought]] ": [{"content": "Fortunately, it looks like there's progress being made here, with projects like [https://github.com/blocks/blocks.](https://github.com/blocks/blocks.) I want to build my own solutions, maybe borrowing from current projects.[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 7.748603820800781e-07}, {"content": "I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]] ", "parent": "untitled-9-24-2021.txt", "score": 0.4924268126487732}, {"content": "The vision is to have a tool that provides a visual interface for creating layouts, and maybe even rigging up basic stateful logic, or data fetching logic. I've more or less nailed down a preferred personal stack for creating projects with React, Express and Postgres, so it shouldn't be terribly difficult to even integrate database logic/fetching logic into such a tool (so long as some flexibility is lost on technology choice).[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.4928341507911682}, {"content": "I rewrote the indexing software for this blog in Python. The general philosophy of keeping things as modular as possible, storing content in interoperable, plain formats whenever possible, has been paying off. I'm realizing slowly how many other possibilities are opened up by keeping content in plaintext/markdown - I can write a weekend project mapping my blog posts by topic and time, I can create a word cloud visualization of my blog, I can build a game of pong where the blocks are paragraphs of my blogposts, all without touching any existing code. ", "parent": "NOW PAGE.txt", "score": 0.4934995770454407}, {"content": "As far as learning more code goes, I want to branch out beyond full-stack web development. The two \"trendy\" technologies I'd like to learn more about are blockchain and AI/ML. For the former, I want to learn more about Ethereum development, and for the latter, I want to review some basic linear algebra before adventuring further. I've heard good things about [huggingface](https://huggingface.co/), and want to explore that further. I want to spend some time learning about these technologies around 3 times a week, maybe for an hour or two a session. ", "parent": "Goals for Spring Quarter.txt", "score": 0.503454327583313}, {"content": "Tagging this all meta-acropolis, an edtech project I'm in the early stages of working on. Don't have any code for it, just ideas, but I plan on putting something together soon™. [[meta-acropolis]] [[ideas]] ", "parent": "untitled-9-21-2021.txt", "score": 0.5100731253623962}, {"content": "projects are cool!", "parent": "Small Projects.txt", "score": 0.5102899670600891}, {"content": "I want to continue working on [[exegesis]]. There are still a plethora of features I want to build into the app. I have wanted to build something like this for a long time - I sort of did with my last project [YANA](https://yananotes.com/), but the core text engine was so limited that I had to start over from scratch (the product of which is exegesis). I want to sort out a formal list of features before a beta release, and an eventual public release. I will probably use exegesis as a devlog of sorts as well.", "parent": "Reflections for the New Year.txt", "score": 0.5128380060195923}, {"content": "The main focus here is personal projects - learning more code and writing more are auxiliary activities that help this end. First among these personal projects is [[exegesis]], but I have a number of other personal projects that I want to work on as well. ", "parent": "Goals for Spring Quarter.txt", "score": 0.5155091285705566}, {"content": "To make regular progress towards personal projects, I'll be writing more on my development progress with [[exegesis]], under the tag [[devlog]]. I'll also be publishing another post soon on my plans for future features, and when I expect to release them by. I will do something similar with my other projects.", "parent": "Goals for Spring Quarter.txt", "score": 0.5183426141738892}], "I want to clarify that I'm not bullish at all on no-code. I think \"no-code\" and \"low-code\" are the wrong way to frame things. There is a place for tools like this, but it's more productive to think of them as \"visual developer tools.\"[[code]] [[ideas]] [[tools for thought]] ": [{"content": "I want to clarify that I'm not bullish at all on no-code. I think \"no-code\" and \"low-code\" are the wrong way to frame things. There is a place for tools like this, but it's more productive to think of them as \"visual developer tools.\"[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 2.980232238769531e-07}, {"content": "[[ideas]]: As I've matured as a [[React]] developer, I've found certain standard methods of handling things like state management, routing, styling, and data fetching. Because I've standardized on this approach, I've been writing higher order functions that abstract away a lot of the boilerplate. This has me thinking - it would almost certainly be possible to build some kind of visual tool to help scaffold a react app. Something in between no-code and a developer tool - like the [Nx.dev extension for VSCode](https://marketplace.visualstudio.com/items?itemName=nrwl.angular-console). [[code]] ", "parent": "untitled-9-20-2021.txt", "score": 0.4393826127052307}, {"content": "Front end development should be way more visual. A great deal of front-end development pain points cannot be fixed with fancier libraries and languages, because the fundamental mismatch is trying to create something visual with a text-based tool.[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.4498118758201599}, {"content": "For example, I'm starting to suspect that no styling library is going to provide a good experience, because the fundamental pain point is trying to express a visual idea with a text-based set of rules. A styling library can provide some affordances that make things easier - easy theming, dark mode, conditional styles, etc. etc - but the fundamental painful experience of trying to express a visual idea in code cannot be ameliorated with better code tools.[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.4550716280937195}, {"content": "The vision is to have a tool that provides a visual interface for creating layouts, and maybe even rigging up basic stateful logic, or data fetching logic. I've more or less nailed down a preferred personal stack for creating projects with React, Express and Postgres, so it shouldn't be terribly difficult to even integrate database logic/fetching logic into such a tool (so long as some flexibility is lost on technology choice).[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.49824249744415283}, {"content": "\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]] ", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.5063264966011047}, {"content": "Fortunately, it looks like there's progress being made here, with projects like [https://github.com/blocks/blocks.](https://github.com/blocks/blocks.) I want to build my own solutions, maybe borrowing from current projects.[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.5092378854751587}, {"content": "This is not groundbreaking news, but it's groundbreaking for me. I started my software engineering career writing code with cloud applications in mind, and the idea that you can ship cool projects without running database migrations or doing extensive backtesting against your monolith *is* groundbreaking to me. In college I wanted my own blog and instead of getting a static site generator I built out a cloud application with NextJS, PostgreSQL and Heroku. I did learn a lot and it helped me land my first internship, but now it strikes me as an incredibly wrong minded approach. ", "parent": "NOW PAGE.txt", "score": 0.5125464200973511}, {"content": "In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]", "parent": "untitled-9-24-2021.txt", "score": 0.5287162065505981}, {"content": "Visual developer tools", "parent": "untitled-9-24-2021.txt", "score": 0.5288143157958984}], "The vision is to have a tool that provides a visual interface for creating layouts, and maybe even rigging up basic stateful logic, or data fetching logic. I've more or less nailed down a preferred personal stack for creating projects with React, Express and Postgres, so it shouldn't be terribly difficult to even integrate database logic/fetching logic into such a tool (so long as some flexibility is lost on technology choice).[[code]] [[ideas]] [[tools for thought]] ": [{"content": "The vision is to have a tool that provides a visual interface for creating layouts, and maybe even rigging up basic stateful logic, or data fetching logic. I've more or less nailed down a preferred personal stack for creating projects with React, Express and Postgres, so it shouldn't be terribly difficult to even integrate database logic/fetching logic into such a tool (so long as some flexibility is lost on technology choice).[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.0}, {"content": "[[ideas]]: As I've matured as a [[React]] developer, I've found certain standard methods of handling things like state management, routing, styling, and data fetching. Because I've standardized on this approach, I've been writing higher order functions that abstract away a lot of the boilerplate. This has me thinking - it would almost certainly be possible to build some kind of visual tool to help scaffold a react app. Something in between no-code and a developer tool - like the [Nx.dev extension for VSCode](https://marketplace.visualstudio.com/items?itemName=nrwl.angular-console). [[code]] ", "parent": "untitled-9-20-2021.txt", "score": 0.271403968334198}, {"content": " [[ideas]]: A tool that analyzes a react project and shows your component structure for you in a nice and visual way. Probably already exists, idk", "parent": "untitled-9-20-2021.txt", "score": 0.35380810499191284}, {"content": "Front end development should be way more visual. A great deal of front-end development pain points cannot be fixed with fancier libraries and languages, because the fundamental mismatch is trying to create something visual with a text-based tool.[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.418534517288208}, {"content": "For example, I'm starting to suspect that no styling library is going to provide a good experience, because the fundamental pain point is trying to express a visual idea with a text-based set of rules. A styling library can provide some affordances that make things easier - easy theming, dark mode, conditional styles, etc. etc - but the fundamental painful experience of trying to express a visual idea in code cannot be ameliorated with better code tools.[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.45207738876342773}, {"content": "I want to learn more code. Working on [[exegesis]] over the course of a year, I saw my coding ability improve substantially. Towards the last 2 months, while rewriting a part of the codebase, I found myself dumbfounded by some of the decisions and patterns I had used a year earlier. The code I wrote towards the end was noticeably cleaner and more maintainable, mostly because I had familiarized myself with [[React]] hooks. Learning NextJS and GraphQL was also very rewarding, and both technologies were used extensively in the final version of exegesis. Looking forwards, I am thinking about learning Go, Clojure and maybe Rust. Go is the most practical one of all these for my purposes, and could open up a lot of job offers. Clojure is the most interesting from a theoretical standpoint, since I've never used a lisp or functional language. Rust is interesting because I hate systems/low-level programming, but I suspect that might only be because I hate C, and maybe Rust's more modern features will sell me on it. ", "parent": "Reflections for the New Year.txt", "score": 0.4727131724357605}, {"content": "Visual developer tools", "parent": "untitled-9-24-2021.txt", "score": 0.48557257652282715}, {"content": "Fortunately, it looks like there's progress being made here, with projects like [https://github.com/blocks/blocks.](https://github.com/blocks/blocks.) I want to build my own solutions, maybe borrowing from current projects.[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.492786169052124}, {"content": "I want to clarify that I'm not bullish at all on no-code. I think \"no-code\" and \"low-code\" are the wrong way to frame things. There is a place for tools like this, but it's more productive to think of them as \"visual developer tools.\"[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.49824249744415283}, {"content": "Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.", "parent": "Fragments.txt", "score": 0.5108121633529663}], "Thinking as social": [{"content": "Thinking as social", "parent": "untitled-9-24-2021.txt", "score": -2.384185791015625e-07}, {"content": "Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]] ", "parent": "untitled-9-20-2021.txt", "score": 0.5230958461761475}, {"content": "Maybe Computer Science is a social science", "parent": "untitled-10-11-2021.txt", "score": 0.5279119610786438}, {"content": "Naturally, [[Habermas]]'s thoughts on the public sphere - which referred to salons, coffee shops and other public spaces in his day, and probably the internet today - are relevant to the social features of [[exegesis]]. ", "parent": "untitled-9-21-2021.txt", "score": 0.5541515350341797}, {"content": "Habermas", "parent": "untitled-9-21-2021.txt", "score": 0.5562254190444946}, {"content": "Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]] ", "parent": "Controlling what you see.txt", "score": 0.5582756996154785}, {"content": "Tools for rational thought", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.5679247975349426}, {"content": "In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]", "parent": "untitled-9-24-2021.txt", "score": 0.5913302898406982}, {"content": "The social sciences are infamous for being subject to the \"[double hermeneutic.](https://en.wikipedia.org/wiki/Double_hermeneutic)\" \"Hermeneutic\" means \"understanding\" or \"interpretation.\"  The term double hermeneutic in social science refers to the fact the social sciences study human behavior, but human beings are just as able to study social science. The process of observation goes both ways.", "parent": "untitled-10-11-2021.txt", "score": 0.5931515693664551}, {"content": "Tools for creative thought", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.5932560563087463}], "Talking to Emma Salinas, I tried convincing her that exegesis was a useful tool for personal reflection. She wasn't convinced, so I asked her what she thought a good way for personal reflection was, and she responded \"talking to people.\" ": [{"content": "Talking to Emma Salinas, I tried convincing her that exegesis was a useful tool for personal reflection. She wasn't convinced, so I asked her what she thought a good way for personal reflection was, and she responded \"talking to people.\" ", "parent": "untitled-9-24-2021.txt", "score": -2.384185791015625e-07}, {"content": "My favorite use of [[exegesis]] is to write down ideas that I have. I write about exegesis in exegesis, and a lot of features that I've added to exegesis started as sudden thoughts that were captured in exegesis. In my experience, ideas are like seeds, and writing them down helps them grow. I might think nothing of a simple idea I capture one day, but a week later it might have renewed significance, and it could even spark new ideas. ", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.44402724504470825}, {"content": "I originally thought of [[exegesis]] as a tool for rational thought as well - I wanted to use it to organize my notes, and hoped it would make me better at retaining information at school. After more than a year of using it, it turns out I almost never use it for either of those things.", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.445581316947937}, {"content": "Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]] ", "parent": "untitled-9-20-2021.txt", "score": 0.4485361576080322}, {"content": "In writing this essay, I checked everything tagged \"exegesis\" and \"personal-reflection\" in exegesis. I didn't tag those thoughts for the purpose of writing this essay, they were written down spontaneously. That they have helped me write this essay is serendipitous. ", "parent": "Second Brains.txt", "score": 0.45322340726852417}, {"content": "Having done this daily exegesis braindump [[journal]] thing for a bit, I think there's something of value to her response. I get down my thoughts *easier* in my journal posts than I do in my private exegesis posts.", "parent": "untitled-9-24-2021.txt", "score": 0.4759272336959839}, {"content": "What is the point of exegesis then? The point is serendipity - it's a place for me to capture little scraps of thought - ideas, feelings, anything that comes to you at the moment. ", "parent": "Second Brains.txt", "score": 0.4813409447669983}, {"content": "I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world. ", "parent": "untitled-9-20-2021.txt", "score": 0.4824158549308777}, {"content": "What do I use [[exegesis]] for? I use it like a journal. I write down thoughts about my life, ideas that I have, things that I'd like to do, reflections on my day, etc. etc. None of these things could be called knowledge, none of them could be called rational.", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.4870232343673706}, {"content": "I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-20-2021.txt", "score": 0.48757046461105347}], "That was an interesting reply, and it really got me thinking. She said something along the lines of [[twitter]] being her favorite [[tools for thought]]. ": [{"content": "That was an interesting reply, and it really got me thinking. She said something along the lines of [[twitter]] being her favorite [[tools for thought]]. ", "parent": "untitled-9-24-2021.txt", "score": 0.0}, {"content": "Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]] ", "parent": "Controlling what you see.txt", "score": 0.4766101837158203}, {"content": "\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]] ", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.48124247789382935}, {"content": "Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]] ", "parent": "untitled-9-20-2021.txt", "score": 0.486333429813385}, {"content": "That leads to a broader question: why is it that most [[tools for thought]] are also seen as \"note taking apps?\" The introduction of [[roam]] research has inspired a number of other products with the same core backlinking functionality - all of which bill themselves as both tools for thought and note taking apps. This implies that tools for thought and notetaking apps are synonymous, but nobody really thinks this; a decent amount of creators in the tools for thought space object to their creations being called \"note taking apps\", and even the ones who self-describe their projects as note taking apps insist that they're more than just that. This makes sense - the term \"[[tools for thought]]\" evokes something incredibly broad and ambitious, while note taking is a mundane (and arduous) activity. Indeed, it'd be a crying shame if tools for thought were limited to just note taking tools.", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.49697375297546387}, {"content": "In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]", "parent": "untitled-9-24-2021.txt", "score": 0.5055736303329468}, {"content": "Of course, this is a bit of a strawman. Nobody who works seriously in [[tools for thought]] really believes that tools for thought are limited to just note taking apps. Still, to the general public, and to casual followers, this seems to be the actual perception. It also seems fair to say that this perception is not entirely misguided - while not all tools for thought are note-taking apps, a disproportionate amount of them are.", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.5105706453323364}, {"content": "I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-20-2021.txt", "score": 0.5119837522506714}, {"content": "If I start an exegesis brain dump (what I call my [[journal]] entries when I post them to twitter) and post it, it makes me more likely to continue writing in it throughout the day. Once I start writing, more thoughts and ideas come to me. It's as if my brain suddenly realizes there's an outlet for thoughts, and so it generates more of them. Having good conversations has a similar effect. [[writing]] [[personal-reflection]]", "parent": "untitled-10-1-2021.txt", "score": 0.514911949634552}, {"content": "Talking to Emma Salinas, I tried convincing her that exegesis was a useful tool for personal reflection. She wasn't convinced, so I asked her what she thought a good way for personal reflection was, and she responded \"talking to people.\" ", "parent": "untitled-9-24-2021.txt", "score": 0.518180787563324}], "Having done this daily exegesis braindump [[journal]] thing for a bit, I think there's something of value to her response. I get down my thoughts *easier* in my journal posts than I do in my private exegesis posts.": [{"content": "Having done this daily exegesis braindump [[journal]] thing for a bit, I think there's something of value to her response. I get down my thoughts *easier* in my journal posts than I do in my private exegesis posts.", "parent": "untitled-9-24-2021.txt", "score": -5.960464477539062e-07}, {"content": "I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world. ", "parent": "untitled-9-20-2021.txt", "score": 0.2637183666229248}, {"content": "If I start an exegesis brain dump (what I call my [[journal]] entries when I post them to twitter) and post it, it makes me more likely to continue writing in it throughout the day. Once I start writing, more thoughts and ideas come to me. It's as if my brain suddenly realizes there's an outlet for thoughts, and so it generates more of them. Having good conversations has a similar effect. [[writing]] [[personal-reflection]]", "parent": "untitled-10-1-2021.txt", "score": 0.31161385774612427}, {"content": "My favorite use of [[exegesis]] is to write down ideas that I have. I write about exegesis in exegesis, and a lot of features that I've added to exegesis started as sudden thoughts that were captured in exegesis. In my experience, ideas are like seeds, and writing them down helps them grow. I might think nothing of a simple idea I capture one day, but a week later it might have renewed significance, and it could even spark new ideas. ", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.3624923825263977}, {"content": "What do I use [[exegesis]] for? I use it like a journal. I write down thoughts about my life, ideas that I have, things that I'd like to do, reflections on my day, etc. etc. None of these things could be called knowledge, none of them could be called rational.", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.3767580986022949}, {"content": "In some sense exegesis gave birth to itself, because I used it to organize my ideas about exegesis. On days where exegesis was not working because I had broken something while coding it, I noticed that I could not think as clearly. Its absence was felt.", "parent": "Second Brains.txt", "score": 0.43504834175109863}, {"content": "What is the point of exegesis then? The point is serendipity - it's a place for me to capture little scraps of thought - ideas, feelings, anything that comes to you at the moment. ", "parent": "Second Brains.txt", "score": 0.43765687942504883}, {"content": "I did not do a braindump yesterday, the words did not flow easily. Best not to force these things. [[journal]] ", "parent": "untitled-9-24-2021.txt", "score": 0.4398502707481384}, {"content": "In writing this essay, I checked everything tagged \"exegesis\" and \"personal-reflection\" in exegesis. I didn't tag those thoughts for the purpose of writing this essay, they were written down spontaneously. That they have helped me write this essay is serendipitous. ", "parent": "Second Brains.txt", "score": 0.4457933306694031}, {"content": "I want to write more. I don't really care about writing \"better\" or more \"professionally\", because I don't write for a living, and I'm not really interested in selling people on my opinions. Instead, I want to write to broadcast my interests, so I can attract others who have similar interests. Hopefully, [[exegesis]] will be an able and capable platform for me to do this. ", "parent": "Reflections for the New Year.txt", "score": 0.45614105463027954}], "In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]": [{"content": "In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]", "parent": "untitled-9-24-2021.txt", "score": 2.384185791015625e-07}, {"content": "On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future. ", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.32704657316207886}, {"content": "\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]] ", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.34199070930480957}, {"content": "I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-20-2021.txt", "score": 0.34477782249450684}, {"content": "That leads to a broader question: why is it that most [[tools for thought]] are also seen as \"note taking apps?\" The introduction of [[roam]] research has inspired a number of other products with the same core backlinking functionality - all of which bill themselves as both tools for thought and note taking apps. This implies that tools for thought and notetaking apps are synonymous, but nobody really thinks this; a decent amount of creators in the tools for thought space object to their creations being called \"note taking apps\", and even the ones who self-describe their projects as note taking apps insist that they're more than just that. This makes sense - the term \"[[tools for thought]]\" evokes something incredibly broad and ambitious, while note taking is a mundane (and arduous) activity. Indeed, it'd be a crying shame if tools for thought were limited to just note taking tools.", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.36432838439941406}, {"content": "Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]] ", "parent": "untitled-9-20-2021.txt", "score": 0.36461126804351807}, {"content": "Tools for creative thought", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.37011510133743286}, {"content": "In my view, the whole movement of [[tools for thought]] (Roam, personal knowledge management systems, etc, etc.) is to make computers help us think better. That was the point from the very start, it was what Steve Jobs meant when he called the computer \"a bicycle for the mind.\" In the last decade, we've seen the very opposite - the use of the computer as an extractive tool, a weapon to siphon attention and harvest data. ", "parent": "Controlling what you see.txt", "score": 0.38096725940704346}, {"content": "[[roam]] is a tool for rational thought. More broadly, any tool that subscribes to something like a Zettelkasten or Evergreen notes philosophy is a tool for rational thought. The selling point of a tool for rational thought is to manage knowledge - no wonder, since another commonly used name for these tools is PKM (Personal Knowledge Management). ", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.3924952745437622}, {"content": "Creative tools vs rational tools", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.41750335693359375}]}