{"The previous method of working I sketched out in this blog (working on small projects, writing about them in public) is not working for me. It was working for me for a while, mostly while I was building at the Recurse center, but it's not anymore, and it's because I just don't feel motivated to work on lots of small projects that no one uses. ": [{"content": "The previous method of working I sketched out in this blog (working on small projects, writing about them in public) is not working for me. It was working for me for a while, mostly while I was building at the Recurse center, but it's not anymore, and it's because I just don't feel motivated to work on lots of small projects that no one uses. ", "parent": "An Update.txt", "score": -2.220446049250313e-16}, {"content": "The good news is I've found a method of working on side projects that does work for me: working on one side project at a time, with the intention of getting real users. This is a way of working I previously tried explicitly to steer away from - I've written previously on my blog that I wanted to work on lots of small projects instead of obsessively on one big project. ", "parent": "An Update.txt", "score": 0.3108244070750933}, {"content": "I've written previously about local first computing. I still agree with everything in principle, but the truth is I don't have the chops to push forward the technology behind it, and the tools simply aren't simply developed enough to build something regular people can use. For the time being, I will build cloud apps, because that's what regular people will use, and it matters to me that people actually use what I've built (another reason to give up trying to build research prototypes).", "parent": "An Update.txt", "score": 0.42953092396372494}, {"content": "I stopped working on little projects. The voice in my head that would get excited by little hints of an idea was drowned out by demands that everything be in the service of something ambitious, something legible, something monetizable. I let my ambition trap me.", "parent": "Fragments.txt", "score": 0.4472658634185791}, {"content": "There was a problem with both of these outlets, however: my short attention span. I struggled to work on larger drawings, because I'd give up on them and start new doodles. The same happened with code projects.", "parent": "Fragments.txt", "score": 0.4554157853126526}, {"content": "I want to try a different approach this time. There will be no central organizing idea or principle. Playing the guitar taught me that my creative process works best when I'm free to noodle on the ideas that are immediately interesting to me, not ideas that are part of some preset plan. I have fond memories of sitting on the bus back from my first internship, cracking open my laptop, deciding to try and hack together a first version of YANA. I feel considerably less nostalgic for the late nights I spent during the pandemic trying to \"scale\" my idea, wrestling with pitch decks and AWS dashboards. I had lots of other ideas at the time, but didn't work on them because I felt focusing on exegesis was the correct thing to do. When I first started playing the guitar, I felt guilty learning other songs if I hadn't finished learning a past song. In reality, giving up on songs/concepts I wasn't interested in was incredibly good for my learning in the long run (provided I was still learning new things).", "parent": "Interface Work.txt", "score": 0.4570996165275574}, {"content": "I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]] ", "parent": "untitled-9-24-2021.txt", "score": 0.46674108505249023}, {"content": "I don't care if my work gets noticed, or if it's any good, or if it leads to anything at all. I don't know if I have any talent for interface research, but it seems like I might - my sophomore year of college, I designed a notetaking tool called YANA with a novel interface where you could select text and then add tags to it. The response to it was very positive, which encouraged me to try and build a startup out of it, which unfortunately led to me becoming monomaniacally obsessed with that idea at the expense of trying to explore any other ideas (an obsession I only shed once I made Nomad Hypertext, which I could call a \"finished\" product). ", "parent": "Interface Work.txt", "score": 0.48756396770477295}, {"content": "I rewrote the indexing software for this blog in Python. The general philosophy of keeping things as modular as possible, storing content in interoperable, plain formats whenever possible, has been paying off. I'm realizing slowly how many other possibilities are opened up by keeping content in plaintext/markdown - I can write a weekend project mapping my blog posts by topic and time, I can create a word cloud visualization of my blog, I can build a game of pong where the blocks are paragraphs of my blogposts, all without touching any existing code. ", "parent": "NOW PAGE.txt", "score": 0.4956856966018677}, {"content": "Working on a refactor for [[exegesis]] and [[synesthesia]], thinking about how to budget time. Working strategy is to take estimate for each feature, and double the time for each to account for stupid roadblocks (wifi not working, interrupted by something, bad documentation, etc. etc.) [[code]] [[devlog]] ", "parent": "untitled-9-21-2021.txt", "score": 0.5009127855300903}], "": [{"content": "~", "parent": "NOW PAGE.txt", "score": 0.6013319492340088}, {"content": "~", "parent": "Fragments.txt", "score": 0.6013319492340088}, {"content": "~", "parent": "Fragments.txt", "score": 0.6013319492340088}, {"content": "~", "parent": "Plaintext is your best friend.txt", "score": 0.6013771295547485}, {"content": "~", "parent": "untitled-1-4-2022.txt", "score": 0.6013792157173157}, {"content": "~", "parent": "The making of Nomad Hypertext.txt", "score": 0.6014099717140198}, {"content": "~", "parent": "The making of Nomad Hypertext.txt", "score": 0.6014099717140198}, {"content": "~", "parent": "Second Brains.txt", "score": 0.6014099717140198}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 0.6014099717140198}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 0.6014099717140198}], "The good news is I've found a method of working on side projects that does work for me: working on one side project at a time, with the intention of getting real users. This is a way of working I previously tried explicitly to steer away from - I've written previously on my blog that I wanted to work on lots of small projects instead of obsessively on one big project. ": [{"content": "The good news is I've found a method of working on side projects that does work for me: working on one side project at a time, with the intention of getting real users. This is a way of working I previously tried explicitly to steer away from - I've written previously on my blog that I wanted to work on lots of small projects instead of obsessively on one big project. ", "parent": "An Update.txt", "score": 2.220446049250313e-16}, {"content": "The previous method of working I sketched out in this blog (working on small projects, writing about them in public) is not working for me. It was working for me for a while, mostly while I was building at the Recurse center, but it's not anymore, and it's because I just don't feel motivated to work on lots of small projects that no one uses. ", "parent": "An Update.txt", "score": 0.3108244070750933}, {"content": "I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]] ", "parent": "untitled-9-24-2021.txt", "score": 0.4222487807273865}, {"content": "This is a lot. I doubt I'll be able to do all of this, and if I fall short on time, I'll have to cut back on some of these activities. They are not listed in order of importance, I plan on figuring that out at a later date. What is important to me is that I actually think about what I want to do, and the priorities for them. It's all to easy to spend a day noodling on guitar, wanting to get better solely because I saw some guy play a fancy solo on Youtube, or to spend a day learning a programming language I'll never use because someone on Twitter praised it. This is a recipe for mediocrity, because progress takes sustained practice, and I can't sustain these sorts of \"inspirations.\" Instead, I want to think slowly and deliberately about what I want to get better at, and stick to a slow and steady plan to improve at it. That is my \"big-picture\" goal for this year. ", "parent": "Reflections for the New Year.txt", "score": 0.4716777205467224}, {"content": "For a while, I exclusively worked on a long, serious projects. I wanted to build a billion dollar product. I wanted to be the founder of a successful startup. I wanted to write, but I wanted to write on my own platform that everybody else would also write on, that would have all the features I wanted that everybody else would love.", "parent": "Fragments.txt", "score": 0.4718273878097534}, {"content": "The idea is to just make a ton of side projects and put them all here. I have some preliminary ideas on how I can organize this but I'm not particularly set on anything right now. I don't feel particularly limited by framework choice either - with the liberal use of iFrames, I can simply embed other projects using different frameworks here. I've already done that with a project I've created with Svelte.", "parent": "Fragments.txt", "score": 0.47574496269226074}, {"content": "I want to try a different approach this time. There will be no central organizing idea or principle. Playing the guitar taught me that my creative process works best when I'm free to noodle on the ideas that are immediately interesting to me, not ideas that are part of some preset plan. I have fond memories of sitting on the bus back from my first internship, cracking open my laptop, deciding to try and hack together a first version of YANA. I feel considerably less nostalgic for the late nights I spent during the pandemic trying to \"scale\" my idea, wrestling with pitch decks and AWS dashboards. I had lots of other ideas at the time, but didn't work on them because I felt focusing on exegesis was the correct thing to do. When I first started playing the guitar, I felt guilty learning other songs if I hadn't finished learning a past song. In reality, giving up on songs/concepts I wasn't interested in was incredibly good for my learning in the long run (provided I was still learning new things).", "parent": "Interface Work.txt", "score": 0.48636293411254883}, {"content": "This is not groundbreaking news, but it's groundbreaking for me. I started my software engineering career writing code with cloud applications in mind, and the idea that you can ship cool projects without running database migrations or doing extensive backtesting against your monolith *is* groundbreaking to me. In college I wanted my own blog and instead of getting a static site generator I built out a cloud application with NextJS, PostgreSQL and Heroku. I did learn a lot and it helped me land my first internship, but now it strikes me as an incredibly wrong minded approach. ", "parent": "NOW PAGE.txt", "score": 0.4868851900100708}, {"content": "The main focus here is personal projects - learning more code and writing more are auxiliary activities that help this end. First among these personal projects is [[exegesis]], but I have a number of other personal projects that I want to work on as well. ", "parent": "Goals for Spring Quarter.txt", "score": 0.48901144406313823}, {"content": "I do think, however, that it's important to have priorities. In the first draft of this, I ordered each of those goals in a list of priorities from top to bottom, but I don't think that was a good way of looking at it. For one, a lot of them are highly related - for example, working on personal projects and learning to code. ", "parent": "Goals for Spring Quarter.txt", "score": 0.5021401436928814}], "I am not cut out for serious research. I am not an expert in any field and do not have the ability to contribute to any kind of frontier research. What I am capable of is building simple but creatively designed tools for simple problems I do understand. I have some more grandiose ideas that have contain some promise, but they will only come to fruition if I stay humble and rooted. I am not going to reinvent computing, and that's OK. ": [{"content": "I am not cut out for serious research. I am not an expert in any field and do not have the ability to contribute to any kind of frontier research. What I am capable of is building simple but creatively designed tools for simple problems I do understand. I have some more grandiose ideas that have contain some promise, but they will only come to fruition if I stay humble and rooted. I am not going to reinvent computing, and that's OK. ", "parent": "An Update.txt", "score": -2.220446049250313e-16}, {"content": "I've written previously about local first computing. I still agree with everything in principle, but the truth is I don't have the chops to push forward the technology behind it, and the tools simply aren't simply developed enough to build something regular people can use. For the time being, I will build cloud apps, because that's what regular people will use, and it matters to me that people actually use what I've built (another reason to give up trying to build research prototypes).", "parent": "An Update.txt", "score": 0.3626963075704853}, {"content": "I don't care if my work gets noticed, or if it's any good, or if it leads to anything at all. I don't know if I have any talent for interface research, but it seems like I might - my sophomore year of college, I designed a notetaking tool called YANA with a novel interface where you could select text and then add tags to it. The response to it was very positive, which encouraged me to try and build a startup out of it, which unfortunately led to me becoming monomaniacally obsessed with that idea at the expense of trying to explore any other ideas (an obsession I only shed once I made Nomad Hypertext, which I could call a \"finished\" product). ", "parent": "Interface Work.txt", "score": 0.453072190284729}, {"content": "I don't expect to be able to do anything particularly impressive. I have a day job and other life obligations. Maybe nothing comes out of this, except a few dozen half baked demos and write-ups of those demos. That's fine, at least I'll be able to say I put an honest effort into making cool interfaces.", "parent": "Interface Work.txt", "score": 0.4837167263031006}, {"content": "My dream is to enable something I term \"generational computing.\" I want my kids and my grandkids to someday be able to interface with the artifacts of my digital life. I want them to be able to read my notes and ask an LLM about what I've learned over my life. I want them to be able to chat with a replica of me trained on my writings. I want them to be able to look through the music I made and the music I listened to, and see the connections between the two. I want them to be able to upload their own musical ideas or writings, and see the connections between what they've made and what I've made. ", "parent": "Generational Computing.txt", "score": 0.5154179930686951}, {"content": "The previous method of working I sketched out in this blog (working on small projects, writing about them in public) is not working for me. It was working for me for a while, mostly while I was building at the Recurse center, but it's not anymore, and it's because I just don't feel motivated to work on lots of small projects that no one uses. ", "parent": "An Update.txt", "score": 0.5195375898747729}, {"content": "I want to return to my roots. I want to get excited by little ideas and not worry about scaling them, or fitting them into a huge vision, or turning them into legible accomplishments. I still want to be ambitious, but I don't want to let my ambition choke my creativity.", "parent": "Fragments.txt", "score": 0.5196204781532288}, {"content": "If this sounds silly, that's because it is. Reality check: note taking apps are just note taking apps; it is supremely arrogant to think that you think you can replicate with a couple KLOCs of javascript code what took evolution thousands of years to perfect. I have stopped thinking about exegesis as a personal knowledge management system or a notetaking app. For me it is the mental equivalent of [perpetual stew](https://en.wikipedia.org/wiki/Perpetual_stew) - I leave it on the stove and toss ideas in whenever its convenient. The effortlessness is the point; if I ever find myself drawing a diagram to have to figure out how to use it, that defeats the purpose of the whole thing.", "parent": "Second Brains.txt", "score": 0.5262657403945923}, {"content": "I want to clarify that I'm not bullish at all on no-code. I think \"no-code\" and \"low-code\" are the wrong way to frame things. There is a place for tools like this, but it's more productive to think of them as \"visual developer tools.\"[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.5322730541229248}, {"content": "I want to try a different approach this time. There will be no central organizing idea or principle. Playing the guitar taught me that my creative process works best when I'm free to noodle on the ideas that are immediately interesting to me, not ideas that are part of some preset plan. I have fond memories of sitting on the bus back from my first internship, cracking open my laptop, deciding to try and hack together a first version of YANA. I feel considerably less nostalgic for the late nights I spent during the pandemic trying to \"scale\" my idea, wrestling with pitch decks and AWS dashboards. I had lots of other ideas at the time, but didn't work on them because I felt focusing on exegesis was the correct thing to do. When I first started playing the guitar, I felt guilty learning other songs if I hadn't finished learning a past song. In reality, giving up on songs/concepts I wasn't interested in was incredibly good for my learning in the long run (provided I was still learning new things).", "parent": "Interface Work.txt", "score": 0.5340616703033447}], "I've written previously about local first computing. I still agree with everything in principle, but the truth is I don't have the chops to push forward the technology behind it, and the tools simply aren't simply developed enough to build something regular people can use. For the time being, I will build cloud apps, because that's what regular people will use, and it matters to me that people actually use what I've built (another reason to give up trying to build research prototypes).": [{"content": "I've written previously about local first computing. I still agree with everything in principle, but the truth is I don't have the chops to push forward the technology behind it, and the tools simply aren't simply developed enough to build something regular people can use. For the time being, I will build cloud apps, because that's what regular people will use, and it matters to me that people actually use what I've built (another reason to give up trying to build research prototypes).", "parent": "An Update.txt", "score": 3.747348858995636e-07}, {"content": "I am not cut out for serious research. I am not an expert in any field and do not have the ability to contribute to any kind of frontier research. What I am capable of is building simple but creatively designed tools for simple problems I do understand. I have some more grandiose ideas that have contain some promise, but they will only come to fruition if I stay humble and rooted. I am not going to reinvent computing, and that's OK. ", "parent": "An Update.txt", "score": 0.3626611027228237}, {"content": "Local-first AI presents a huge opportunity to change this. Like the now-dominant paradigms of web and mobile computing, a local-first future is not a forgone conclusion - but it is possible. What if we tried really hard to make filesystems and composable, small, programs usable for ordinary people? What if we designed software in a way that allowed people to take control of their own data? What if we made a bet on increasing computer literacy, rather than surrendering ourselves to infantilizing users?  ", "parent": "The AI-first operating system of the future.txt", "score": 0.392646849155426}, {"content": "My hope is that local-first AI and CRDTs enable us to create decentralized, local first software that will stand the tests of time. This is why I'm so bullish on local first applications, plain text, file systems, and unix - they have already stood the tests of time, and will likely continue to. They are deeply lindy in a way that mobile and cloud computing are not. ", "parent": "Generational Computing.txt", "score": 0.3943019509315491}, {"content": "The previous method of working I sketched out in this blog (working on small projects, writing about them in public) is not working for me. It was working for me for a while, mostly while I was building at the Recurse center, but it's not anymore, and it's because I just don't feel motivated to work on lots of small projects that no one uses. ", "parent": "An Update.txt", "score": 0.42954235702741284}, {"content": "This is not groundbreaking news, but it's groundbreaking for me. I started my software engineering career writing code with cloud applications in mind, and the idea that you can ship cool projects without running database migrations or doing extensive backtesting against your monolith *is* groundbreaking to me. In college I wanted my own blog and instead of getting a static site generator I built out a cloud application with NextJS, PostgreSQL and Heroku. I did learn a lot and it helped me land my first internship, but now it strikes me as an incredibly wrong minded approach. ", "parent": "NOW PAGE.txt", "score": 0.4321995973587036}, {"content": "I don't care if my work gets noticed, or if it's any good, or if it leads to anything at all. I don't know if I have any talent for interface research, but it seems like I might - my sophomore year of college, I designed a notetaking tool called YANA with a novel interface where you could select text and then add tags to it. The response to it was very positive, which encouraged me to try and build a startup out of it, which unfortunately led to me becoming monomaniacally obsessed with that idea at the expense of trying to explore any other ideas (an obsession I only shed once I made Nomad Hypertext, which I could call a \"finished\" product). ", "parent": "Interface Work.txt", "score": 0.48834770917892456}, {"content": "The counter argument here is that people don't want to use files, and they don't want to manage their own systems. I don't think this is a forgone conclusion. Think about how much effort has been poured into making new technologies like touchscreens and AI legible to ordinary people. ", "parent": "The AI-first operating system of the future.txt", "score": 0.49378979206085205}, {"content": "I want to clarify that I'm not bullish at all on no-code. I think \"no-code\" and \"low-code\" are the wrong way to frame things. There is a place for tools like this, but it's more productive to think of them as \"visual developer tools.\"[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.4999484419822693}, {"content": "Fortunately, it looks like there's progress being made here, with projects like [https://github.com/blocks/blocks.](https://github.com/blocks/blocks.) I want to build my own solutions, maybe borrowing from current projects.[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.5009564757347107}], "I turned 25 a month ago. As a teenager, it was easy to harbor all sorts of fantasies about someday uncovering some hidden genius within myself and changing the world. In my early twenties, I'd sometimes still dream of this. No longer. I am not throwing in the towel, I am not giving up on trying to make an impact on the world, but I am giving up on the hope that I have some kind of extraordinary talent. I don't, and that's fine. I am merely competent at many things and that's enough - history is full of men with merely average talent that achieved great things. ": [{"content": "I turned 25 a month ago. As a teenager, it was easy to harbor all sorts of fantasies about someday uncovering some hidden genius within myself and changing the world. In my early twenties, I'd sometimes still dream of this. No longer. I am not throwing in the towel, I am not giving up on trying to make an impact on the world, but I am giving up on the hope that I have some kind of extraordinary talent. I don't, and that's fine. I am merely competent at many things and that's enough - history is full of men with merely average talent that achieved great things. ", "parent": "An Update.txt", "score": 4.795899595233521e-07}, {"content": "I feel open to the future. I feel that there is meaning in this world, even if I don't know what it is currently, and it may be impossible to pin it down with words. I feel that the bad things that happen in this world do not lead to the conclusion that the world is a bad place. I feel ok not being able to explain everything. I feel I have something valuable to offer to others, I feel others have something valuable to offer to me. Change seems possible, albeit slow, and slowness feels OK. ", "parent": "untitled-9-30-2021.txt", "score": 0.5667287707328796}, {"content": "I want to return to my roots. I want to get excited by little ideas and not worry about scaling them, or fitting them into a huge vision, or turning them into legible accomplishments. I still want to be ambitious, but I don't want to let my ambition choke my creativity.", "parent": "Fragments.txt", "score": 0.5710686445236206}, {"content": "I am not cut out for serious research. I am not an expert in any field and do not have the ability to contribute to any kind of frontier research. What I am capable of is building simple but creatively designed tools for simple problems I do understand. I have some more grandiose ideas that have contain some promise, but they will only come to fruition if I stay humble and rooted. I am not going to reinvent computing, and that's OK. ", "parent": "An Update.txt", "score": 0.5835106323141439}, {"content": "As I grew older, I tried to fix myself in various ways. I tried blocking out all of my time in a calendar. I tried blocking distracting websites. I tried living my life in a three-ring binder. I tried planners, I tried meditation, I tried todo lists, I tried kanban boards. I tried to not care, I tried caring too much. ", "parent": "Why I made exegesis.txt", "score": 0.603626012802124}, {"content": "This is a lot. I doubt I'll be able to do all of this, and if I fall short on time, I'll have to cut back on some of these activities. They are not listed in order of importance, I plan on figuring that out at a later date. What is important to me is that I actually think about what I want to do, and the priorities for them. It's all to easy to spend a day noodling on guitar, wanting to get better solely because I saw some guy play a fancy solo on Youtube, or to spend a day learning a programming language I'll never use because someone on Twitter praised it. This is a recipe for mediocrity, because progress takes sustained practice, and I can't sustain these sorts of \"inspirations.\" Instead, I want to think slowly and deliberately about what I want to get better at, and stick to a slow and steady plan to improve at it. That is my \"big-picture\" goal for this year. ", "parent": "Reflections for the New Year.txt", "score": 0.608933687210083}, {"content": "I stopped working on little projects. The voice in my head that would get excited by little hints of an idea was drowned out by demands that everything be in the service of something ambitious, something legible, something monetizable. I let my ambition trap me.", "parent": "Fragments.txt", "score": 0.6105815172195435}, {"content": "I think it's important to have free time to just mess around and be bored, and explore dumb things that might turn out to be not so dumb - after all, \"boredom is that disagreeable 'windless calm' of the soul that precedes a happy voyage and cheerful winds.\" Every activity I eventually took seriously - Model UN in high school, programming in college - started out as an casual hobby I never planned to take seriously. So, I'd rather have slow progress towards my goals and a sizeable chunk of time to mess around, than to fill my days to the point where I have no time to explore at all.", "parent": "Goals for Spring Quarter.txt", "score": 0.611250672667551}, {"content": "Creative inadequacy", "parent": "untitled-9-22-2021.txt", "score": 0.6141612529754639}, {"content": "I don't expect to be able to do anything particularly impressive. I have a day job and other life obligations. Maybe nothing comes out of this, except a few dozen half baked demos and write-ups of those demos. That's fine, at least I'll be able to say I put an honest effort into making cool interfaces.", "parent": "Interface Work.txt", "score": 0.6266048550605774}], "In the spirit of all this, I've been working on a musical journaling app that connects to your Spotify and allows you to leave notes on your music. It is not going to revolutionize computing, but it has helped me reflect more on my musical inspirations and shape my guitar playing. It's pretty far along, and I'm proud of what I've built, but I'm waiting on Spotify to approve my API integration request. I can't wait to show you when it's ready.": [{"content": "In the spirit of all this, I've been working on a musical journaling app that connects to your Spotify and allows you to leave notes on your music. It is not going to revolutionize computing, but it has helped me reflect more on my musical inspirations and shape my guitar playing. It's pretty far along, and I'm proud of what I've built, but I'm waiting on Spotify to approve my API integration request. I can't wait to show you when it's ready.", "parent": "An Update.txt", "score": 0.0}, {"content": "Yesterday I released the first version of a project I've been working on for a while. It's called Synesthesia, and it's a social music journaling app. You can find it at [synesthesia.club](https://synesthesia.club)", "parent": "Synesthesia.txt", "score": 0.3738933751734098}, {"content": "This app feels like the culmination of everything I've been working towards in my 20s. I started working on my first software side projects in college when I was 20, and also started learning how to play the guitar around then. This project is a synthesis of almost all my interests: software, music, and design. ", "parent": "Synesthesia.txt", "score": 0.38706358086636206}, {"content": "I'll keep the description brief because I'd rather you just try it, but it lets you take notes on the songs you listen to, and organize those notes with tags and mentions of other songs. You can also share these notes on your public profile, which is handy if you want to share your inspirations with your band mates.", "parent": "Synesthesia.txt", "score": 0.42557607182419666}, {"content": "I'm not really sure how to square this. One idea I've been obsessed with is how I can make the process of writing software more like the process of making music. ", "parent": "NOW PAGE.txt", "score": 0.44790858030319214}, {"content": "I enjoy the process of sitting with my guitar, generating riff ideas on the fly, soloing over 8 bar progressions on my looper, but I'm not excited at all about creating a song. In many ways, my feelings about software are kind of the opposite. I have mixed, love/hate feelings about the process of writing software (reading documentation, chasing down bugs, writing tests, etc), but I feel incredibly excited about the end product. ", "parent": "NOW PAGE.txt", "score": 0.47052866220474243}, {"content": "I might not really care for making music, but learning how to play the guitar showed me what I'm looking for from a creative process. If I can form a creative process that feels like playing the guitar and outputs software, that would be very rewarding.", "parent": "NOW PAGE.txt", "score": 0.4719013571739197}, {"content": "I want to continue working on [[exegesis]]. There are still a plethora of features I want to build into the app. I have wanted to build something like this for a long time - I sort of did with my last project [YANA](https://yananotes.com/), but the core text engine was so limited that I had to start over from scratch (the product of which is exegesis). I want to sort out a formal list of features before a beta release, and an eventual public release. I will probably use exegesis as a devlog of sorts as well.", "parent": "Reflections for the New Year.txt", "score": 0.4853377938270569}, {"content": "I want to try a different approach this time. There will be no central organizing idea or principle. Playing the guitar taught me that my creative process works best when I'm free to noodle on the ideas that are immediately interesting to me, not ideas that are part of some preset plan. I have fond memories of sitting on the bus back from my first internship, cracking open my laptop, deciding to try and hack together a first version of YANA. I feel considerably less nostalgic for the late nights I spent during the pandemic trying to \"scale\" my idea, wrestling with pitch decks and AWS dashboards. I had lots of other ideas at the time, but didn't work on them because I felt focusing on exegesis was the correct thing to do. When I first started playing the guitar, I felt guilty learning other songs if I hadn't finished learning a past song. In reality, giving up on songs/concepts I wasn't interested in was incredibly good for my learning in the long run (provided I was still learning new things).", "parent": "Interface Work.txt", "score": 0.49684804677963257}, {"content": "My goal in life right now is to focus more on programming, while keeping music as a hobby. I want to improve at both, and someday I'd like to unite these two interests - not in some surface level way like getting really into digital signal processing or generative music, but by making the process of writing software more like the process of making music (intuitive, embodied, modular, composable).", "parent": "NOW PAGE.txt", "score": 0.505469799041748}]}