{"It's been a few weeks since I've released Synesthesia. Overall I'm pretty happy with it. A lot of people told me they thought it was really cool, fewer people actually signed up to use it, but a few of my musical friends told me they've actually found it useful for their work. ": [{"content": "It's been a few weeks since I've released Synesthesia. Overall I'm pretty happy with it. A lot of people told me they thought it was really cool, fewer people actually signed up to use it, but a few of my musical friends told me they've actually found it useful for their work. ", "parent": "Narcissus.txt", "score": 7.09195727699452e-07}, {"content": "Yesterday I released the first version of a project I've been working on for a while. It's called Synesthesia, and it's a social music journaling app. You can find it at [synesthesia.club](https://synesthesia.club).", "parent": "Synesthesia.txt", "score": 0.29384374618530273}, {"content": "Right now I'm listening to [Something About Us by Daft Punk](https://open.spotify.com/track/1NeLwFETswx8Fzxl2AFl91?si=bc9f206d498e4fdd), which might have something to do with how I'm feeling. What if words aren't enough to express a certain feeling? What if it's only the conjunction of words, images, videos and music, combined not in a determinate order like a moving picture or video, but presented indeterminately, in some form resembling a moodboard? That's the thesis behind [[synesthesia]] (a project I'm working on that will be closely integrated with [[exegesis]]).", "parent": "untitled-9-30-2021.txt", "score": 0.47826075553894043}, {"content": "In the spirit of all this, I've been working on a musical journaling app that connects to your Spotify and allows you to leave notes on your music. It is not going to revolutionize computing, but it has helped me reflect more on my musical inspirations and shape my guitar playing. It's pretty far along, and I'm proud of what I've built, but I'm waiting on Spotify to approve my API integration request. I can't wait to show you when it's ready.", "parent": "An Update.txt", "score": 0.49097877740859985}, {"content": "It feels good to finally have it released. I hope someone other than myself finds it useful.", "parent": "Synesthesia.txt", "score": 0.5141165256500244}, {"content": "TikTok has normalized tying music to everything - political messages, dances, jokes, short videos, etc. etc. Aiming to help do something similar with [[synesthesia]], but focused more on explicitly creative output. ", "parent": "untitled-9-20-2021.txt", "score": 0.5218439698219299}, {"content": "Reflecting on how this went, I'm glad I branched out into another project, but I honestly don't really care about Gridworld all that much. It feels disconnected from everything else I made and I'm not super interested in following up more on it. I think the approach of working on one main project with breaks to work on smaller projects is a good one, but I want those smaller projects to be more related to my main project. I have lots of side project ideas related to tools for thought and music. I thought it'd be cool to do LLM research for its own sake, but I've realized I don't care all that much about the fundamental properties of LLMs - I care more about using them as a tool to build the things I already want to build. There are plenty of possibilities there, for example adding semantic search to Synesthesia to supplement the tagging system (which I honestly do not like at all). As I continue to build side projects in my spare time I want to keep this in mind.", "parent": "Gridworld.txt", "score": 0.5355938585322884}, {"content": "You can also see a [map](https://www.synesthesia.club/profile/0b6b5e78-406f-44f6-839b-1537e98226a7/map) of all the links between songs in your notes, and [annotate your playlists](https://www.synesthesia.club/profile/0b6b5e78-406f-44f6-839b-1537e98226a7/playlists/1GeybUR1YfELXoaGLnA8IE) with your thoughts.", "parent": "Synesthesia.txt", "score": 0.5395493507385254}, {"content": "[leave a comment on substack](https://nickchen.substack.com/p/synesthesia)", "parent": "Synesthesia.txt", "score": 0.5459584593772888}, {"content": "This was reassuring, because it meant I had made something genuinely useful. In the past, I have made things I simply had no desire to use - one example is [JAFT](https://nichwch.medium.com/what-is-jaft-f543a4fad9d7), a time tracking app I made after making YANA (the predecessor to exegesis). I stopped using it after a bit, and didn't bother renewing the domain. I don't miss JAFT at all. The fact that I did miss exegesis on the days where it wasn't operational was a good sign.", "parent": "Second Brains.txt", "score": 0.547661304473877}], "": [{"content": "~", "parent": "NOW PAGE.txt", "score": 0.6013319492340088}, {"content": "~", "parent": "Fragments.txt", "score": 0.6013319492340088}, {"content": "~", "parent": "Fragments.txt", "score": 0.6013319492340088}, {"content": "~", "parent": "Plaintext is your best friend.txt", "score": 0.6013771295547485}, {"content": "~", "parent": "untitled-1-4-2022.txt", "score": 0.6013792157173157}, {"content": "~", "parent": "The making of Nomad Hypertext.txt", "score": 0.6014099717140198}, {"content": "~", "parent": "The making of Nomad Hypertext.txt", "score": 0.6014099717140198}, {"content": "~", "parent": "Second Brains.txt", "score": 0.6014099717140198}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 0.6014099717140198}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 0.6014099717140198}], "I'm happy someone other than me finds the tool useful. My worst fear is creating something nobody but myself finds useful, because then there's no way of knowing if I actually made something useful, or if I just adapted so well to using my own tool that I tricked myself into thinking its useful. ": [{"content": "I'm happy someone other than me finds the tool useful. My worst fear is creating something nobody but myself finds useful, because then there's no way of knowing if I actually made something useful, or if I just adapted so well to using my own tool that I tricked myself into thinking its useful. ", "parent": "Narcissus.txt", "score": 4.397549030477066e-07}, {"content": "It feels good to finally have it released. I hope someone other than myself finds it useful.", "parent": "Synesthesia.txt", "score": 0.39281588792800903}, {"content": "1) One of the best feelings when you're making something is the first time you personally find it useful. An uncomfortable corollary of the argument here, however, is that you should be suspicious of this feeling - you are at risk of becoming the servomechanism of what you are making.", "parent": "Narcissus.txt", "score": 0.3989133012513716}, {"content": "This was reassuring, because it meant I had made something genuinely useful. In the past, I have made things I simply had no desire to use - one example is [JAFT](https://nichwch.medium.com/what-is-jaft-f543a4fad9d7), a time tracking app I made after making YANA (the predecessor to exegesis). I stopped using it after a bit, and didn't bother renewing the domain. I don't miss JAFT at all. The fact that I did miss exegesis on the days where it wasn't operational was a good sign.", "parent": "Second Brains.txt", "score": 0.44170206785202026}, {"content": "You adapt the tool to your own needs. That's good, that's what you should do when you make a tool: adapt it to your needs. The sinister part is that whenever you use a tool, it changes you too. As you adapt the tool to yourself, you also adapt to the tool, and if you have no external feedback, that forms the closed system that McLuhan thinks characterizes Narcissus' situation and also man's relationship with technology.", "parent": "Narcissus.txt", "score": 0.4711793109631125}, {"content": "Is this tool actually useful? I think so. So far, the thing I appreciate most about this tool is that it can show me if I've been interested in an idea for a long time. It can tell me that I really appreciated someone's company (or that I found them to be a nuisance) all the way back in January. It can tell me that some of the problems I'm dealing with now I've been dealing with for months, and that I should probably do something about it immediately.", "parent": "Interface Journal: Summary Tool.txt", "score": 0.473608136177063}, {"content": "A safer (and more correct) assumption: *you* serve your tools, not the other way around. This puts a much higher burden on a designer - you are not making something people will use, you are making something people will (consciously or not) adapt themselves to and *serve*. Thinking this way puts you in a much more paranoid state of mind, which I believe is the correct stance to take towards technology. (1)", "parent": "Narcissus.txt", "score": 0.47413631261235556}, {"content": "I found this chapter of Understanding Media haunting because this happens to me all the time. I find myself obsessed with an idea, try to build it, get a working prototype, and refine the prototype in isolation - without realizing that the lack of external feedback means I'm created a closed feedback loop where I am adapting myself to a tool that I myself am making. A closed system like this converges towards a tool that is useful to no one at all.", "parent": "Narcissus.txt", "score": 0.4772400254063769}, {"content": "I don't care if my work gets noticed, or if it's any good, or if it leads to anything at all. I don't know if I have any talent for interface research, but it seems like I might - my sophomore year of college, I designed a notetaking tool called YANA with a novel interface where you could select text and then add tags to it. The response to it was very positive, which encouraged me to try and build a startup out of it, which unfortunately led to me becoming monomaniacally obsessed with that idea at the expense of trying to explore any other ideas (an obsession I only shed once I made Nomad Hypertext, which I could call a \"finished\" product). ", "parent": "Interface Work.txt", "score": 0.5045353174209595}, {"content": "In high school, I made this [platformer game](https://nichwch.itch.io/machinegods) that I thought was quite easy but my friends found to be incredibly difficult. It turned out that I'd developed an incredible amount of muscle memory while testing the game out. I'm always scared that something similar will happen with the applications that I design. It's worse because I code and design my own projects, and sometimes it's not clear if I designed something because it's intuitive, or because it matches the database schema more cleanly. On the one hand, it feels incredibly elegant to have your design to express the same consistent schema both in its user-facing interface and its inner workings. On the other hand, isn't your job as a designer to shield your users from complexity?", "parent": "Narcissus.txt", "score": 0.5302519433222396}], "In high school, I made this [platformer game](https://nichwch.itch.io/machinegods) that I thought was quite easy but my friends found to be incredibly difficult. It turned out that I'd developed an incredible amount of muscle memory while testing the game out. I'm always scared that something similar will happen with the applications that I design. It's worse because I code and design my own projects, and sometimes it's not clear if I designed something because it's intuitive, or because it matches the database schema more cleanly. On the one hand, it feels incredibly elegant to have your design to express the same consistent schema both in its user-facing interface and its inner workings. On the other hand, isn't your job as a designer to shield your users from complexity?": [{"content": "In high school, I made this [platformer game](https://nichwch.itch.io/machinegods) that I thought was quite easy but my friends found to be incredibly difficult. It turned out that I'd developed an incredible amount of muscle memory while testing the game out. I'm always scared that something similar will happen with the applications that I design. It's worse because I code and design my own projects, and sometimes it's not clear if I designed something because it's intuitive, or because it matches the database schema more cleanly. On the one hand, it feels incredibly elegant to have your design to express the same consistent schema both in its user-facing interface and its inner workings. On the other hand, isn't your job as a designer to shield your users from complexity?", "parent": "Narcissus.txt", "score": 3.848380222271075e-07}, {"content": "Why did it take so long? Part of it is just a lack of experience. While making exegesis, I changed the database schema countless times, wrote dozens of migrations, accidentally wiped my database once (thank God for RDS backups), and rewrote the backend from scratch 2 months before release. There was also a good amount of feature creep. Whenever I thought I was close to finished, something unexpected would pop up - I started writing this essay 3 months before I actually released exegesis. Whatever the reason, if you count development time on the predecessor to exegesis, I've spent almost a tenth of my life building this. The entire project clocks in at a couple thousand lines of code. It is the largest, most complex, and most difficult thing I have built so far in my life.  [The last time I worked on a project this long, it was the first video game I made back in my senior year of high school.](https://medium.com/@nichwch/machine-gods-devlog-1-166dff474366) Even then, it was really about 6 months of development total, with a huge gap in between because of school, and it was all made with no-code game development tools, because back then the idea of using actual code terrified me. [[exegesis]] [[personal-reflection]] ", "parent": "Reflections on exegesis.txt", "score": 0.4088135361671448}, {"content": "I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.", "parent": "Second Brains.txt", "score": 0.4193122982978821}, {"content": "Working on exegesis was a grueling affair at times. I rewrote the schema multiple times, rewrote the backend from scratch 2 months before release, chased countless UI bugs, and manually patched abandoned NPM packages. Part of it may have been due to my inexperience, but [working with ](https://nichwch.medium.com/making-yana-e3fade3f56e7)[rich text](https://medium.engineering/why-contenteditable-is-terrible-122d8a40e480) is just a [difficult task](https://twitter.com/thesephist/status/1360298464349999108), period. At one point, I considered giving up after finding a rival writing app I thought I simply couldn't compete with - I have a copy of an unfinished essay I started writing on why I had given up tucked away somewhere. ", "parent": "Prometheus.txt", "score": 0.43297553062438965}, {"content": "That last project had a significant effect on me. Back in high school, I was heavily involved in Model UN and other political clubs. Making the [game](https://nichwch.itch.io/machinegods) made me realize it was making things and not winning arguments that really made me happier. It was also what convinced me that programming could be something more than rote problem solving, and even be a genuine creative medium. It was why I switched my major from Economics to Computer Science in college.[[personal-reflection]] ", "parent": "Reflections on exegesis.txt", "score": 0.4389086961746216}, {"content": "I don't care if my work gets noticed, or if it's any good, or if it leads to anything at all. I don't know if I have any talent for interface research, but it seems like I might - my sophomore year of college, I designed a notetaking tool called YANA with a novel interface where you could select text and then add tags to it. The response to it was very positive, which encouraged me to try and build a startup out of it, which unfortunately led to me becoming monomaniacally obsessed with that idea at the expense of trying to explore any other ideas (an obsession I only shed once I made Nomad Hypertext, which I could call a \"finished\" product). ", "parent": "Interface Work.txt", "score": 0.45399999618530273}, {"content": "This app feels like the culmination of everything I've been working towards in my 20s. I started working on my first software side projects in college when I was 20, and also started learning how to play the guitar around then. This project is a synthesis of almost all my interests: software, music, and design. ", "parent": "Synesthesia.txt", "score": 0.4719392657279968}, {"content": "A safer (and more correct) assumption: *you* serve your tools, not the other way around. This puts a much higher burden on a designer - you are not making something people will use, you are making something people will (consciously or not) adapt themselves to and *serve*. Thinking this way puts you in a much more paranoid state of mind, which I believe is the correct stance to take towards technology. (1)", "parent": "Narcissus.txt", "score": 0.47429535664380684}, {"content": "I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.", "parent": "Plaintext is your best friend.txt", "score": 0.48900651931762695}, {"content": "This is not groundbreaking news, but it's groundbreaking for me. I started my software engineering career writing code with cloud applications in mind, and the idea that you can ship cool projects without running database migrations or doing extensive backtesting against your monolith *is* groundbreaking to me. In college I wanted my own blog and instead of getting a static site generator I built out a cloud application with NextJS, PostgreSQL and Heroku. I did learn a lot and it helped me land my first internship, but now it strikes me as an incredibly wrong minded approach. ", "parent": "NOW PAGE.txt", "score": 0.50284743309021}], "I've been reading Understanding Media with some friends, and there's a chapter on the Greek myth of Narcissus. McLuhan claims that this story is about man's relationship with technology - the lake is to Narcissus as technology is to man. Narcissus, failing to realize the figure he sees in the lake is his own reflection, falls in love with it, and wastes away trying to love something that definitionally cannot love him back. ": [{"content": "I've been reading Understanding Media with some friends, and there's a chapter on the Greek myth of Narcissus. McLuhan claims that this story is about man's relationship with technology - the lake is to Narcissus as technology is to man. Narcissus, failing to realize the figure he sees in the lake is his own reflection, falls in love with it, and wastes away trying to love something that definitionally cannot love him back. ", "parent": "Narcissus.txt", "score": 3.3937700938402315e-07}, {"content": "I'll end here and point you to another [interesting take on the Narcissus myth.](https://thelastpsychiatrist.com/2012/10/the_story_of_narcissus.html) This article is less about technology and more about human psychology, but I think you can still relate it back. Here's a quote: ", "parent": "Narcissus.txt", "score": 0.340937396968254}, {"content": "I will admit that this is my personal synthesis of McLuhan and TLP's views of the myth of narcissus - this is not necessarily what McLuhan would say.", "parent": "Narcissus.txt", "score": 0.3595353192978119}, {"content": "\"You think Narcissus was so in love with himself that he couldn't love anyone else.  But that's not what happened, the story clearly tells it in the reverse: he never loved anyone and then he fell in love with himself.  Do you see?  Because he never loved anyone, he fell in love with himself.   That was Narcissus's punishment.\"", "parent": "Narcissus.txt", "score": 0.4166782603560166}, {"content": "If we analyze this quote alongside what McLuhan has written, it suggests that our troubled relationship with technology arises from our avoidance of one another. More optimistically, it suggests that there is a solution (however cliched it might be): show genuine concern for your fellow man.", "parent": "Narcissus.txt", "score": 0.4267452224945584}, {"content": "The interesting thing about McLuhan is that he treats all mediums as inherently dangerous - there is a chapter in the book where he talks about how speech itself irreversibly transformed the human experience. Quitting social media only to become a hermit who reads or watches television all day does not solve anything. The problem is not social media per se, the problem is using technology to retreat from other people. Neon Genesis Evangelion is about this theme as well, and it predates the internet.", "parent": "Narcissus.txt", "score": 0.42893603614929976}, {"content": "You adapt the tool to your own needs. That's good, that's what you should do when you make a tool: adapt it to your needs. The sinister part is that whenever you use a tool, it changes you too. As you adapt the tool to yourself, you also adapt to the tool, and if you have no external feedback, that forms the closed system that McLuhan thinks characterizes Narcissus' situation and also man's relationship with technology.", "parent": "Narcissus.txt", "score": 0.466485411563223}, {"content": "I found this chapter of Understanding Media haunting because this happens to me all the time. I find myself obsessed with an idea, try to build it, get a working prototype, and refine the prototype in isolation - without realizing that the lack of external feedback means I'm created a closed feedback loop where I am adapting myself to a tool that I myself am making. A closed system like this converges towards a tool that is useful to no one at all.", "parent": "Narcissus.txt", "score": 0.5145102469000249}, {"content": "Resist the impulse to distance yourself from others. Sartre famously remarked \"hell is other people\", but at the end of the day, only other people can save you from the technologically induced \"narcosis\" McLuhan warns about. The encroachment of other people's desires on you is ultimately a blessing, not a curse. (2)", "parent": "Narcissus.txt", "score": 0.5200270950839364}, {"content": "McLuhan describes the situation as such - \"[he] had adapted to his extension of himself and had become a closed system\" (Understanding Media, pg. 51). It's this last part about being a closed system that's really interesting to me, because I think this is the most dangerous part about building something without user feedback: you form a closed system with what you're making.", "parent": "Narcissus.txt", "score": 0.5225713677358808}], "McLuhan describes the situation as such - \"[he] had adapted to his extension of himself and had become a closed system\" (Understanding Media, pg. 51). It's this last part about being a closed system that's really interesting to me, because I think this is the most dangerous part about building something without user feedback: you form a closed system with what you're making.": [{"content": "McLuhan describes the situation as such - \"[he] had adapted to his extension of himself and had become a closed system\" (Understanding Media, pg. 51). It's this last part about being a closed system that's really interesting to me, because I think this is the most dangerous part about building something without user feedback: you form a closed system with what you're making.", "parent": "Narcissus.txt", "score": 4.642190901682497e-07}, {"content": "I found this chapter of Understanding Media haunting because this happens to me all the time. I find myself obsessed with an idea, try to build it, get a working prototype, and refine the prototype in isolation - without realizing that the lack of external feedback means I'm created a closed feedback loop where I am adapting myself to a tool that I myself am making. A closed system like this converges towards a tool that is useful to no one at all.", "parent": "Narcissus.txt", "score": 0.2860963794672753}, {"content": "You adapt the tool to your own needs. That's good, that's what you should do when you make a tool: adapt it to your needs. The sinister part is that whenever you use a tool, it changes you too. As you adapt the tool to yourself, you also adapt to the tool, and if you have no external feedback, that forms the closed system that McLuhan thinks characterizes Narcissus' situation and also man's relationship with technology.", "parent": "Narcissus.txt", "score": 0.38953391870836596}, {"content": "The interesting thing about McLuhan is that he treats all mediums as inherently dangerous - there is a chapter in the book where he talks about how speech itself irreversibly transformed the human experience. Quitting social media only to become a hermit who reads or watches television all day does not solve anything. The problem is not social media per se, the problem is using technology to retreat from other people. Neon Genesis Evangelion is about this theme as well, and it predates the internet.", "parent": "Narcissus.txt", "score": 0.4210875868503986}, {"content": "The bigger takeaway is this: do not assume that there is a simple one-way relationship between people and tools, where people just use tools without any second order effects. This is wrong. To quote McLuhan, \"the use of technology conforms men to them ... [an] Indian is the servomechanism of his canoe, as the cowboy of his horse or the executive of his clock\" (Understanding Media, pg. 55). ", "parent": "Narcissus.txt", "score": 0.4978752880375845}, {"content": "Thinking about Marshall McLuhan and the Medium is the Message. More specifically, thinking about his concept of sensory ratios, and how biased we are towards the visual sense. ", "parent": "NOW-Jan-05-2024.txt", "score": 0.514754056930542}, {"content": "I've been reading Understanding Media with some friends, and there's a chapter on the Greek myth of Narcissus. McLuhan claims that this story is about man's relationship with technology - the lake is to Narcissus as technology is to man. Narcissus, failing to realize the figure he sees in the lake is his own reflection, falls in love with it, and wastes away trying to love something that definitionally cannot love him back. ", "parent": "Narcissus.txt", "score": 0.5225728532801168}, {"content": "Resist the impulse to distance yourself from others. Sartre famously remarked \"hell is other people\", but at the end of the day, only other people can save you from the technologically induced \"narcosis\" McLuhan warns about. The encroachment of other people's desires on you is ultimately a blessing, not a curse. (2)", "parent": "Narcissus.txt", "score": 0.5396886035393866}, {"content": "If we analyze this quote alongside what McLuhan has written, it suggests that our troubled relationship with technology arises from our avoidance of one another. More optimistically, it suggests that there is a solution (however cliched it might be): show genuine concern for your fellow man.", "parent": "Narcissus.txt", "score": 0.5403640439853401}, {"content": "I will admit that this is my personal synthesis of McLuhan and TLP's views of the myth of narcissus - this is not necessarily what McLuhan would say.", "parent": "Narcissus.txt", "score": 0.545415647004563}], "You adapt the tool to your own needs. That's good, that's what you should do when you make a tool: adapt it to your needs. The sinister part is that whenever you use a tool, it changes you too. As you adapt the tool to yourself, you also adapt to the tool, and if you have no external feedback, that forms the closed system that McLuhan thinks characterizes Narcissus' situation and also man's relationship with technology.": [{"content": "You adapt the tool to your own needs. That's good, that's what you should do when you make a tool: adapt it to your needs. The sinister part is that whenever you use a tool, it changes you too. As you adapt the tool to yourself, you also adapt to the tool, and if you have no external feedback, that forms the closed system that McLuhan thinks characterizes Narcissus' situation and also man's relationship with technology.", "parent": "Narcissus.txt", "score": 3.063753249987755e-07}, {"content": "The bigger takeaway is this: do not assume that there is a simple one-way relationship between people and tools, where people just use tools without any second order effects. This is wrong. To quote McLuhan, \"the use of technology conforms men to them ... [an] Indian is the servomechanism of his canoe, as the cowboy of his horse or the executive of his clock\" (Understanding Media, pg. 55). ", "parent": "Narcissus.txt", "score": 0.3755362489547529}, {"content": "McLuhan describes the situation as such - \"[he] had adapted to his extension of himself and had become a closed system\" (Understanding Media, pg. 51). It's this last part about being a closed system that's really interesting to me, because I think this is the most dangerous part about building something without user feedback: you form a closed system with what you're making.", "parent": "Narcissus.txt", "score": 0.38955428168955053}, {"content": "I found this chapter of Understanding Media haunting because this happens to me all the time. I find myself obsessed with an idea, try to build it, get a working prototype, and refine the prototype in isolation - without realizing that the lack of external feedback means I'm created a closed feedback loop where I am adapting myself to a tool that I myself am making. A closed system like this converges towards a tool that is useful to no one at all.", "parent": "Narcissus.txt", "score": 0.3904855424411148}, {"content": "A safer (and more correct) assumption: *you* serve your tools, not the other way around. This puts a much higher burden on a designer - you are not making something people will use, you are making something people will (consciously or not) adapt themselves to and *serve*. Thinking this way puts you in a much more paranoid state of mind, which I believe is the correct stance to take towards technology. (1)", "parent": "Narcissus.txt", "score": 0.4138590973169535}, {"content": "I've been reading Understanding Media with some friends, and there's a chapter on the Greek myth of Narcissus. McLuhan claims that this story is about man's relationship with technology - the lake is to Narcissus as technology is to man. Narcissus, failing to realize the figure he sees in the lake is his own reflection, falls in love with it, and wastes away trying to love something that definitionally cannot love him back. ", "parent": "Narcissus.txt", "score": 0.4663835070760428}, {"content": "We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.", "parent": "Manifesto.txt", "score": 0.47031712532043457}, {"content": "I'm happy someone other than me finds the tool useful. My worst fear is creating something nobody but myself finds useful, because then there's no way of knowing if I actually made something useful, or if I just adapted so well to using my own tool that I tricked myself into thinking its useful. ", "parent": "Narcissus.txt", "score": 0.4711513901132658}, {"content": "I'll end here and point you to another [interesting take on the Narcissus myth.](https://thelastpsychiatrist.com/2012/10/the_story_of_narcissus.html) This article is less about technology and more about human psychology, but I think you can still relate it back. Here's a quote: ", "parent": "Narcissus.txt", "score": 0.4797821599015911}, {"content": "In my view, the whole movement of [[tools for thought]] (Roam, personal knowledge management systems, etc, etc.) is to make computers help us think better. That was the point from the very start, it was what Steve Jobs meant when he called the computer \"a bicycle for the mind.\" In the last decade, we've seen the very opposite - the use of the computer as an extractive tool, a weapon to siphon attention and harvest data. ", "parent": "Controlling what you see.txt", "score": 0.4888937473297119}], "I found this chapter of Understanding Media haunting because this happens to me all the time. I find myself obsessed with an idea, try to build it, get a working prototype, and refine the prototype in isolation - without realizing that the lack of external feedback means I'm created a closed feedback loop where I am adapting myself to a tool that I myself am making. A closed system like this converges towards a tool that is useful to no one at all.": [{"content": "I found this chapter of Understanding Media haunting because this happens to me all the time. I find myself obsessed with an idea, try to build it, get a working prototype, and refine the prototype in isolation - without realizing that the lack of external feedback means I'm created a closed feedback loop where I am adapting myself to a tool that I myself am making. A closed system like this converges towards a tool that is useful to no one at all.", "parent": "Narcissus.txt", "score": 5.904437283543729e-07}, {"content": "McLuhan describes the situation as such - \"[he] had adapted to his extension of himself and had become a closed system\" (Understanding Media, pg. 51). It's this last part about being a closed system that's really interesting to me, because I think this is the most dangerous part about building something without user feedback: you form a closed system with what you're making.", "parent": "Narcissus.txt", "score": 0.28613104402184386}, {"content": "You adapt the tool to your own needs. That's good, that's what you should do when you make a tool: adapt it to your needs. The sinister part is that whenever you use a tool, it changes you too. As you adapt the tool to yourself, you also adapt to the tool, and if you have no external feedback, that forms the closed system that McLuhan thinks characterizes Narcissus' situation and also man's relationship with technology.", "parent": "Narcissus.txt", "score": 0.3904369257276076}, {"content": "I'm happy someone other than me finds the tool useful. My worst fear is creating something nobody but myself finds useful, because then there's no way of knowing if I actually made something useful, or if I just adapted so well to using my own tool that I tricked myself into thinking its useful. ", "parent": "Narcissus.txt", "score": 0.4771693471200076}, {"content": "I don't care if my work gets noticed, or if it's any good, or if it leads to anything at all. I don't know if I have any talent for interface research, but it seems like I might - my sophomore year of college, I designed a notetaking tool called YANA with a novel interface where you could select text and then add tags to it. The response to it was very positive, which encouraged me to try and build a startup out of it, which unfortunately led to me becoming monomaniacally obsessed with that idea at the expense of trying to explore any other ideas (an obsession I only shed once I made Nomad Hypertext, which I could call a \"finished\" product). ", "parent": "Interface Work.txt", "score": 0.47859179973602295}, {"content": "I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.", "parent": "Second Brains.txt", "score": 0.4854617118835449}, {"content": "We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.", "parent": "Manifesto.txt", "score": 0.4879797101020813}, {"content": "The opposite of this situation is designing by committee, where you tirelessly survey and A/B test every decision to ensure you're adapting to actual user needs. I think this is also bad: if you want to make something original, you have to have some original insight, and you cannot survey your way to an original insight. The boring conclusion here is that you have to strike some kind of balance between these extremes.", "parent": "Narcissus.txt", "score": 0.5008373460509864}, {"content": "The interesting thing about McLuhan is that he treats all mediums as inherently dangerous - there is a chapter in the book where he talks about how speech itself irreversibly transformed the human experience. Quitting social media only to become a hermit who reads or watches television all day does not solve anything. The problem is not social media per se, the problem is using technology to retreat from other people. Neon Genesis Evangelion is about this theme as well, and it predates the internet.", "parent": "Narcissus.txt", "score": 0.5135604277570949}, {"content": "I've been reading Understanding Media with some friends, and there's a chapter on the Greek myth of Narcissus. McLuhan claims that this story is about man's relationship with technology - the lake is to Narcissus as technology is to man. Narcissus, failing to realize the figure he sees in the lake is his own reflection, falls in love with it, and wastes away trying to love something that definitionally cannot love him back. ", "parent": "Narcissus.txt", "score": 0.5145345964642931}], "The opposite of this situation is designing by committee, where you tirelessly survey and A/B test every decision to ensure you're adapting to actual user needs. I think this is also bad: if you want to make something original, you have to have some original insight, and you cannot survey your way to an original insight. The boring conclusion here is that you have to strike some kind of balance between these extremes.": [{"content": "The opposite of this situation is designing by committee, where you tirelessly survey and A/B test every decision to ensure you're adapting to actual user needs. I think this is also bad: if you want to make something original, you have to have some original insight, and you cannot survey your way to an original insight. The boring conclusion here is that you have to strike some kind of balance between these extremes.", "parent": "Narcissus.txt", "score": 4.1776111048275055e-07}, {"content": "Anyone doing creative work must carefully toe the line between two extremes: the collaborative extreme of butchering ideas by putting them into words, the auteur's extreme of refusing to communicate anything about an idea at all. ", "parent": "On auteurs and language.txt", "score": 0.45092689990997314}, {"content": "My philosophy here is this: it is better to try and make something authentic, beautiful, and expressive and have it turn out bad than it is to hide behind the safeness of minimalism. If you're writing, go ahead and try to sound clever. You might fail and sound incredibly immature, but a fear of failure is disastrous for any creative endeavor. If you're designing something, go all out. Make it bold and loud, and if it turns out gaudy, you can fix it on the next iteration. This was what I tried to do [[exegesis]]' redesign, and so far I'm very happy with it.", "parent": "Minimalism.txt", "score": 0.45401912927627563}, {"content": "A safer (and more correct) assumption: *you* serve your tools, not the other way around. This puts a much higher burden on a designer - you are not making something people will use, you are making something people will (consciously or not) adapt themselves to and *serve*. Thinking this way puts you in a much more paranoid state of mind, which I believe is the correct stance to take towards technology. (1)", "parent": "Narcissus.txt", "score": 0.45793463291646885}, {"content": "Neither perspective is completely correct. The reality is that there is a tradeoff between the approach of creative collaboration and the approach of an auteur. What creative collaborators gain through specialization and the combination of talents, they lose in the fidelity of their ideas' expression; what the auteur loses through not being able to harness others' talents, he gains through the ability to express an idea to its fullest. Naturally, the more talents the auteur is able to accrue, the less he needs others, and the more worthwhile the tradeoff of solo work becomes.  ", "parent": "On auteurs and language.txt", "score": 0.48481786251068115}, {"content": "I found this chapter of Understanding Media haunting because this happens to me all the time. I find myself obsessed with an idea, try to build it, get a working prototype, and refine the prototype in isolation - without realizing that the lack of external feedback means I'm created a closed feedback loop where I am adapting myself to a tool that I myself am making. A closed system like this converges towards a tool that is useful to no one at all.", "parent": "Narcissus.txt", "score": 0.5009019109605314}, {"content": "The usual way to think about technology, software, and startups is that they solve problems, and so it follows then that the best way to create a new technology is to find a problem people have and solve it. This is not a bad approach to take, and it's been successful for many people. Still, I think it's too narrow.", "parent": "Creating new kinds of people.txt", "score": 0.5307972431182861}, {"content": "Entrepreneurship is not neccessarily incompatible with \"small projects\" and staying agile, because entrepreneurs still have to pivot often. - but you're pivoting with respect to what customers want, not what will improve your craft, or what you're interested in. Good musicians do two things: practice sections they find difficult to play, and articulate musical ideas that they find interesting. They don't go out and call prospective listeners and ask what they'd like to hear.  ", "parent": "Small Projects.txt", "score": 0.5435141324996948}, {"content": "The auteur believes something similar about ideas. A description of an idea is never the idea itself, it is a second rate copy of an original - another thing added to the world's contents. Preferring not to clutter the world with such refuse, he becomes reclusive, reluctant to even speak of what he wishes to create. The result is either pure creativity untarnished by the translation of ideas into words, or something tantamount to the work of a madman - full of meaning to its creator but incomprehensible and useless to everyone else.", "parent": "On auteurs and language.txt", "score": 0.5461040735244751}, {"content": "In high school, I made this [platformer game](https://nichwch.itch.io/machinegods) that I thought was quite easy but my friends found to be incredibly difficult. It turned out that I'd developed an incredible amount of muscle memory while testing the game out. I'm always scared that something similar will happen with the applications that I design. It's worse because I code and design my own projects, and sometimes it's not clear if I designed something because it's intuitive, or because it matches the database schema more cleanly. On the one hand, it feels incredibly elegant to have your design to express the same consistent schema both in its user-facing interface and its inner workings. On the other hand, isn't your job as a designer to shield your users from complexity?", "parent": "Narcissus.txt", "score": 0.5498005526155201}], "The bigger takeaway is this: do not assume that there is a simple one-way relationship between people and tools, where people just use tools without any second order effects. This is wrong. To quote McLuhan, \"the use of technology conforms men to them ... [an] Indian is the servomechanism of his canoe, as the cowboy of his horse or the executive of his clock\" (Understanding Media, pg. 55). ": [{"content": "The bigger takeaway is this: do not assume that there is a simple one-way relationship between people and tools, where people just use tools without any second order effects. This is wrong. To quote McLuhan, \"the use of technology conforms men to them ... [an] Indian is the servomechanism of his canoe, as the cowboy of his horse or the executive of his clock\" (Understanding Media, pg. 55). ", "parent": "Narcissus.txt", "score": 5.508406870968763e-06}, {"content": "You adapt the tool to your own needs. That's good, that's what you should do when you make a tool: adapt it to your needs. The sinister part is that whenever you use a tool, it changes you too. As you adapt the tool to yourself, you also adapt to the tool, and if you have no external feedback, that forms the closed system that McLuhan thinks characterizes Narcissus' situation and also man's relationship with technology.", "parent": "Narcissus.txt", "score": 0.37553337577974166}, {"content": "A safer (and more correct) assumption: *you* serve your tools, not the other way around. This puts a much higher burden on a designer - you are not making something people will use, you are making something people will (consciously or not) adapt themselves to and *serve*. Thinking this way puts you in a much more paranoid state of mind, which I believe is the correct stance to take towards technology. (1)", "parent": "Narcissus.txt", "score": 0.38801661397490084}, {"content": "If we analyze this quote alongside what McLuhan has written, it suggests that our troubled relationship with technology arises from our avoidance of one another. More optimistically, it suggests that there is a solution (however cliched it might be): show genuine concern for your fellow man.", "parent": "Narcissus.txt", "score": 0.4178252038356437}, {"content": "In my view, the whole movement of [[tools for thought]] (Roam, personal knowledge management systems, etc, etc.) is to make computers help us think better. That was the point from the very start, it was what Steve Jobs meant when he called the computer \"a bicycle for the mind.\" In the last decade, we've seen the very opposite - the use of the computer as an extractive tool, a weapon to siphon attention and harvest data. ", "parent": "Controlling what you see.txt", "score": 0.4546352028846741}, {"content": "The problem with the view that technology is meant to solve problems is that technology always ends up doing so much more than that. Take any technology and its original intended purpose (fire, automobiles, airplanes, etc.) and you will find it has created a cascade of second order effects far beyond what it was originally intended to do. Sometimes these impacts are good, sometimes they're bad, sometimes they're just strange. ", "parent": "Creating new kinds of people.txt", "score": 0.4614027142524719}, {"content": "Above all, don't forget - technology exists to serve man, the \"blessed machine\" exists to serve \"the crude biomass.\" Your brain is not a tool for stocking your notes, your notes are a tool for your brain. I don't write everything down in exegesis, I still read physical books, a good deal of my thinking gets done on pen and paper. If I forget something, I figure it's evolution's way of telling me it wasn't important.", "parent": "Second Brains.txt", "score": 0.461836576461792}, {"content": "McLuhan describes the situation as such - \"[he] had adapted to his extension of himself and had become a closed system\" (Understanding Media, pg. 51). It's this last part about being a closed system that's really interesting to me, because I think this is the most dangerous part about building something without user feedback: you form a closed system with what you're making.", "parent": "Narcissus.txt", "score": 0.49772675186069737}, {"content": "None of it worked. Why? It's not that these tools don't work in general - plenty of people swear by them. The problem was either with the tools, or with me. Technology exists for the utility of the user, not the other way around, so I rejected the latter answer. ", "parent": "Why I made exegesis.txt", "score": 0.5031083822250366}, {"content": "Of course, this is a bit of a strawman. Nobody who works seriously in [[tools for thought]] really believes that tools for thought are limited to just note taking apps. Still, to the general public, and to casual followers, this seems to be the actual perception. It also seems fair to say that this perception is not entirely misguided - while not all tools for thought are note-taking apps, a disproportionate amount of them are.", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.5067359209060669}], "A safer (and more correct) assumption: *you* serve your tools, not the other way around. This puts a much higher burden on a designer - you are not making something people will use, you are making something people will (consciously or not) adapt themselves to and *serve*. Thinking this way puts you in a much more paranoid state of mind, which I believe is the correct stance to take towards technology. (1)": [{"content": "A safer (and more correct) assumption: *you* serve your tools, not the other way around. This puts a much higher burden on a designer - you are not making something people will use, you are making something people will (consciously or not) adapt themselves to and *serve*. Thinking this way puts you in a much more paranoid state of mind, which I believe is the correct stance to take towards technology. (1)", "parent": "Narcissus.txt", "score": 3.610088786798471e-07}, {"content": "The bigger takeaway is this: do not assume that there is a simple one-way relationship between people and tools, where people just use tools without any second order effects. This is wrong. To quote McLuhan, \"the use of technology conforms men to them ... [an] Indian is the servomechanism of his canoe, as the cowboy of his horse or the executive of his clock\" (Understanding Media, pg. 55). ", "parent": "Narcissus.txt", "score": 0.388083763454923}, {"content": "You adapt the tool to your own needs. That's good, that's what you should do when you make a tool: adapt it to your needs. The sinister part is that whenever you use a tool, it changes you too. As you adapt the tool to yourself, you also adapt to the tool, and if you have no external feedback, that forms the closed system that McLuhan thinks characterizes Narcissus' situation and also man's relationship with technology.", "parent": "Narcissus.txt", "score": 0.41381303714709183}, {"content": "The opposite of this situation is designing by committee, where you tirelessly survey and A/B test every decision to ensure you're adapting to actual user needs. I think this is also bad: if you want to make something original, you have to have some original insight, and you cannot survey your way to an original insight. The boring conclusion here is that you have to strike some kind of balance between these extremes.", "parent": "Narcissus.txt", "score": 0.45788309710833386}, {"content": "1) One of the best feelings when you're making something is the first time you personally find it useful. An uncomfortable corollary of the argument here, however, is that you should be suspicious of this feeling - you are at risk of becoming the servomechanism of what you are making.", "parent": "Narcissus.txt", "score": 0.47353601383482713}, {"content": "I'm happy someone other than me finds the tool useful. My worst fear is creating something nobody but myself finds useful, because then there's no way of knowing if I actually made something useful, or if I just adapted so well to using my own tool that I tricked myself into thinking its useful. ", "parent": "Narcissus.txt", "score": 0.47408035414191463}, {"content": "In high school, I made this [platformer game](https://nichwch.itch.io/machinegods) that I thought was quite easy but my friends found to be incredibly difficult. It turned out that I'd developed an incredible amount of muscle memory while testing the game out. I'm always scared that something similar will happen with the applications that I design. It's worse because I code and design my own projects, and sometimes it's not clear if I designed something because it's intuitive, or because it matches the database schema more cleanly. On the one hand, it feels incredibly elegant to have your design to express the same consistent schema both in its user-facing interface and its inner workings. On the other hand, isn't your job as a designer to shield your users from complexity?", "parent": "Narcissus.txt", "score": 0.474262198018383}, {"content": "In my view, the whole movement of [[tools for thought]] (Roam, personal knowledge management systems, etc, etc.) is to make computers help us think better. That was the point from the very start, it was what Steve Jobs meant when he called the computer \"a bicycle for the mind.\" In the last decade, we've seen the very opposite - the use of the computer as an extractive tool, a weapon to siphon attention and harvest data. ", "parent": "Controlling what you see.txt", "score": 0.47721993923187256}, {"content": "Above all, don't forget - technology exists to serve man, the \"blessed machine\" exists to serve \"the crude biomass.\" Your brain is not a tool for stocking your notes, your notes are a tool for your brain. I don't write everything down in exegesis, I still read physical books, a good deal of my thinking gets done on pen and paper. If I forget something, I figure it's evolution's way of telling me it wasn't important.", "parent": "Second Brains.txt", "score": 0.49007290601730347}, {"content": "Users should have complete control over what they see. I'm not saying algorithmic feeds don't have their place, but they should be something users opt in to. Andy [[Matuschak]] coined the idea of \"[programmable attention](https://notes.andymatuschak.org/zJrfPCbY7GcpV9asEc8NTVzXTAV4TvRFMuY6)\" as something [[tools for thought]] could enable. I will say that this already exists, only in the opposite, sinister sense - right now it's the platform programming your attention, not you. ", "parent": "Controlling what you see.txt", "score": 0.4989141821861267}], " ": [{"content": " ", "parent": "untitled-10-11-2021.txt", "score": 0.0}, {"content": " ", "parent": "Narcissus.txt", "score": 8.06037657063996e-07}, {"content": " ", "parent": "Plaintext is your best friend.txt", "score": 1.0132789611816406e-06}, {"content": " ", "parent": "NOW PAGE.txt", "score": 1.4901161193847656e-06}, {"content": " ", "parent": "Interface Journal: Summary Tool.txt", "score": 1.4901161193847656e-06}, {"content": " ", "parent": "Interface Journal: Summary Tool.txt", "score": 1.4901161193847656e-06}, {"content": "  ", "parent": "Narcissus.txt", "score": 0.08607712921107324}, {"content": "  ", "parent": "Gridworld.txt", "score": 0.08610376655302887}, {"content": "  ", "parent": "Narcissus.txt", "score": 0.08612694314070057}, {"content": "  ", "parent": "The making of Nomad Hypertext.txt", "score": 0.08617717027664185}], "I'll end here and point you to another [interesting take on the Narcissus myth.](https://thelastpsychiatrist.com/2012/10/the_story_of_narcissus.html) This article is less about technology and more about human psychology, but I think you can still relate it back. Here's a quote: ": [{"content": "I'll end here and point you to another [interesting take on the Narcissus myth.](https://thelastpsychiatrist.com/2012/10/the_story_of_narcissus.html) This article is less about technology and more about human psychology, but I think you can still relate it back. Here's a quote: ", "parent": "Narcissus.txt", "score": 0.0}, {"content": "I've been reading Understanding Media with some friends, and there's a chapter on the Greek myth of Narcissus. McLuhan claims that this story is about man's relationship with technology - the lake is to Narcissus as technology is to man. Narcissus, failing to realize the figure he sees in the lake is his own reflection, falls in love with it, and wastes away trying to love something that definitionally cannot love him back. ", "parent": "Narcissus.txt", "score": 0.34094592264795043}, {"content": "\"You think Narcissus was so in love with himself that he couldn't love anyone else.  But that's not what happened, the story clearly tells it in the reverse: he never loved anyone and then he fell in love with himself.  Do you see?  Because he never loved anyone, he fell in love with himself.   That was Narcissus's punishment.\"", "parent": "Narcissus.txt", "score": 0.44339381502944564}, {"content": "I will admit that this is my personal synthesis of McLuhan and TLP's views of the myth of narcissus - this is not necessarily what McLuhan would say.", "parent": "Narcissus.txt", "score": 0.4599913314723264}, {"content": "You adapt the tool to your own needs. That's good, that's what you should do when you make a tool: adapt it to your needs. The sinister part is that whenever you use a tool, it changes you too. As you adapt the tool to yourself, you also adapt to the tool, and if you have no external feedback, that forms the closed system that McLuhan thinks characterizes Narcissus' situation and also man's relationship with technology.", "parent": "Narcissus.txt", "score": 0.47977780257656366}, {"content": "If we analyze this quote alongside what McLuhan has written, it suggests that our troubled relationship with technology arises from our avoidance of one another. More optimistically, it suggests that there is a solution (however cliched it might be): show genuine concern for your fellow man.", "parent": "Narcissus.txt", "score": 0.4990272942715295}, {"content": "Resist the impulse to distance yourself from others. Sartre famously remarked \"hell is other people\", but at the end of the day, only other people can save you from the technologically induced \"narcosis\" McLuhan warns about. The encroachment of other people's desires on you is ultimately a blessing, not a curse. (2)", "parent": "Narcissus.txt", "score": 0.5260732738637455}, {"content": "This quote reflects a common strain of thinking in Silicon Valley, that our biological selves are hopeless broken, that we need to hack into our brains dopamine-systems and rewire them for maximal productivity, that everything natural is ripe for disruption. This thinking is especially prevalent with the recent rise of PKMs (personal knowledge management systems) like Roam and Notion. Here, an electronic notetaking app is the \"blessed machine\", and your natural memory is the \"flesh that will decay and fail you.\"", "parent": "Second Brains.txt", "score": 0.5309464931488037}, {"content": "I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]]. ", "parent": "Strategic blindness.txt", "score": 0.5320859551429749}, {"content": "It also seems like [[philosophy]] requires a war-like state of mind - against others, against oneself, against philosophy itself. I'm again reminded of an aphorism from [[The Gay Science]], simply titled \"excelsior\" - \"Thou wilt never more pray, never more worship, never more repose in infinite trust - thou refusest to stand still and dismiss thy thoughts before an ultimate wisdom, an ultimate virtue, an ultimate power, - thou hast no constant guardian and friend in thy seven solitudes - thou livest without the outlook on a mountain that has snow on its head and fire in its heart - there is no longer any requiter for thee, nor any amender with his finishing touch - there is no longer any reason in that which happens, or any love in that which will happen to thee - there is no longer any resting-place for thy weary heart, where it has only to find and no longer to seek, thou art opposed to any kind of ultimate peace, thou desirest the eternal recurrence of war and peace: - man of renunciation, wilt thou renounce in all these things? Who will give thee the strength to do so? No one has yet had this strength!\" - There is a lake which one day refused to flow away, and threw up a dam at the place where it had hitherto discharged: since then this lake has always risen higher and higher. Perhaps the very renunciation will also furnish us with the strength with which the renunciation itself can be borne; perhaps man will ever rise higher and higher from that point onward, when he no longer flows out into a God.\"[[quotes]] [[Nietzsche]] [[philosophy]] [[The Gay Science]] ", "parent": "untitled-9-21-2021.txt", "score": 0.5394401550292969}], "\"You think Narcissus was so in love with himself that he couldn't love anyone else.  But that's not what happened, the story clearly tells it in the reverse: he never loved anyone and then he fell in love with himself.  Do you see?  Because he never loved anyone, he fell in love with himself.   That was Narcissus's punishment.\"": [{"content": "\"You think Narcissus was so in love with himself that he couldn't love anyone else.  But that's not what happened, the story clearly tells it in the reverse: he never loved anyone and then he fell in love with himself.  Do you see?  Because he never loved anyone, he fell in love with himself.   That was Narcissus's punishment.\"", "parent": "Narcissus.txt", "score": 0.0}, {"content": "I've been reading Understanding Media with some friends, and there's a chapter on the Greek myth of Narcissus. McLuhan claims that this story is about man's relationship with technology - the lake is to Narcissus as technology is to man. Narcissus, failing to realize the figure he sees in the lake is his own reflection, falls in love with it, and wastes away trying to love something that definitionally cannot love him back. ", "parent": "Narcissus.txt", "score": 0.41669251927482853}, {"content": "I'll end here and point you to another [interesting take on the Narcissus myth.](https://thelastpsychiatrist.com/2012/10/the_story_of_narcissus.html) This article is less about technology and more about human psychology, but I think you can still relate it back. Here's a quote: ", "parent": "Narcissus.txt", "score": 0.44339381502944564}, {"content": "I will admit that this is my personal synthesis of McLuhan and TLP's views of the myth of narcissus - this is not necessarily what McLuhan would say.", "parent": "Narcissus.txt", "score": 0.5537061700133097}, {"content": "I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]]. ", "parent": "Strategic blindness.txt", "score": 0.5848435163497925}, {"content": "Also contrast to [[Nietzsche]]'s famous dictum that all philosophy is a kind of personal confession on the part of the philosopher. This certainly seems true to an extent - a lot of biographers think Spinoza built his system out of need to cope with his own loneliness. ", "parent": "untitled-2-6-2022.txt", "score": 0.5980585217475891}, {"content": "There is a short story by [[Borges]], about an author who realizes on his deathbed that the words used to describe a rose are not a mere reflection of an object, but an object in their own right.", "parent": "On auteurs and language.txt", "score": 0.6089010238647461}, {"content": "Resist the impulse to distance yourself from others. Sartre famously remarked \"hell is other people\", but at the end of the day, only other people can save you from the technologically induced \"narcosis\" McLuhan warns about. The encroachment of other people's desires on you is ultimately a blessing, not a curse. (2)", "parent": "Narcissus.txt", "score": 0.6121339153486967}, {"content": "\"Marino saw the rose, as Adam had seen it in Paradise, and he realized that it lay within its own eternity, not within his words, and that we might speak about the rose, allude to it, but never truly express it, and that the tall haughty volumes that made a golden dimness in the corner of his room were not (as his vanity had dreamed them) a mirror of the world, but just another thing added to the world's contents.\"", "parent": "On auteurs and language.txt", "score": 0.6158021092414856}, {"content": "It also seems like [[philosophy]] requires a war-like state of mind - against others, against oneself, against philosophy itself. I'm again reminded of an aphorism from [[The Gay Science]], simply titled \"excelsior\" - \"Thou wilt never more pray, never more worship, never more repose in infinite trust - thou refusest to stand still and dismiss thy thoughts before an ultimate wisdom, an ultimate virtue, an ultimate power, - thou hast no constant guardian and friend in thy seven solitudes - thou livest without the outlook on a mountain that has snow on its head and fire in its heart - there is no longer any requiter for thee, nor any amender with his finishing touch - there is no longer any reason in that which happens, or any love in that which will happen to thee - there is no longer any resting-place for thy weary heart, where it has only to find and no longer to seek, thou art opposed to any kind of ultimate peace, thou desirest the eternal recurrence of war and peace: - man of renunciation, wilt thou renounce in all these things? Who will give thee the strength to do so? No one has yet had this strength!\" - There is a lake which one day refused to flow away, and threw up a dam at the place where it had hitherto discharged: since then this lake has always risen higher and higher. Perhaps the very renunciation will also furnish us with the strength with which the renunciation itself can be borne; perhaps man will ever rise higher and higher from that point onward, when he no longer flows out into a God.\"[[quotes]] [[Nietzsche]] [[philosophy]] [[The Gay Science]] ", "parent": "untitled-9-21-2021.txt", "score": 0.6165140271186829}], "If we analyze this quote alongside what McLuhan has written, it suggests that our troubled relationship with technology arises from our avoidance of one another. More optimistically, it suggests that there is a solution (however cliched it might be): show genuine concern for your fellow man.": [{"content": "If we analyze this quote alongside what McLuhan has written, it suggests that our troubled relationship with technology arises from our avoidance of one another. More optimistically, it suggests that there is a solution (however cliched it might be): show genuine concern for your fellow man.", "parent": "Narcissus.txt", "score": 4.760603364850624e-07}, {"content": "Resist the impulse to distance yourself from others. Sartre famously remarked \"hell is other people\", but at the end of the day, only other people can save you from the technologically induced \"narcosis\" McLuhan warns about. The encroachment of other people's desires on you is ultimately a blessing, not a curse. (2)", "parent": "Narcissus.txt", "score": 0.3808870885248038}, {"content": "The interesting thing about McLuhan is that he treats all mediums as inherently dangerous - there is a chapter in the book where he talks about how speech itself irreversibly transformed the human experience. Quitting social media only to become a hermit who reads or watches television all day does not solve anything. The problem is not social media per se, the problem is using technology to retreat from other people. Neon Genesis Evangelion is about this theme as well, and it predates the internet.", "parent": "Narcissus.txt", "score": 0.38759385124204815}, {"content": "The bigger takeaway is this: do not assume that there is a simple one-way relationship between people and tools, where people just use tools without any second order effects. This is wrong. To quote McLuhan, \"the use of technology conforms men to them ... [an] Indian is the servomechanism of his canoe, as the cowboy of his horse or the executive of his clock\" (Understanding Media, pg. 55). ", "parent": "Narcissus.txt", "score": 0.41804109133262324}, {"content": "I've been reading Understanding Media with some friends, and there's a chapter on the Greek myth of Narcissus. McLuhan claims that this story is about man's relationship with technology - the lake is to Narcissus as technology is to man. Narcissus, failing to realize the figure he sees in the lake is his own reflection, falls in love with it, and wastes away trying to love something that definitionally cannot love him back. ", "parent": "Narcissus.txt", "score": 0.42670404764970904}, {"content": "I'll end here and point you to another [interesting take on the Narcissus myth.](https://thelastpsychiatrist.com/2012/10/the_story_of_narcissus.html) This article is less about technology and more about human psychology, but I think you can still relate it back. Here's a quote: ", "parent": "Narcissus.txt", "score": 0.4990683389438345}, {"content": "We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.", "parent": "Manifesto.txt", "score": 0.5214183330535889}, {"content": "The problem with the view that technology is meant to solve problems is that technology always ends up doing so much more than that. Take any technology and its original intended purpose (fire, automobiles, airplanes, etc.) and you will find it has created a cascade of second order effects far beyond what it was originally intended to do. Sometimes these impacts are good, sometimes they're bad, sometimes they're just strange. ", "parent": "Creating new kinds of people.txt", "score": 0.5330665111541748}, {"content": "Thinking about Marshall McLuhan and the Medium is the Message. More specifically, thinking about his concept of sensory ratios, and how biased we are towards the visual sense. ", "parent": "NOW-Jan-05-2024.txt", "score": 0.5335875749588013}, {"content": "I will admit that this is my personal synthesis of McLuhan and TLP's views of the myth of narcissus - this is not necessarily what McLuhan would say.", "parent": "Narcissus.txt", "score": 0.5344076322275362}], "  ": [{"content": "  ", "parent": "Gridworld.txt", "score": 0.0}, {"content": "  ", "parent": "Narcissus.txt", "score": 9.618186328497202e-07}, {"content": "  ", "parent": "Narcissus.txt", "score": 1.0316966061463262e-06}, {"content": "  ", "parent": "The making of Nomad Hypertext.txt", "score": 1.9669532775878906e-06}, {"content": " ", "parent": "Plaintext is your best friend.txt", "score": 0.08612757921218872}, {"content": " ", "parent": "NOW PAGE.txt", "score": 0.08616328239440918}, {"content": " ", "parent": "Interface Journal: Summary Tool.txt", "score": 0.08616328239440918}, {"content": " ", "parent": "Interface Journal: Summary Tool.txt", "score": 0.08616328239440918}, {"content": " ", "parent": "Narcissus.txt", "score": 0.08616339216183688}, {"content": " ", "parent": "untitled-10-11-2021.txt", "score": 0.08616805076599121}], "Resist the impulse to distance yourself from others. Sartre famously remarked \"hell is other people\", but at the end of the day, only other people can save you from the technologically induced \"narcosis\" McLuhan warns about. The encroachment of other people's desires on you is ultimately a blessing, not a curse. (2)": [{"content": "Resist the impulse to distance yourself from others. Sartre famously remarked \"hell is other people\", but at the end of the day, only other people can save you from the technologically induced \"narcosis\" McLuhan warns about. The encroachment of other people's desires on you is ultimately a blessing, not a curse. (2)", "parent": "Narcissus.txt", "score": 0.0}, {"content": "If we analyze this quote alongside what McLuhan has written, it suggests that our troubled relationship with technology arises from our avoidance of one another. More optimistically, it suggests that there is a solution (however cliched it might be): show genuine concern for your fellow man.", "parent": "Narcissus.txt", "score": 0.3808629467466562}, {"content": "The interesting thing about McLuhan is that he treats all mediums as inherently dangerous - there is a chapter in the book where he talks about how speech itself irreversibly transformed the human experience. Quitting social media only to become a hermit who reads or watches television all day does not solve anything. The problem is not social media per se, the problem is using technology to retreat from other people. Neon Genesis Evangelion is about this theme as well, and it predates the internet.", "parent": "Narcissus.txt", "score": 0.4451504107373778}, {"content": "I've been reading Understanding Media with some friends, and there's a chapter on the Greek myth of Narcissus. McLuhan claims that this story is about man's relationship with technology - the lake is to Narcissus as technology is to man. Narcissus, failing to realize the figure he sees in the lake is his own reflection, falls in love with it, and wastes away trying to love something that definitionally cannot love him back. ", "parent": "Narcissus.txt", "score": 0.5199970208038098}, {"content": "You are better off doomscrolling TikTok if it genuinely brings you closer to other people than you are as a misanthropic hermit who reads classical literature to feel superior to others. Avoid becoming a closed system.", "parent": "Narcissus.txt", "score": 0.5228339524864585}, {"content": "I'll end here and point you to another [interesting take on the Narcissus myth.](https://thelastpsychiatrist.com/2012/10/the_story_of_narcissus.html) This article is less about technology and more about human psychology, but I think you can still relate it back. Here's a quote: ", "parent": "Narcissus.txt", "score": 0.5260732738637455}, {"content": "You adapt the tool to your own needs. That's good, that's what you should do when you make a tool: adapt it to your needs. The sinister part is that whenever you use a tool, it changes you too. As you adapt the tool to yourself, you also adapt to the tool, and if you have no external feedback, that forms the closed system that McLuhan thinks characterizes Narcissus' situation and also man's relationship with technology.", "parent": "Narcissus.txt", "score": 0.5337939735537454}, {"content": "McLuhan describes the situation as such - \"[he] had adapted to his extension of himself and had become a closed system\" (Understanding Media, pg. 51). It's this last part about being a closed system that's really interesting to me, because I think this is the most dangerous part about building something without user feedback: you form a closed system with what you're making.", "parent": "Narcissus.txt", "score": 0.5397002037435337}, {"content": "2) One consequence of this conclusion is that if you're quitting social media, you should be sure that you're doing it for the right reasons. Are you doing it because you want to connect with people in real life, or are you running away from the presence of other people?", "parent": "Narcissus.txt", "score": 0.54191564026643}, {"content": "The bigger takeaway is this: do not assume that there is a simple one-way relationship between people and tools, where people just use tools without any second order effects. This is wrong. To quote McLuhan, \"the use of technology conforms men to them ... [an] Indian is the servomechanism of his canoe, as the cowboy of his horse or the executive of his clock\" (Understanding Media, pg. 55). ", "parent": "Narcissus.txt", "score": 0.5423054600124423}], "1) One of the best feelings when you're making something is the first time you personally find it useful. An uncomfortable corollary of the argument here, however, is that you should be suspicious of this feeling - you are at risk of becoming the servomechanism of what you are making.": [{"content": "1) One of the best feelings when you're making something is the first time you personally find it useful. An uncomfortable corollary of the argument here, however, is that you should be suspicious of this feeling - you are at risk of becoming the servomechanism of what you are making.", "parent": "Narcissus.txt", "score": 0.0}, {"content": "I'm happy someone other than me finds the tool useful. My worst fear is creating something nobody but myself finds useful, because then there's no way of knowing if I actually made something useful, or if I just adapted so well to using my own tool that I tricked myself into thinking its useful. ", "parent": "Narcissus.txt", "score": 0.3989683375310292}, {"content": "A safer (and more correct) assumption: *you* serve your tools, not the other way around. This puts a much higher burden on a designer - you are not making something people will use, you are making something people will (consciously or not) adapt themselves to and *serve*. Thinking this way puts you in a much more paranoid state of mind, which I believe is the correct stance to take towards technology. (1)", "parent": "Narcissus.txt", "score": 0.47358432881392243}, {"content": "I found this chapter of Understanding Media haunting because this happens to me all the time. I find myself obsessed with an idea, try to build it, get a working prototype, and refine the prototype in isolation - without realizing that the lack of external feedback means I'm created a closed feedback loop where I am adapting myself to a tool that I myself am making. A closed system like this converges towards a tool that is useful to no one at all.", "parent": "Narcissus.txt", "score": 0.5157603133119056}, {"content": "There are few feelings worse than wanting desperately to make something, and feeling as if you do not have the capability to make it. ", "parent": "untitled-9-22-2021.txt", "score": 0.523479700088501}, {"content": "You adapt the tool to your own needs. That's good, that's what you should do when you make a tool: adapt it to your needs. The sinister part is that whenever you use a tool, it changes you too. As you adapt the tool to yourself, you also adapt to the tool, and if you have no external feedback, that forms the closed system that McLuhan thinks characterizes Narcissus' situation and also man's relationship with technology.", "parent": "Narcissus.txt", "score": 0.5356517213915137}, {"content": "The bigger takeaway is this: do not assume that there is a simple one-way relationship between people and tools, where people just use tools without any second order effects. This is wrong. To quote McLuhan, \"the use of technology conforms men to them ... [an] Indian is the servomechanism of his canoe, as the cowboy of his horse or the executive of his clock\" (Understanding Media, pg. 55). ", "parent": "Narcissus.txt", "score": 0.546376388154604}, {"content": "I enjoy the process of sitting with my guitar, generating riff ideas on the fly, soloing over 8 bar progressions on my looper, but I'm not excited at all about creating a song. In many ways, my feelings about software are kind of the opposite. I have mixed, love/hate feelings about the process of writing software (reading documentation, chasing down bugs, writing tests, etc), but I feel incredibly excited about the end product. ", "parent": "NOW PAGE.txt", "score": 0.5474996566772461}, {"content": "Anyone who takes satisfaction in creative work knows how good it feels to make something. That feeling can get addicting, to the point where you hunger to make progress on a creative project even when you're burned out - you want to create something so badly you can't take a break without thinking about it, but you're too burned out to make progress on it. At moments like these, one craves divine creative stamina, the ability to create out of thin air effortlessly, to beam ideas from one's head into reality, to spawn an entire universe within the span of a week like the God of the Old Testament.[[personal-reflection]] ", "parent": "Prometheus.txt", "score": 0.5568821430206299}, {"content": "My philosophy here is this: it is better to try and make something authentic, beautiful, and expressive and have it turn out bad than it is to hide behind the safeness of minimalism. If you're writing, go ahead and try to sound clever. You might fail and sound incredibly immature, but a fear of failure is disastrous for any creative endeavor. If you're designing something, go all out. Make it bold and loud, and if it turns out gaudy, you can fix it on the next iteration. This was what I tried to do [[exegesis]]' redesign, and so far I'm very happy with it.", "parent": "Minimalism.txt", "score": 0.5618603229522705}], "2) One consequence of this conclusion is that if you're quitting social media, you should be sure that you're doing it for the right reasons. Are you doing it because you want to connect with people in real life, or are you running away from the presence of other people?": [{"content": "2) One consequence of this conclusion is that if you're quitting social media, you should be sure that you're doing it for the right reasons. Are you doing it because you want to connect with people in real life, or are you running away from the presence of other people?", "parent": "Narcissus.txt", "score": 2.2519418423350146e-06}, {"content": "The interesting thing about McLuhan is that he treats all mediums as inherently dangerous - there is a chapter in the book where he talks about how speech itself irreversibly transformed the human experience. Quitting social media only to become a hermit who reads or watches television all day does not solve anything. The problem is not social media per se, the problem is using technology to retreat from other people. Neon Genesis Evangelion is about this theme as well, and it predates the internet.", "parent": "Narcissus.txt", "score": 0.5105181023010326}, {"content": "Resist the impulse to distance yourself from others. Sartre famously remarked \"hell is other people\", but at the end of the day, only other people can save you from the technologically induced \"narcosis\" McLuhan warns about. The encroachment of other people's desires on you is ultimately a blessing, not a curse. (2)", "parent": "Narcissus.txt", "score": 0.5418256507171726}, {"content": "You are better off doomscrolling TikTok if it genuinely brings you closer to other people than you are as a misanthropic hermit who reads classical literature to feel superior to others. Avoid becoming a closed system.", "parent": "Narcissus.txt", "score": 0.5493055441162957}, {"content": "In a tantalizingly dialectical fashion, this phenomenon contains its own contradiction - on the very apps that have engineered the collapse of your attention span, you scroll past countless posts on social media addiction, hacks to improve your attention span, dopamine fasts, meditation routines, and even posts urging you to delete the apps on which they are hosted. But these hacks are nothing more than empty promises. The truth is that the world has changed, and you with it. There is no going back to the world where information was scarcer than attention. ", "parent": "Manifesto.txt", "score": 0.5929687023162842}, {"content": "Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]] ", "parent": "Controlling what you see.txt", "score": 0.594553530216217}, {"content": "If we analyze this quote alongside what McLuhan has written, it suggests that our troubled relationship with technology arises from our avoidance of one another. More optimistically, it suggests that there is a solution (however cliched it might be): show genuine concern for your fellow man.", "parent": "Narcissus.txt", "score": 0.6072204412163349}, {"content": "I have long distance friendships that are sustained almost entirely by exchanging tweets or instagram reels over DMs. I think this is a habit my generation has developed since the days of tagging friends in the comments of memes on Facebook meme pages. On some level this seems really dumb, but it's also helped me stay in touch with some of my closest friends who live across the continent. Substack seems like another avenue to do this, and that seems pretty nice. ", "parent": "Substack.txt", "score": 0.6102755069732666}, {"content": "Thinking as social", "parent": "untitled-9-24-2021.txt", "score": 0.6261011362075806}, {"content": "\"[Adam] Curtis attacks the internet because in his view it facilitates communities of solipsists, interpassive networks of like-minds who confirm, rather than challenge, each others' assumptions and prejudices.... Curtis' critique has a point, but it misses important dimensions of what is happening on the net. Contrary to Curtis' account of blogging, blogs can generate new discourse networks that have no correlate in the social field outside cyberspace.\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] ", "parent": "untitled-9-20-2021.txt", "score": 0.6344836950302124}], "The interesting thing about McLuhan is that he treats all mediums as inherently dangerous - there is a chapter in the book where he talks about how speech itself irreversibly transformed the human experience. Quitting social media only to become a hermit who reads or watches television all day does not solve anything. The problem is not social media per se, the problem is using technology to retreat from other people. Neon Genesis Evangelion is about this theme as well, and it predates the internet.": [{"content": "The interesting thing about McLuhan is that he treats all mediums as inherently dangerous - there is a chapter in the book where he talks about how speech itself irreversibly transformed the human experience. Quitting social media only to become a hermit who reads or watches television all day does not solve anything. The problem is not social media per se, the problem is using technology to retreat from other people. Neon Genesis Evangelion is about this theme as well, and it predates the internet.", "parent": "Narcissus.txt", "score": 0.0}, {"content": "If we analyze this quote alongside what McLuhan has written, it suggests that our troubled relationship with technology arises from our avoidance of one another. More optimistically, it suggests that there is a solution (however cliched it might be): show genuine concern for your fellow man.", "parent": "Narcissus.txt", "score": 0.3875750855753599}, {"content": "McLuhan describes the situation as such - \"[he] had adapted to his extension of himself and had become a closed system\" (Understanding Media, pg. 51). It's this last part about being a closed system that's really interesting to me, because I think this is the most dangerous part about building something without user feedback: you form a closed system with what you're making.", "parent": "Narcissus.txt", "score": 0.42106174239919014}, {"content": "I've been reading Understanding Media with some friends, and there's a chapter on the Greek myth of Narcissus. McLuhan claims that this story is about man's relationship with technology - the lake is to Narcissus as technology is to man. Narcissus, failing to realize the figure he sees in the lake is his own reflection, falls in love with it, and wastes away trying to love something that definitionally cannot love him back. ", "parent": "Narcissus.txt", "score": 0.42894931719057927}, {"content": "Resist the impulse to distance yourself from others. Sartre famously remarked \"hell is other people\", but at the end of the day, only other people can save you from the technologically induced \"narcosis\" McLuhan warns about. The encroachment of other people's desires on you is ultimately a blessing, not a curse. (2)", "parent": "Narcissus.txt", "score": 0.4451504107373778}, {"content": "Thinking about Marshall McLuhan and the Medium is the Message. More specifically, thinking about his concept of sensory ratios, and how biased we are towards the visual sense. ", "parent": "NOW-Jan-05-2024.txt", "score": 0.46011364459991455}, {"content": "I will admit that this is my personal synthesis of McLuhan and TLP's views of the myth of narcissus - this is not necessarily what McLuhan would say.", "parent": "Narcissus.txt", "score": 0.500981208665311}, {"content": "The bigger takeaway is this: do not assume that there is a simple one-way relationship between people and tools, where people just use tools without any second order effects. This is wrong. To quote McLuhan, \"the use of technology conforms men to them ... [an] Indian is the servomechanism of his canoe, as the cowboy of his horse or the executive of his clock\" (Understanding Media, pg. 55). ", "parent": "Narcissus.txt", "score": 0.5069973352508026}, {"content": "2) One consequence of this conclusion is that if you're quitting social media, you should be sure that you're doing it for the right reasons. Are you doing it because you want to connect with people in real life, or are you running away from the presence of other people?", "parent": "Narcissus.txt", "score": 0.510567147860542}, {"content": "I found this chapter of Understanding Media haunting because this happens to me all the time. I find myself obsessed with an idea, try to build it, get a working prototype, and refine the prototype in isolation - without realizing that the lack of external feedback means I'm created a closed feedback loop where I am adapting myself to a tool that I myself am making. A closed system like this converges towards a tool that is useful to no one at all.", "parent": "Narcissus.txt", "score": 0.513572698449123}], "You are better off doomscrolling TikTok if it genuinely brings you closer to other people than you are as a misanthropic hermit who reads classical literature to feel superior to others. Avoid becoming a closed system.": [{"content": "You are better off doomscrolling TikTok if it genuinely brings you closer to other people than you are as a misanthropic hermit who reads classical literature to feel superior to others. Avoid becoming a closed system.", "parent": "Narcissus.txt", "score": 4.5602458986770955e-07}, {"content": "Resist the impulse to distance yourself from others. Sartre famously remarked \"hell is other people\", but at the end of the day, only other people can save you from the technologically induced \"narcosis\" McLuhan warns about. The encroachment of other people's desires on you is ultimately a blessing, not a curse. (2)", "parent": "Narcissus.txt", "score": 0.5229025148614284}, {"content": "2) One consequence of this conclusion is that if you're quitting social media, you should be sure that you're doing it for the right reasons. Are you doing it because you want to connect with people in real life, or are you running away from the presence of other people?", "parent": "Narcissus.txt", "score": 0.549540026595014}, {"content": "In a tantalizingly dialectical fashion, this phenomenon contains its own contradiction - on the very apps that have engineered the collapse of your attention span, you scroll past countless posts on social media addiction, hacks to improve your attention span, dopamine fasts, meditation routines, and even posts urging you to delete the apps on which they are hosted. But these hacks are nothing more than empty promises. The truth is that the world has changed, and you with it. There is no going back to the world where information was scarcer than attention. ", "parent": "Manifesto.txt", "score": 0.5583949089050293}, {"content": "Substack notes feels weirdly earnest in an offputting way, like a different flavor of LinkedIn cringe where you're being sold navel gazing existentialism instead of careerist striving. It also feels like parts of Substack have a weird hierarchical structure, where at the bottom there are people writing empty existential platitudes about how to live, above them there are people criticizing them for that, then above that a group of people engaging in meta criticism about how too much Substack writing is people criticizing Substack writing. I'm aware I'm doing that right now, and I promise to avoid ever writing about Substack again if I can avoid it. It also seems true that these criticisms probably apply to basically any literary scene and maybe these problems are just unavoidable. ", "parent": "Substack.txt", "score": 0.5676528215408325}, {"content": "I found this chapter of Understanding Media haunting because this happens to me all the time. I find myself obsessed with an idea, try to build it, get a working prototype, and refine the prototype in isolation - without realizing that the lack of external feedback means I'm created a closed feedback loop where I am adapting myself to a tool that I myself am making. A closed system like this converges towards a tool that is useful to no one at all.", "parent": "Narcissus.txt", "score": 0.5792277892534505}, {"content": "I've been spending a lot of time on Substack notes. This is mostly because I have twitter and instagram blocked off my phone until 6PM, and I have nothing else to look at when I'm bored. It's telling that I don't feel a need to block Substack as well, because it's a lot less engaging. ", "parent": "Substack.txt", "score": 0.5897648334503174}, {"content": "I have long distance friendships that are sustained almost entirely by exchanging tweets or instagram reels over DMs. I think this is a habit my generation has developed since the days of tagging friends in the comments of memes on Facebook meme pages. On some level this seems really dumb, but it's also helped me stay in touch with some of my closest friends who live across the continent. Substack seems like another avenue to do this, and that seems pretty nice. ", "parent": "Substack.txt", "score": 0.5916192531585693}, {"content": "The interesting thing about McLuhan is that he treats all mediums as inherently dangerous - there is a chapter in the book where he talks about how speech itself irreversibly transformed the human experience. Quitting social media only to become a hermit who reads or watches television all day does not solve anything. The problem is not social media per se, the problem is using technology to retreat from other people. Neon Genesis Evangelion is about this theme as well, and it predates the internet.", "parent": "Narcissus.txt", "score": 0.5969284382987079}, {"content": "McLuhan describes the situation as such - \"[he] had adapted to his extension of himself and had become a closed system\" (Understanding Media, pg. 51). It's this last part about being a closed system that's really interesting to me, because I think this is the most dangerous part about building something without user feedback: you form a closed system with what you're making.", "parent": "Narcissus.txt", "score": 0.600509062624263}], "I will admit that this is my personal synthesis of McLuhan and TLP's views of the myth of narcissus - this is not necessarily what McLuhan would say.": [{"content": "I will admit that this is my personal synthesis of McLuhan and TLP's views of the myth of narcissus - this is not necessarily what McLuhan would say.", "parent": "Narcissus.txt", "score": 4.93839338755464e-07}, {"content": "I've been reading Understanding Media with some friends, and there's a chapter on the Greek myth of Narcissus. McLuhan claims that this story is about man's relationship with technology - the lake is to Narcissus as technology is to man. Narcissus, failing to realize the figure he sees in the lake is his own reflection, falls in love with it, and wastes away trying to love something that definitionally cannot love him back. ", "parent": "Narcissus.txt", "score": 0.3595733433072046}, {"content": "I'll end here and point you to another [interesting take on the Narcissus myth.](https://thelastpsychiatrist.com/2012/10/the_story_of_narcissus.html) This article is less about technology and more about human psychology, but I think you can still relate it back. Here's a quote: ", "parent": "Narcissus.txt", "score": 0.4599700598595424}, {"content": "The interesting thing about McLuhan is that he treats all mediums as inherently dangerous - there is a chapter in the book where he talks about how speech itself irreversibly transformed the human experience. Quitting social media only to become a hermit who reads or watches television all day does not solve anything. The problem is not social media per se, the problem is using technology to retreat from other people. Neon Genesis Evangelion is about this theme as well, and it predates the internet.", "parent": "Narcissus.txt", "score": 0.5010255852502367}, {"content": "Thinking about Marshall McLuhan and the Medium is the Message. More specifically, thinking about his concept of sensory ratios, and how biased we are towards the visual sense. ", "parent": "NOW-Jan-05-2024.txt", "score": 0.5122253894805908}, {"content": "If we analyze this quote alongside what McLuhan has written, it suggests that our troubled relationship with technology arises from our avoidance of one another. More optimistically, it suggests that there is a solution (however cliched it might be): show genuine concern for your fellow man.", "parent": "Narcissus.txt", "score": 0.534434417600675}, {"content": "A couple of ideas I think are very related but couldn't figure out how to weave in: [[Nietzsche]]'s distinction between the Apollonian and the Dionysian, the distinction made in [[Zen and the Art of Motorcycle Repair]] between Romantic Quality and Classical Quality.", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.5370103716850281}, {"content": "However I think I can also provide a principled argument against this \"anti-ego/pro-transcendental\" (albeit one that is also somewhat psychological). Along the lines of Nietzsche's argument, philosophy is deeply personal, and more often than not it reflects contingencies about the philosopher's personality rather than uncovering deep timeless truths. It seems to be the case that most philosophers who argue in favor of something transcendental and against the \"ego\" or \"personal identity\" are self-effacing individuals already. It's not like they'd be giving up much by renouncing their personal identities. Also, it's not particularly impressive for someone who's naturally humble to preach the virtues of humility - in a sense it seems like they're simply deifying aspects of their personality, rather than presenting a principled argument.", "parent": "untitled-2-6-2022.txt", "score": 0.5375701189041138}, {"content": "McLuhan describes the situation as such - \"[he] had adapted to his extension of himself and had become a closed system\" (Understanding Media, pg. 51). It's this last part about being a closed system that's really interesting to me, because I think this is the most dangerous part about building something without user feedback: you form a closed system with what you're making.", "parent": "Narcissus.txt", "score": 0.5454232075671591}, {"content": "I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]]. ", "parent": "Strategic blindness.txt", "score": 0.5534757375717163}], "   ": [{"content": "   ", "parent": "Narcissus.txt", "score": 0.0}, {"content": "  ", "parent": "Narcissus.txt", "score": 0.33762999419094464}, {"content": "  ", "parent": "The making of Nomad Hypertext.txt", "score": 0.3376423716545105}, {"content": "  ", "parent": "Narcissus.txt", "score": 0.3376520683706036}, {"content": "  ", "parent": "Gridworld.txt", "score": 0.3377795541132542}, {"content": " ", "parent": "Plaintext is your best friend.txt", "score": 0.4232235550880432}, {"content": " ", "parent": "untitled-10-11-2021.txt", "score": 0.4232402443885803}, {"content": " ", "parent": "Narcissus.txt", "score": 0.4233106988106383}, {"content": " ", "parent": "NOW PAGE.txt", "score": 0.42331093549728394}, {"content": " ", "parent": "Interface Journal: Summary Tool.txt", "score": 0.42331093549728394}]}