{"// outline": [{"content": "~", "parent": "Fragments.txt", "score": 1.3222907781600952}, {"content": "~", "parent": "Fragments.txt", "score": 1.3222907781600952}, {"content": "~", "parent": "Fragments.txt", "score": 1.3222907781600952}, {"content": "~", "parent": "Fragments.txt", "score": 1.3222907781600952}, {"content": "~", "parent": "Fragments.txt", "score": 1.3222907781600952}, {"content": "~", "parent": "untitled-1-4-2022.txt", "score": 1.3222907781600952}, {"content": "~", "parent": "untitled-1-4-2022.txt", "score": 1.3222907781600952}, {"content": "~", "parent": "The making of Nomad Hypertext.txt", "score": 1.3222907781600952}, {"content": "~", "parent": "The making of Nomad Hypertext.txt", "score": 1.3222907781600952}, {"content": "~", "parent": "Second Brains.txt", "score": 1.3222907781600952}], "": [{"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 1.2026228078123622}, {"content": "~", "parent": "Fragments.txt", "score": 1.202622890472412}, {"content": "~", "parent": "The making of Nomad Hypertext.txt", "score": 1.202627182006836}, {"content": "~", "parent": "The making of Nomad Hypertext.txt", "score": 1.2026363611221313}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 1.2026889059926669}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 1.2026889059926669}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 1.2026889059926669}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 1.2026889059926669}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 1.2026889059926669}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 1.2026889059926669}], "// I worked on big projects for the longest time, now I'm working on small projects. feel like I'm finally starting to become happy with my creative flow for software": [{"content": "This project, too, has had a large effect on me - you can't work on something for a year and not have it affect you. I started this project sitting in a coffee shop; now I haven't sat in one for months. I know this sounds like navel gazing, but I've worked on this project through a pandemic, civil unrest, and statewide wildfires. Now it's finished, and I almost feel a little bittersweet releasing it. ", "parent": "Reflections on exegesis.txt", "score": 0.9985229969024658}, {"content": "For a while, I exclusively worked on a long, serious projects. I wanted to build a billion dollar product. I wanted to be the founder of a successful startup. I wanted to write, but I wanted to write on my own platform that everybody else would also write on, that would have all the features I wanted that everybody else would love.", "parent": "Fragments.txt", "score": 1.0448856353759766}, {"content": "I want to return to my roots. I want to get excited by little ideas and not worry about scaling them, or fitting them into a huge vision, or turning them into legible accomplishments. I still want to be ambitious, but I don't want to let my ambition choke my creativity.", "parent": "Fragments.txt", "score": 1.0608588457107544}, {"content": "I stopped working on little projects. The voice in my head that would get excited by little hints of an idea was drowned out by demands that everything be in the service of something ambitious, something legible, something monetizable. I let my ambition trap me.", "parent": "Fragments.txt", "score": 1.0710219144821167}, {"content": "Actually, I'm not sure which I prefer yet. I have noticed, however, that sometimes I'll sit down to work for 2 hours, and proceed to waste it all, until the last 20 minutes or so, when I become desperate to get something done so the entire period wasn't a waste of time. That 20 minutes is often incredibly productive. When I only have pockets of 30 minute breaks throughout the day to work on a project, it's like every break is that last 20 minutes of a 2 hour work period. Or not, sometimes I end up getting nothing done, wishing I had 2 hours to do deep, focused work. [[focus]] [[personal-reflection]] ", "parent": "untitled-10-1-2021.txt", "score": 1.0942058563232422}, {"content": "That last project had a significant effect on me. Back in high school, I was heavily involved in Model UN and other political clubs. Making the [game](https://nichwch.itch.io/machinegods) made me realize it was making things and not winning arguments that really made me happier. It was also what convinced me that programming could be something more than rote problem solving, and even be a genuine creative medium. It was why I switched my major from Economics to Computer Science in college.[[personal-reflection]] ", "parent": "Reflections on exegesis.txt", "score": 1.101647973060608}, {"content": "The steady rhythm of school and myriad 30-minute break periods it produces throughout the day have a good effect on my productivity, which is surprising. There's that famous [Paul Graham essay](http://www.paulgraham.com/makersschedule.html) where he talks about hacker schedules, or how programmers/creators prefer long periods of focused time over short fragmented work periods (that managers tend to prefer) because there's an overhead cost to loading a project into your head. [[focus]] [[personal-reflection]] ", "parent": "untitled-10-1-2021.txt", "score": 1.1083543300628662}, {"content": "The main focus here is personal projects - learning more code and writing more are auxiliary activities that help this end. First among these personal projects is [[exegesis]], but I have a number of other personal projects that I want to work on as well. ", "parent": "Goals for Spring Quarter.txt", "score": 1.1092174053192139}, {"content": "These are my hobbies that I use to take a break from code related creative-work.  ", "parent": "Goals for Spring Quarter.txt", "score": 1.1254152059555054}, {"content": "I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]] ", "parent": "untitled-9-24-2021.txt", "score": 1.1268668174743652}], "// software is a creative thing for me, not a business endeavor. this realization has been a long time coming.": [{"content": "I want to clarify that I'm not bullish at all on no-code. I think \"no-code\" and \"low-code\" are the wrong way to frame things. There is a place for tools like this, but it's more productive to think of them as \"visual developer tools.\"[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 1.1501846313476562}, {"content": "This is not the case for programming. Making better tools for programming (new languages, new frameworks, new libraries) itself requires programming, and while making programming tools is different in important respects from writing regular programs, it is still programming. Making guitars is not playing guitars, making paints is not painting, but making better programming tools is programming. Programming, then, is an, intrinsically recursive creative medium. ", "parent": "Prometheus.txt", "score": 1.1719142198562622}, {"content": "The usual way to think about technology, software, and startups is that they solve problems, and so it follows then that the best way to create a new technology is to find a problem people have and solve it. This is not a bad approach to take, and it's been successful for many people. Still, I think it's too narrow.", "parent": "Creating new kinds of people.txt", "score": 1.1888291835784912}, {"content": "If this sounds silly, that's because it is. Reality check: note taking apps are just note taking apps; it is supremely arrogant to think that you think you can replicate with a couple KLOCs of javascript code what took evolution thousands of years to perfect. I have stopped thinking about exegesis as a personal knowledge management system or a notetaking app. For me it is the mental equivalent of [perpetual stew](https://en.wikipedia.org/wiki/Perpetual_stew) - I leave it on the stove and toss ideas in whenever its convenient. The effortlessness is the point; if I ever find myself drawing a diagram to have to figure out how to use it, that defeats the purpose of the whole thing.", "parent": "Second Brains.txt", "score": 1.1888315677642822}, {"content": "That last project had a significant effect on me. Back in high school, I was heavily involved in Model UN and other political clubs. Making the [game](https://nichwch.itch.io/machinegods) made me realize it was making things and not winning arguments that really made me happier. It was also what convinced me that programming could be something more than rote problem solving, and even be a genuine creative medium. It was why I switched my major from Economics to Computer Science in college.[[personal-reflection]] ", "parent": "Reflections on exegesis.txt", "score": 1.1914753913879395}, {"content": "This was reassuring, because it meant I had made something genuinely useful. In the past, I have made things I simply had no desire to use - one example is [JAFT](https://nichwch.medium.com/what-is-jaft-f543a4fad9d7), a time tracking app I made after making YANA (the predecessor to exegesis). I stopped using it after a bit, and didn't bother renewing the domain. I don't miss JAFT at all. The fact that I did miss exegesis on the days where it wasn't operational was a good sign.", "parent": "Second Brains.txt", "score": 1.2109187841415405}, {"content": "There is at least one creative medium for which this is not true, however, and that is programming. Here is a unique and strange property of programming: Making tools to program better itself involves programming. This is not true for music or art - the process of making a guitar is not the art of playing the guitar, the process of making paints is not the art of painting, and while luthiers and paint-makers are certainly artists in their own right (and are often good at playing the guitar and painting, respectively), they practice an art that is distinct from the art that they enable. ", "parent": "Prometheus.txt", "score": 1.2325489521026611}, {"content": "With cloud software, our digital lives lack this permanence. Startups shut down left and right, products get split into multiple products or merged together, interfaces get redesigned and their redesigns get redesigned, all at the whims of the markets or feuding product managers. This is not a stable foundation to build anything lasting on top of.", "parent": "Generational Computing.txt", "score": 1.2338106632232666}, {"content": "I desperately want programming to feel like this.", "parent": "Fragments.txt", "score": 1.2548080682754517}, {"content": "In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]", "parent": "untitled-9-24-2021.txt", "score": 1.2650893926620483}], "//#On Entrepreneurship": [{"content": "There is an intrinsic conflict between entrepreneurship and polishing craft. ", "parent": "Small Projects.txt", "score": 1.0250096321105957}, {"content": "Entrepreneurship is not neccessarily incompatible with \"small projects\" and staying agile, because entrepreneurs still have to pivot often. - but you're pivoting with respect to what customers want, not what will improve your craft, or what you're interested in. Good musicians do two things: practice sections they find difficult to play, and articulate musical ideas that they find interesting. They don't go out and call prospective listeners and ask what they'd like to hear.  ", "parent": "Small Projects.txt", "score": 1.0913279056549072}, {"content": "Finished Capitalist Realism", "parent": "untitled-9-20-2021.txt", "score": 1.2312971353530884}, {"content": "There's almost a Jobsian element to what he's saying here. In fact, you could argue that Steve Jobs, with all his hippie/countercultural heritage, belonged to that \"postwar social consensus.\" Could our capitalist reality today give rise to another innovator like Jobs? Of course, I'm sure Mark Fischer was no fan of Apple or Jobs, but it's still an interesting question to raise.  ", "parent": "untitled-9-20-2021.txt", "score": 1.2711894512176514}, {"content": "The usual way to think about technology, software, and startups is that they solve problems, and so it follows then that the best way to create a new technology is to find a problem people have and solve it. This is not a bad approach to take, and it's been successful for many people. Still, I think it's too narrow.", "parent": "Creating new kinds of people.txt", "score": 1.330984354019165}, {"content": "For a while, I exclusively worked on a long, serious projects. I wanted to build a billion dollar product. I wanted to be the founder of a successful startup. I wanted to write, but I wanted to write on my own platform that everybody else would also write on, that would have all the features I wanted that everybody else would love.", "parent": "Fragments.txt", "score": 1.3382340669631958}, {"content": "Tagging this all meta-acropolis, an edtech project I'm in the early stages of working on. Don't have any code for it, just ideas, but I plan on putting something together soon™. [[meta-acropolis]] [[ideas]] ", "parent": "untitled-9-21-2021.txt", "score": 1.3481218814849854}, {"content": "The strength of serendipity", "parent": "Second Brains.txt", "score": 1.3619329929351807}, {"content": "Gives inspiration", "parent": "What is Nomad Hypertext.txt", "score": 1.3809972484886692}, {"content": "Speaking of which, Fischer has something to say on the social prerequisites for innovation. \"[I]t is now clear that a certain amount of stability is necessary for cultural vibrancy, the question to be asked is: how can this stability be provided, and by what agencies?\" His tentative answer to this is \"a public space that is not reducible to an aggregation of individuals and their interests\" (see the quote above where he says some innovations are impossible because the public has been displaced by the consumer) [[mark-fischer]] [[quotes]] [[Capitalist-Realism]] ", "parent": "untitled-9-20-2021.txt", "score": 1.3883001804351807}], "There is an intrinsic conflict between entrepreneurship and polishing craft. ": [{"content": "There is an intrinsic conflict between entrepreneurship and polishing craft. ", "parent": "Small Projects.txt", "score": 0.0}, {"content": "Entrepreneurship is not neccessarily incompatible with \"small projects\" and staying agile, because entrepreneurs still have to pivot often. - but you're pivoting with respect to what customers want, not what will improve your craft, or what you're interested in. Good musicians do two things: practice sections they find difficult to play, and articulate musical ideas that they find interesting. They don't go out and call prospective listeners and ask what they'd like to hear.  ", "parent": "Small Projects.txt", "score": 0.9021890163421631}, {"content": "Neither perspective is completely correct. The reality is that there is a tradeoff between the approach of creative collaboration and the approach of an auteur. What creative collaborators gain through specialization and the combination of talents, they lose in the fidelity of their ideas' expression; what the auteur loses through not being able to harness others' talents, he gains through the ability to express an idea to its fullest. Naturally, the more talents the auteur is able to accrue, the less he needs others, and the more worthwhile the tradeoff of solo work becomes.  ", "parent": "On auteurs and language.txt", "score": 1.1002053022384644}, {"content": "Anyone doing creative work must carefully toe the line between two extremes: the collaborative extreme of butchering ideas by putting them into words, the auteur's extreme of refusing to communicate anything about an idea at all. ", "parent": "On auteurs and language.txt", "score": 1.102844476699829}, {"content": "In general, we should strive to have conviction in what we make. When minimalism is an expression of this conviction, it is good, but more often than not it's used as a crutch to mask a lack of conviction. ", "parent": "Minimalism.txt", "score": 1.208371877670288}, {"content": "Speaking of which, Fischer has something to say on the social prerequisites for innovation. \"[I]t is now clear that a certain amount of stability is necessary for cultural vibrancy, the question to be asked is: how can this stability be provided, and by what agencies?\" His tentative answer to this is \"a public space that is not reducible to an aggregation of individuals and their interests\" (see the quote above where he says some innovations are impossible because the public has been displaced by the consumer) [[mark-fischer]] [[quotes]] [[Capitalist-Realism]] ", "parent": "untitled-9-20-2021.txt", "score": 1.217900037765503}, {"content": "Creative tools vs rational tools", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 1.2319172620773315}, {"content": "There's almost a Jobsian element to what he's saying here. In fact, you could argue that Steve Jobs, with all his hippie/countercultural heritage, belonged to that \"postwar social consensus.\" Could our capitalist reality today give rise to another innovator like Jobs? Of course, I'm sure Mark Fischer was no fan of Apple or Jobs, but it's still an interesting question to raise.  ", "parent": "untitled-9-20-2021.txt", "score": 1.2376518249511719}, {"content": "Finished Capitalist Realism", "parent": "untitled-9-20-2021.txt", "score": 1.2383692264556885}, {"content": "But this is something forbidden to mortal men. We face a kind of creative asymmetry - to bring beauty into the world, it is neccessary to confront ugliness. Creating beautiful, original music requires endless, stupid, and frustrating scale practice, finger exercises, and theory study; behind the sublime beauty of a master's painting lies hours of practice filling sketchbooks with mind numbing still lifes and ugly anatomical mistakes. On the one hand, it seems paradoxical that beauty, freedom and originality require ugliness, servitude, and repetition. On the other hand, it is almost coldly rational - perhaps there is a kind of aesthetic entropy at play, like there's a set amount of beauty in the universe, and to \"produce\" any more of it, you first have to take on ugliness as a burden.[[music]] [[aesthetics]] [[art]] ", "parent": "Prometheus.txt", "score": 1.2436227798461914}], "Entrepreneurship is not neccessarily incompatible with \"small projects\" and staying agile, because entrepreneurs still have to pivot often. - but you're pivoting with respect to what customers want, not what will improve your craft, or what you're interested in. Good musicians do two things: practice sections they find difficult to play, and articulate musical ideas that they find interesting. They don't go out and call prospective listeners and ask what they'd like to hear.  ": [{"content": "Entrepreneurship is not neccessarily incompatible with \"small projects\" and staying agile, because entrepreneurs still have to pivot often. - but you're pivoting with respect to what customers want, not what will improve your craft, or what you're interested in. Good musicians do two things: practice sections they find difficult to play, and articulate musical ideas that they find interesting. They don't go out and call prospective listeners and ask what they'd like to hear.  ", "parent": "Small Projects.txt", "score": 0.0}, {"content": "There is an intrinsic conflict between entrepreneurship and polishing craft. ", "parent": "Small Projects.txt", "score": 0.9021890163421631}, {"content": "I want to return to my roots. I want to get excited by little ideas and not worry about scaling them, or fitting them into a huge vision, or turning them into legible accomplishments. I still want to be ambitious, but I don't want to let my ambition choke my creativity.", "parent": "Fragments.txt", "score": 1.0199174880981445}, {"content": "This is a lot. I doubt I'll be able to do all of this, and if I fall short on time, I'll have to cut back on some of these activities. They are not listed in order of importance, I plan on figuring that out at a later date. What is important to me is that I actually think about what I want to do, and the priorities for them. It's all to easy to spend a day noodling on guitar, wanting to get better solely because I saw some guy play a fancy solo on Youtube, or to spend a day learning a programming language I'll never use because someone on Twitter praised it. This is a recipe for mediocrity, because progress takes sustained practice, and I can't sustain these sorts of \"inspirations.\" Instead, I want to think slowly and deliberately about what I want to get better at, and stick to a slow and steady plan to improve at it. That is my \"big-picture\" goal for this year. ", "parent": "Reflections for the New Year.txt", "score": 1.0944241285324097}, {"content": "The usual way to think about technology, software, and startups is that they solve problems, and so it follows then that the best way to create a new technology is to find a problem people have and solve it. This is not a bad approach to take, and it's been successful for many people. Still, I think it's too narrow.", "parent": "Creating new kinds of people.txt", "score": 1.1031219959259033}, {"content": "I stopped working on little projects. The voice in my head that would get excited by little hints of an idea was drowned out by demands that everything be in the service of something ambitious, something legible, something monetizable. I let my ambition trap me.", "parent": "Fragments.txt", "score": 1.135874629020691}, {"content": "The compromise that I've arrived at, and that I've tried so far with a decent amount of success, is to draw with my preferred medium (pen), in my own style, while also using a reference. I use the reference for the pose and some of the details, and use my imagination to make up the rest. This is infinitely more interesting for me, and doesn't feel like a dreary technical exercise. I've also given up on using pencil, or charcoal, or anything except pen. I used to harbor a lot of guilt over this, because shouldn't an artist be able to use any medium? Of course, this is ridiculous, it'd be like asking a musician to be familiar with every instrument. It makes far more sense to get really good with one medium than to be mediocre with multiple (feeling some cognitive dissonance here with my desire to learn both the [[piano]] and the [[guitar]]...). Of course, professional artists (and musicians) really should be learning multiple mediums, but I have no aspiration to be professional at either, only to have some fun. [[drawing]] [[piano]] [[guitar]] ", "parent": "Reflections for the New Year.txt", "score": 1.1522290706634521}, {"content": "Anyone doing creative work must carefully toe the line between two extremes: the collaborative extreme of butchering ideas by putting them into words, the auteur's extreme of refusing to communicate anything about an idea at all. ", "parent": "On auteurs and language.txt", "score": 1.1625086069107056}, {"content": "With cloud software, our digital lives lack this permanence. Startups shut down left and right, products get split into multiple products or merged together, interfaces get redesigned and their redesigns get redesigned, all at the whims of the markets or feuding product managers. This is not a stable foundation to build anything lasting on top of.", "parent": "Generational Computing.txt", "score": 1.1803388595581055}, {"content": "I do think, however, that it's important to have priorities. In the first draft of this, I ordered each of those goals in a list of priorities from top to bottom, but I don't think that was a good way of looking at it. For one, a lot of them are highly related - for example, working on personal projects and learning to code. ", "parent": "Goals for Spring Quarter.txt", "score": 1.1992557048797607}], "// subdomains. bad for SEO, who cares": [{"content": "If you want some text to not show up in the search index (if it's private, or not very important, or any other reason), prepend the paragraph with two slashes. ", "parent": "What is Nomad Hypertext.txt", "score": 1.3394664517604635}, {"content": "What he says about links, I believe to be true about semantic search. ", "parent": "What is Nomad Hypertext.txt", "score": 1.3828682340374812}, {"content": "The basic idea here is that semantic search functions better than backlinking, tags, or folders at helping you see connections between your ideas. It is also much simpler to implement. With backlinks and tags, you often need specialized file types, but semantic search works on top of plain text. ", "parent": "What is Nomad Hypertext.txt", "score": 1.4166611582731117}, {"content": "Good vs Bad minimalism", "parent": "Minimalism.txt", "score": 1.4218578338623047}, {"content": "There are pros and cons to this approach. The biggest pro is that it generates a static blog. There's no backend to maintain, and it's quite lightweight and loads fast, while also providing the benefit of semantic hyperlinks. The con is that since the index is precomputed, you can't search for arbitrary things like you can in nomad hypertext. ", "parent": "What is Yurt.txt", "score": 1.4224711656570435}, {"content": "You're viewing this on a statically generated blog using Yurt! ", "parent": "What is Yurt.txt", "score": 1.4799740314483643}, {"content": "I think eventually, I might want to deploy a blog with a full fledged backend, so users can query anything they'd like to my blog. ", "parent": "What is Yurt.txt", "score": 1.4818521738052368}, {"content": "Factoring out the semantic search element of my app would have been the correct, unix-ey thing to do, and it would allow me to make these extensions in the future. I plan on doing this soon.  ", "parent": "The making of Nomad Hypertext.txt", "score": 1.4912618398666382}, {"content": "In any case I wanted to try something new because that's what Recurse is all about, so I tried making a project with just JS and JSDoc for some semblance of type safety. ", "parent": "The making of Nomad Hypertext.txt", "score": 1.4964829683303833}, {"content": "The other thing I miss is links. You can still paste urls, however. It's ugly but it works. ", "parent": "Plaintext is your best friend.txt", "score": 1.5020158290863037}], "projects are cool!": [{"content": "projects are cool!", "parent": "Small Projects.txt", "score": 0.0}, {"content": "Fortunately, it looks like there's progress being made here, with projects like [https://github.com/blocks/blocks.](https://github.com/blocks/blocks.) I want to build my own solutions, maybe borrowing from current projects.[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 1.020525574684143}, {"content": "Tagging this all meta-acropolis, an edtech project I'm in the early stages of working on. Don't have any code for it, just ideas, but I plan on putting something together soon™. [[meta-acropolis]] [[ideas]] ", "parent": "untitled-9-21-2021.txt", "score": 1.159611463546753}, {"content": "That last project had a significant effect on me. Back in high school, I was heavily involved in Model UN and other political clubs. Making the [game](https://nichwch.itch.io/machinegods) made me realize it was making things and not winning arguments that really made me happier. It was also what convinced me that programming could be something more than rote problem solving, and even be a genuine creative medium. It was why I switched my major from Economics to Computer Science in college.[[personal-reflection]] ", "parent": "Reflections on exegesis.txt", "score": 1.16064453125}, {"content": "The main focus here is personal projects - learning more code and writing more are auxiliary activities that help this end. First among these personal projects is [[exegesis]], but I have a number of other personal projects that I want to work on as well. ", "parent": "Goals for Spring Quarter.txt", "score": 1.1926826238632202}, {"content": "The vision is to have a tool that provides a visual interface for creating layouts, and maybe even rigging up basic stateful logic, or data fetching logic. I've more or less nailed down a preferred personal stack for creating projects with React, Express and Postgres, so it shouldn't be terribly difficult to even integrate database logic/fetching logic into such a tool (so long as some flexibility is lost on technology choice).[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 1.201310634613037}, {"content": "I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]] ", "parent": "untitled-9-24-2021.txt", "score": 1.2116562128067017}, {"content": " [[ideas]]: A tool that analyzes a react project and shows your component structure for you in a nice and visual way. Probably already exists, idk", "parent": "untitled-9-20-2021.txt", "score": 1.2183129787445068}, {"content": "[[meta-acropolis proof of concept]] Maybe do the demo for [[metaphysics]] instead. It's a subject I actually care about, and I'm taking the course this quarter. Also, I finished number theory last quarter and I have no intention of touching it again if I don't have to. testing edits. 5", "parent": "untitled-1-4-2022.txt", "score": 1.2276586294174194}, {"content": "Write about progress with code, hobbies, or some idea at least once a week (don't have to publish!)", "parent": "Goals for Spring Quarter.txt", "score": 1.241984248161316}], "// ": [{"content": "~", "parent": "The making of Nomad Hypertext.txt", "score": 1.0730026960372925}, {"content": "~", "parent": "The making of Nomad Hypertext.txt", "score": 1.0730571746826172}, {"content": "~", "parent": "Fragments.txt", "score": 1.0730679035186768}, {"content": "~", "parent": "Fragments.txt", "score": 1.0730679035186768}, {"content": "~", "parent": "Fragments.txt", "score": 1.0730679035186768}, {"content": "~", "parent": "Fragments.txt", "score": 1.0730679035186768}, {"content": "~", "parent": "untitled-1-4-2022.txt", "score": 1.0730679035186768}, {"content": "~", "parent": "untitled-1-4-2022.txt", "score": 1.0730679035186768}, {"content": "~", "parent": "The making of Nomad Hypertext.txt", "score": 1.0730679035186768}, {"content": "~", "parent": "The making of Nomad Hypertext.txt", "score": 1.0730679035186768}]}