{"Growing up, my main creative outlet was drawing. As soon as a pencil or pen touched my hand I would have to draw something - it was almost involuntary. Many school notebooks were ruined this way, many concerned teachers advised me to keep my homework free of doodles.": [{"content": "Growing up, my main creative outlet was drawing. As soon as a pencil or pen touched my hand I would have to draw something - it was almost involuntary. Many school notebooks were ruined this way, many concerned teachers advised me to keep my homework free of doodles.", "parent": "Fragments.txt", "score": 8.71265399382537e-07}, {"content": "I want to improve at drawing. Drawing is something I've always loved doing, my notebooks from middle school and high school have more doodles in them than proper notes. I never took it particularly seriously, and when life got busy, I'd stop drawing for months on end. However, when I returned, it was always still fun. In fact, every time I've tried to get into \"regular\" drawing practice, it's always been miserable. There's some strange effect here where the longer I go without drawing, the better my drawings tend to be, as if drawing ability were a fixed resource that took time to build up. [[drawing]] ", "parent": "Reflections for the New Year.txt", "score": 0.6746917963027954}, {"content": "In my teen years, I found programming and videogame development, and that became my creative outlet for a while. I found a way to scan my drawings into digital files, and for a while that was my way of combining art and programming.", "parent": "Fragments.txt", "score": 0.9148187637329102}, {"content": "There was a problem with both of these outlets, however: my short attention span. I struggled to work on larger drawings, because I'd give up on them and start new doodles. The same happened with code projects.", "parent": "Fragments.txt", "score": 0.9420274496078491}, {"content": "The compromise that I've arrived at, and that I've tried so far with a decent amount of success, is to draw with my preferred medium (pen), in my own style, while also using a reference. I use the reference for the pose and some of the details, and use my imagination to make up the rest. This is infinitely more interesting for me, and doesn't feel like a dreary technical exercise. I've also given up on using pencil, or charcoal, or anything except pen. I used to harbor a lot of guilt over this, because shouldn't an artist be able to use any medium? Of course, this is ridiculous, it'd be like asking a musician to be familiar with every instrument. It makes far more sense to get really good with one medium than to be mediocre with multiple (feeling some cognitive dissonance here with my desire to learn both the [[piano]] and the [[guitar]]...). Of course, professional artists (and musicians) really should be learning multiple mediums, but I have no aspiration to be professional at either, only to have some fun. [[drawing]] [[piano]] [[guitar]] ", "parent": "Reflections for the New Year.txt", "score": 1.0069419145584106}, {"content": "That being said, I think I've figured out a different drawing routine that will work this time. Past practice routines always centered around trying to copy other people's art, or doing realistic sketches/pose practice in pencil. I enjoy drawing without references the most, making things up as I go. Drawing from a reference is always boring and dreary for me. However, there's really no way to improve without using references. This is especially true since my biggest drawing deficiencies are not being able to draw people's faces well, portraying 3D shapes in a non-flat way, shading/cross-hatching, and posing figures naturally.[[drawing]] ", "parent": "Reflections for the New Year.txt", "score": 1.0565649271011353}, {"content": "Practice drawing 3 times a week", "parent": "Goals for Spring Quarter.txt", "score": 1.1008504629135132}, {"content": "For drawing, I'd like to practice drawing reference images in my own style 3 times a week, with a focus on drawing more three dimensionally, drawing people/poses, and using color. ", "parent": "Goals for Spring Quarter.txt", "score": 1.118742823600769}, {"content": "As I grew older, I tried to fix myself in various ways. I tried blocking out all of my time in a calendar. I tried blocking distracting websites. I tried living my life in a three-ring binder. I tried planners, I tried meditation, I tried todo lists, I tried kanban boards. I tried to not care, I tried caring too much. ", "parent": "Why I made exegesis.txt", "score": 1.1213027238845825}, {"content": "Get better at drawing", "parent": "Goals for Spring Quarter.txt", "score": 1.1458195447921753}], "": [{"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 1.2026228078123622}, {"content": "~", "parent": "Fragments.txt", "score": 1.202622890472412}, {"content": "~", "parent": "The making of Nomad Hypertext.txt", "score": 1.202627182006836}, {"content": "~", "parent": "The making of Nomad Hypertext.txt", "score": 1.2026363611221313}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 1.2026889059926669}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 1.2026889059926669}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 1.2026889059926669}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 1.2026889059926669}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 1.2026889059926669}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 1.2026889059926669}], "In my teen years, I found programming and videogame development, and that became my creative outlet for a while. I found a way to scan my drawings into digital files, and for a while that was my way of combining art and programming.": [{"content": "In my teen years, I found programming and videogame development, and that became my creative outlet for a while. I found a way to scan my drawings into digital files, and for a while that was my way of combining art and programming.", "parent": "Fragments.txt", "score": 1.025201072479831e-06}, {"content": "Growing up, my main creative outlet was drawing. As soon as a pencil or pen touched my hand I would have to draw something - it was almost involuntary. Many school notebooks were ruined this way, many concerned teachers advised me to keep my homework free of doodles.", "parent": "Fragments.txt", "score": 0.9149130582809448}, {"content": "That last project had a significant effect on me. Back in high school, I was heavily involved in Model UN and other political clubs. Making the [game](https://nichwch.itch.io/machinegods) made me realize it was making things and not winning arguments that really made me happier. It was also what convinced me that programming could be something more than rote problem solving, and even be a genuine creative medium. It was why I switched my major from Economics to Computer Science in college.[[personal-reflection]] ", "parent": "Reflections on exegesis.txt", "score": 0.9863736629486084}, {"content": "These are my hobbies that I use to take a break from code related creative-work.  ", "parent": "Goals for Spring Quarter.txt", "score": 0.9905251264572144}, {"content": "There was a problem with both of these outlets, however: my short attention span. I struggled to work on larger drawings, because I'd give up on them and start new doodles. The same happened with code projects.", "parent": "Fragments.txt", "score": 1.0604759454727173}, {"content": "I want to improve at drawing. Drawing is something I've always loved doing, my notebooks from middle school and high school have more doodles in them than proper notes. I never took it particularly seriously, and when life got busy, I'd stop drawing for months on end. However, when I returned, it was always still fun. In fact, every time I've tried to get into \"regular\" drawing practice, it's always been miserable. There's some strange effect here where the longer I go without drawing, the better my drawings tend to be, as if drawing ability were a fixed resource that took time to build up. [[drawing]] ", "parent": "Reflections for the New Year.txt", "score": 1.08986496925354}, {"content": "This is not the case for programming. Making better tools for programming (new languages, new frameworks, new libraries) itself requires programming, and while making programming tools is different in important respects from writing regular programs, it is still programming. Making guitars is not playing guitars, making paints is not painting, but making better programming tools is programming. Programming, then, is an, intrinsically recursive creative medium. ", "parent": "Prometheus.txt", "score": 1.1375906467437744}, {"content": "I desperately want programming to feel like this.", "parent": "Fragments.txt", "score": 1.1493114233016968}, {"content": "It is this property that allows programmers to cheat the Gods, and achieve divine levels of creative output thought forbidden to mortals. A programmer can create abstractions than enable them to create in days what previously took months. I myself rewrote a good part of exegesis 2 months before I released it, and the new abstractions I picked enabled me to redo in those 2 months what took me almost a year at first. Moreover, programmers can share their abstractions, and borrow the inventions of others as well.", "parent": "Prometheus.txt", "score": 1.1777199506759644}, {"content": "There is at least one creative medium for which this is not true, however, and that is programming. Here is a unique and strange property of programming: Making tools to program better itself involves programming. This is not true for music or art - the process of making a guitar is not the art of playing the guitar, the process of making paints is not the art of painting, and while luthiers and paint-makers are certainly artists in their own right (and are often good at playing the guitar and painting, respectively), they practice an art that is distinct from the art that they enable. ", "parent": "Prometheus.txt", "score": 1.1843103170394897}], "There was a problem with both of these outlets, however: my short attention span. I struggled to work on larger drawings, because I'd give up on them and start new doodles. The same happened with code projects.": [{"content": "There was a problem with both of these outlets, however: my short attention span. I struggled to work on larger drawings, because I'd give up on them and start new doodles. The same happened with code projects.", "parent": "Fragments.txt", "score": 0.0}, {"content": "Growing up, my main creative outlet was drawing. As soon as a pencil or pen touched my hand I would have to draw something - it was almost involuntary. Many school notebooks were ruined this way, many concerned teachers advised me to keep my homework free of doodles.", "parent": "Fragments.txt", "score": 0.9421297311782837}, {"content": "I want to improve at drawing. Drawing is something I've always loved doing, my notebooks from middle school and high school have more doodles in them than proper notes. I never took it particularly seriously, and when life got busy, I'd stop drawing for months on end. However, when I returned, it was always still fun. In fact, every time I've tried to get into \"regular\" drawing practice, it's always been miserable. There's some strange effect here where the longer I go without drawing, the better my drawings tend to be, as if drawing ability were a fixed resource that took time to build up. [[drawing]] ", "parent": "Reflections for the New Year.txt", "score": 0.9712199568748474}, {"content": "Actually, I'm not sure which I prefer yet. I have noticed, however, that sometimes I'll sit down to work for 2 hours, and proceed to waste it all, until the last 20 minutes or so, when I become desperate to get something done so the entire period wasn't a waste of time. That 20 minutes is often incredibly productive. When I only have pockets of 30 minute breaks throughout the day to work on a project, it's like every break is that last 20 minutes of a 2 hour work period. Or not, sometimes I end up getting nothing done, wishing I had 2 hours to do deep, focused work. [[focus]] [[personal-reflection]] ", "parent": "untitled-10-1-2021.txt", "score": 1.0240994691848755}, {"content": "In my teen years, I found programming and videogame development, and that became my creative outlet for a while. I found a way to scan my drawings into digital files, and for a while that was my way of combining art and programming.", "parent": "Fragments.txt", "score": 1.0604314804077148}, {"content": "I stopped working on little projects. The voice in my head that would get excited by little hints of an idea was drowned out by demands that everything be in the service of something ambitious, something legible, something monetizable. I let my ambition trap me.", "parent": "Fragments.txt", "score": 1.0921218395233154}, {"content": "Working on exegesis was a grueling affair at times. I rewrote the schema multiple times, rewrote the backend from scratch 2 months before release, chased countless UI bugs, and manually patched abandoned NPM packages. Part of it may have been due to my inexperience, but [working with ](https://nichwch.medium.com/making-yana-e3fade3f56e7)[rich text](https://medium.engineering/why-contenteditable-is-terrible-122d8a40e480) is just a [difficult task](https://twitter.com/thesephist/status/1360298464349999108), period. At one point, I considered giving up after finding a rival writing app I thought I simply couldn't compete with - I have a copy of an unfinished essay I started writing on why I had given up tucked away somewhere. ", "parent": "Prometheus.txt", "score": 1.1250877380371094}, {"content": "The steady rhythm of school and myriad 30-minute break periods it produces throughout the day have a good effect on my productivity, which is surprising. There's that famous [Paul Graham essay](http://www.paulgraham.com/makersschedule.html) where he talks about hacker schedules, or how programmers/creators prefer long periods of focused time over short fragmented work periods (that managers tend to prefer) because there's an overhead cost to loading a project into your head. [[focus]] [[personal-reflection]] ", "parent": "untitled-10-1-2021.txt", "score": 1.132912516593933}, {"content": "I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]] ", "parent": "untitled-9-24-2021.txt", "score": 1.139030933380127}, {"content": "I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.", "parent": "Second Brains.txt", "score": 1.1392723321914673}], "~": [{"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 0.0}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 0.0}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 0.0}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 0.0}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 0.0}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 0.0}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 0.0}, {"content": "~", "parent": "Fragments.txt", "score": 0.0}, {"content": "~", "parent": "Fragments.txt", "score": 0.0}, {"content": "~", "parent": "Fragments.txt", "score": 0.0}], "I fell in love with playing the guitar because it rewards this lack of an attention span. You can copy a riff in minutes. You can create a new riff in minutes. Picking up a guitar puts me in an instant flow state, because I can just screw around and play with ideas instantly. It feels like a REPL for musical ideas.": [{"content": "I fell in love with playing the guitar because it rewards this lack of an attention span. You can copy a riff in minutes. You can create a new riff in minutes. Picking up a guitar puts me in an instant flow state, because I can just screw around and play with ideas instantly. It feels like a REPL for musical ideas.", "parent": "Fragments.txt", "score": 7.600390858897299e-07}, {"content": "Playing a lot of guitar. Thinking about how fundamental rhythm is to the guitar, even when playing lead lines. Thinking about how you can approach solos like a series of improvised rhythmic riffs. Listening to a lot of King Crimson. ", "parent": "NOW PAGE.txt", "score": 0.8714759945869446}, {"content": "Here's an anecdote to illustrate my point: I picked up guitar at the start of quarantine. What inspired this? Was it a childhood dream of mine? Maybe I wanted to be like my favorite rock stars? Or was it just the boredom?", "parent": "Giant Robots.txt", "score": 0.8916953206062317}, {"content": "Thinking about how the piano is an explicitly visual instrument (laid out for easy sight reading), while the guitar is a more tactile and auditory instrument (difficult to sight read, rewards learning by ear therefore auditory; strings literally cut into your fingers, therefore tactile). ", "parent": "NOW PAGE.txt", "score": 0.9748300313949585}, {"content": "Get good at guitar", "parent": "Goals for Spring Quarter.txt", "score": 1.0563068389892578}, {"content": "Whether its noticing that two songs use the same chord progression, stealing a nice lick from your favorite blues guitarist, making a mashup of two of your favorite songs, or translating a song into a different genre, playing music is all about making connections. Unfortunately, the way we listen to music prevents us from doing this.", "parent": "Context and community makes music more enjoyable, and it's missing from modern streaming services.txt", "score": 1.0577462911605835}, {"content": "I have not really settled into a good practice schedule for either piano or guitar. For the past couple of weeks, I've neglected guitar after moving my electric keyboard into my room, though my piano progress has hardly been good either - I have spent the past couple months playing the same pentatonic licks over Autumn Leaves. My goal for both instruments is to learn a couple of jazz standards with my housemates so we can jam together more. ", "parent": "Goals for Spring Quarter.txt", "score": 1.0637825727462769}, {"content": "I want to get better at music. I went to [[piano]] classes as a kid and never really enjoyed them or took them seriously. Now I regret it. I also picked up guitar over quarantine, and want to get into a regular practice regimen for both of these instruments. For piano, I want to learn jazz, and how to improvise - I can't say I have much interest in building up my classical repertoire. For guitar, my current plan is to learn the blues, because I hear that's the root of many musical genres, and maybe branch off into rock or jazz later. A short term goal for both instruments is to familiarize myself with their scales. ", "parent": "Reflections for the New Year.txt", "score": 1.0689563751220703}, {"content": "None of the above. I got a targeted Facebook ad for Fender's free online guitar course. I remember this very distinctly as the moment I decided to learn guitar; I had never really thought much about it at all before that. Deep within the entrails of Facebook's recommendation engine, some algorithm made an educated guess that I'd enjoy picking up the guitar - and it was right. For all the horrible things Facebook has done, this was a real positive-sum, Pareto optimal moment. Zuck got his advertising check, and I got a new hobby. And for all that has been blamed on the internet, I owe it everything. Everything that I love doing, I have learned to some extent from the internet, whether it be the web development skills that I built exegesis with, my amateur interest in philosophy, my childhood love for art, or my newfound interest in guitar. I believe it is mankind's most beautiful invention.", "parent": "Giant Robots.txt", "score": 1.086758017539978}, {"content": "This is a lot. I doubt I'll be able to do all of this, and if I fall short on time, I'll have to cut back on some of these activities. They are not listed in order of importance, I plan on figuring that out at a later date. What is important to me is that I actually think about what I want to do, and the priorities for them. It's all to easy to spend a day noodling on guitar, wanting to get better solely because I saw some guy play a fancy solo on Youtube, or to spend a day learning a programming language I'll never use because someone on Twitter praised it. This is a recipe for mediocrity, because progress takes sustained practice, and I can't sustain these sorts of \"inspirations.\" Instead, I want to think slowly and deliberately about what I want to get better at, and stick to a slow and steady plan to improve at it. That is my \"big-picture\" goal for this year. ", "parent": "Reflections for the New Year.txt", "score": 1.122611403465271}], "I desperately want programming to feel like this.": [{"content": "I desperately want programming to feel like this.", "parent": "Fragments.txt", "score": 8.390035191041534e-07}, {"content": "This is not the case for programming. Making better tools for programming (new languages, new frameworks, new libraries) itself requires programming, and while making programming tools is different in important respects from writing regular programs, it is still programming. Making guitars is not playing guitars, making paints is not painting, but making better programming tools is programming. Programming, then, is an, intrinsically recursive creative medium. ", "parent": "Prometheus.txt", "score": 1.0698082447052002}, {"content": "It is this property that allows programmers to cheat the Gods, and achieve divine levels of creative output thought forbidden to mortals. A programmer can create abstractions than enable them to create in days what previously took months. I myself rewrote a good part of exegesis 2 months before I released it, and the new abstractions I picked enabled me to redo in those 2 months what took me almost a year at first. Moreover, programmers can share their abstractions, and borrow the inventions of others as well.", "parent": "Prometheus.txt", "score": 1.1041831970214844}, {"content": "That last project had a significant effect on me. Back in high school, I was heavily involved in Model UN and other political clubs. Making the [game](https://nichwch.itch.io/machinegods) made me realize it was making things and not winning arguments that really made me happier. It was also what convinced me that programming could be something more than rote problem solving, and even be a genuine creative medium. It was why I switched my major from Economics to Computer Science in college.[[personal-reflection]] ", "parent": "Reflections on exegesis.txt", "score": 1.1438322067260742}, {"content": "My dream is to enable something I term \"generational computing.\" I want my kids and my grandkids to someday be able to interface with the artifacts of my digital life. I want them to be able to read my notes and ask an LLM about what I've learned over my life. I want them to be able to chat with a replica of me trained on my writings. I want them to be able to look through the music I made and the music I listened to, and see the connections between the two. I want them to be able to upload their own musical ideas or writings, and see the connections between what they've made and what I've made. ", "parent": "Generational Computing.txt", "score": 1.1486488580703735}, {"content": "In my teen years, I found programming and videogame development, and that became my creative outlet for a while. I found a way to scan my drawings into digital files, and for a while that was my way of combining art and programming.", "parent": "Fragments.txt", "score": 1.1494125127792358}, {"content": "There are few feelings worse than wanting desperately to make something, and feeling as if you do not have the capability to make it. ", "parent": "untitled-9-22-2021.txt", "score": 1.1495877504348755}, {"content": "I want to return to my roots. I want to get excited by little ideas and not worry about scaling them, or fitting them into a huge vision, or turning them into legible accomplishments. I still want to be ambitious, but I don't want to let my ambition choke my creativity.", "parent": "Fragments.txt", "score": 1.156691074371338}, {"content": "Local-first AI presents a huge opportunity to change this. Like the now-dominant paradigms of web and mobile computing, a local-first future is not a forgone conclusion - but it is possible. What if we tried really hard to make filesystems and composable, small, programs usable for ordinary people? What if we designed software in a way that allowed people to take control of their own data? What if we made a bet on increasing computer literacy, rather than surrendering ourselves to infantilizing users?  ", "parent": "The AI-first operating system of the future.txt", "score": 1.1686437129974365}, {"content": "Users should have complete control over what they see. I'm not saying algorithmic feeds don't have their place, but they should be something users opt in to. Andy [[Matuschak]] coined the idea of \"[programmable attention](https://notes.andymatuschak.org/zJrfPCbY7GcpV9asEc8NTVzXTAV4TvRFMuY6)\" as something [[tools for thought]] could enable. I will say that this already exists, only in the opposite, sinister sense - right now it's the platform programming your attention, not you. ", "parent": "Controlling what you see.txt", "score": 1.1823561191558838}], "For a while, I exclusively worked on a long, serious projects. I wanted to build a billion dollar product. I wanted to be the founder of a successful startup. I wanted to write, but I wanted to write on my own platform that everybody else would also write on, that would have all the features I wanted that everybody else would love.": [{"content": "For a while, I exclusively worked on a long, serious projects. I wanted to build a billion dollar product. I wanted to be the founder of a successful startup. I wanted to write, but I wanted to write on my own platform that everybody else would also write on, that would have all the features I wanted that everybody else would love.", "parent": "Fragments.txt", "score": 0.0}, {"content": "I stopped working on little projects. The voice in my head that would get excited by little hints of an idea was drowned out by demands that everything be in the service of something ambitious, something legible, something monetizable. I let my ambition trap me.", "parent": "Fragments.txt", "score": 0.9414596557617188}, {"content": "Working on exegesis was a grueling affair at times. I rewrote the schema multiple times, rewrote the backend from scratch 2 months before release, chased countless UI bugs, and manually patched abandoned NPM packages. Part of it may have been due to my inexperience, but [working with ](https://nichwch.medium.com/making-yana-e3fade3f56e7)[rich text](https://medium.engineering/why-contenteditable-is-terrible-122d8a40e480) is just a [difficult task](https://twitter.com/thesephist/status/1360298464349999108), period. At one point, I considered giving up after finding a rival writing app I thought I simply couldn't compete with - I have a copy of an unfinished essay I started writing on why I had given up tucked away somewhere. ", "parent": "Prometheus.txt", "score": 1.007371425628662}, {"content": "I want to return to my roots. I want to get excited by little ideas and not worry about scaling them, or fitting them into a huge vision, or turning them into legible accomplishments. I still want to be ambitious, but I don't want to let my ambition choke my creativity.", "parent": "Fragments.txt", "score": 1.048126220703125}, {"content": "I want to continue working on [[exegesis]]. There are still a plethora of features I want to build into the app. I have wanted to build something like this for a long time - I sort of did with my last project [YANA](https://yananotes.com/), but the core text engine was so limited that I had to start over from scratch (the product of which is exegesis). I want to sort out a formal list of features before a beta release, and an eventual public release. I will probably use exegesis as a devlog of sorts as well.", "parent": "Reflections for the New Year.txt", "score": 1.0511887073516846}, {"content": "I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.", "parent": "Second Brains.txt", "score": 1.0521855354309082}, {"content": "Why did it take so long? Part of it is just a lack of experience. While making exegesis, I changed the database schema countless times, wrote dozens of migrations, accidentally wiped my database once (thank God for RDS backups), and rewrote the backend from scratch 2 months before release. There was also a good amount of feature creep. Whenever I thought I was close to finished, something unexpected would pop up - I started writing this essay 3 months before I actually released exegesis. Whatever the reason, if you count development time on the predecessor to exegesis, I've spent almost a tenth of my life building this. The entire project clocks in at a couple thousand lines of code. It is the largest, most complex, and most difficult thing I have built so far in my life.  [The last time I worked on a project this long, it was the first video game I made back in my senior year of high school.](https://medium.com/@nichwch/machine-gods-devlog-1-166dff474366) Even then, it was really about 6 months of development total, with a huge gap in between because of school, and it was all made with no-code game development tools, because back then the idea of using actual code terrified me. [[exegesis]] [[personal-reflection]] ", "parent": "Reflections on exegesis.txt", "score": 1.0555226802825928}, {"content": "I want to write more. I don't really care about writing \"better\" or more \"professionally\", because I don't write for a living, and I'm not really interested in selling people on my opinions. Instead, I want to write to broadcast my interests, so I can attract others who have similar interests. Hopefully, [[exegesis]] will be an able and capable platform for me to do this. ", "parent": "Reflections for the New Year.txt", "score": 1.0853852033615112}, {"content": "The main focus here is personal projects - learning more code and writing more are auxiliary activities that help this end. First among these personal projects is [[exegesis]], but I have a number of other personal projects that I want to work on as well. ", "parent": "Goals for Spring Quarter.txt", "score": 1.1467950344085693}, {"content": "I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]] ", "parent": "untitled-9-24-2021.txt", "score": 1.1474862098693848}], "I stopped working on little projects. The voice in my head that would get excited by little hints of an idea was drowned out by demands that everything be in the service of something ambitious, something legible, something monetizable. I let my ambition trap me.": [{"content": "I stopped working on little projects. The voice in my head that would get excited by little hints of an idea was drowned out by demands that everything be in the service of something ambitious, something legible, something monetizable. I let my ambition trap me.", "parent": "Fragments.txt", "score": 0.0}, {"content": "I want to return to my roots. I want to get excited by little ideas and not worry about scaling them, or fitting them into a huge vision, or turning them into legible accomplishments. I still want to be ambitious, but I don't want to let my ambition choke my creativity.", "parent": "Fragments.txt", "score": 0.7858175039291382}, {"content": "For a while, I exclusively worked on a long, serious projects. I wanted to build a billion dollar product. I wanted to be the founder of a successful startup. I wanted to write, but I wanted to write on my own platform that everybody else would also write on, that would have all the features I wanted that everybody else would love.", "parent": "Fragments.txt", "score": 0.9414596557617188}, {"content": "I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.", "parent": "Second Brains.txt", "score": 0.9967972040176392}, {"content": "Anyone doing creative work must carefully toe the line between two extremes: the collaborative extreme of butchering ideas by putting them into words, the auteur's extreme of refusing to communicate anything about an idea at all. ", "parent": "On auteurs and language.txt", "score": 1.0395281314849854}, {"content": "I've noticed a strange tradeoff, where the more things I pile into my morning routine (getting in a run, doing hw, etc. etc.) the freer I feel for the rest of the day, but the harder it makes it to actually get out of bed and face these mundane tasks. If I just do what I want in the morning - code side projects - I jump out of bed easily, but then I feel the weight of obligations over me. If I handle obligations in the morning, then the thought of doing boring things makes it hard to get out of bed [[focus]] [[focus-machine]] [[ideas]] ", "parent": "untitled-9-24-2021.txt", "score": 1.0554695129394531}, {"content": "I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]] ", "parent": "untitled-9-24-2021.txt", "score": 1.0702710151672363}, {"content": "There was a problem with both of these outlets, however: my short attention span. I struggled to work on larger drawings, because I'd give up on them and start new doodles. The same happened with code projects.", "parent": "Fragments.txt", "score": 1.0921218395233154}, {"content": "This project, too, has had a large effect on me - you can't work on something for a year and not have it affect you. I started this project sitting in a coffee shop; now I haven't sat in one for months. I know this sounds like navel gazing, but I've worked on this project through a pandemic, civil unrest, and statewide wildfires. Now it's finished, and I almost feel a little bittersweet releasing it. ", "parent": "Reflections on exegesis.txt", "score": 1.1224188804626465}, {"content": "To be frank, I made some regrettable engineering decisions while making Nomad Hypertext. I built this during my Recurse Center batch and was focused on getting a working prototype out, so some shortcuts were taken. Nevertheless, reflecting back, I would say these shortcuts were not worth it. ", "parent": "The making of Nomad Hypertext.txt", "score": 1.1275763511657715}], "I want to return to my roots. I want to get excited by little ideas and not worry about scaling them, or fitting them into a huge vision, or turning them into legible accomplishments. I still want to be ambitious, but I don't want to let my ambition choke my creativity.": [{"content": "I want to return to my roots. I want to get excited by little ideas and not worry about scaling them, or fitting them into a huge vision, or turning them into legible accomplishments. I still want to be ambitious, but I don't want to let my ambition choke my creativity.", "parent": "Fragments.txt", "score": 0.0}, {"content": "I stopped working on little projects. The voice in my head that would get excited by little hints of an idea was drowned out by demands that everything be in the service of something ambitious, something legible, something monetizable. I let my ambition trap me.", "parent": "Fragments.txt", "score": 0.7858175039291382}, {"content": "This is a lot. I doubt I'll be able to do all of this, and if I fall short on time, I'll have to cut back on some of these activities. They are not listed in order of importance, I plan on figuring that out at a later date. What is important to me is that I actually think about what I want to do, and the priorities for them. It's all to easy to spend a day noodling on guitar, wanting to get better solely because I saw some guy play a fancy solo on Youtube, or to spend a day learning a programming language I'll never use because someone on Twitter praised it. This is a recipe for mediocrity, because progress takes sustained practice, and I can't sustain these sorts of \"inspirations.\" Instead, I want to think slowly and deliberately about what I want to get better at, and stick to a slow and steady plan to improve at it. That is my \"big-picture\" goal for this year. ", "parent": "Reflections for the New Year.txt", "score": 0.9463714957237244}, {"content": "Entrepreneurship is not neccessarily incompatible with \"small projects\" and staying agile, because entrepreneurs still have to pivot often. - but you're pivoting with respect to what customers want, not what will improve your craft, or what you're interested in. Good musicians do two things: practice sections they find difficult to play, and articulate musical ideas that they find interesting. They don't go out and call prospective listeners and ask what they'd like to hear.  ", "parent": "Small Projects.txt", "score": 1.0199174880981445}, {"content": "I think it's important to have free time to just mess around and be bored, and explore dumb things that might turn out to be not so dumb - after all, \"boredom is that disagreeable 'windless calm' of the soul that precedes a happy voyage and cheerful winds.\" Every activity I eventually took seriously - Model UN in high school, programming in college - started out as an casual hobby I never planned to take seriously. So, I'd rather have slow progress towards my goals and a sizeable chunk of time to mess around, than to fill my days to the point where I have no time to explore at all.", "parent": "Goals for Spring Quarter.txt", "score": 1.0272070169448853}, {"content": "My philosophy here is this: it is better to try and make something authentic, beautiful, and expressive and have it turn out bad than it is to hide behind the safeness of minimalism. If you're writing, go ahead and try to sound clever. You might fail and sound incredibly immature, but a fear of failure is disastrous for any creative endeavor. If you're designing something, go all out. Make it bold and loud, and if it turns out gaudy, you can fix it on the next iteration. This was what I tried to do [[exegesis]]' redesign, and so far I'm very happy with it.", "parent": "Minimalism.txt", "score": 1.0435917377471924}, {"content": "For a while, I exclusively worked on a long, serious projects. I wanted to build a billion dollar product. I wanted to be the founder of a successful startup. I wanted to write, but I wanted to write on my own platform that everybody else would also write on, that would have all the features I wanted that everybody else would love.", "parent": "Fragments.txt", "score": 1.048126220703125}, {"content": "The goal is to keep things creative and lighthearted, to mess around with as many ideas as possible.", "parent": "untitled-9-24-2021.txt", "score": 1.1004198789596558}, {"content": "I've noticed a strange tradeoff, where the more things I pile into my morning routine (getting in a run, doing hw, etc. etc.) the freer I feel for the rest of the day, but the harder it makes it to actually get out of bed and face these mundane tasks. If I just do what I want in the morning - code side projects - I jump out of bed easily, but then I feel the weight of obligations over me. If I handle obligations in the morning, then the thought of doing boring things makes it hard to get out of bed [[focus]] [[focus-machine]] [[ideas]] ", "parent": "untitled-9-24-2021.txt", "score": 1.1236506700515747}, {"content": "Anyone who takes satisfaction in creative work knows how good it feels to make something. That feeling can get addicting, to the point where you hunger to make progress on a creative project even when you're burned out - you want to create something so badly you can't take a break without thinking about it, but you're too burned out to make progress on it. At moments like these, one craves divine creative stamina, the ability to create out of thin air effortlessly, to beam ideas from one's head into reality, to spawn an entire universe within the span of a week like the God of the Old Testament.[[personal-reflection]] ", "parent": "Prometheus.txt", "score": 1.124220848083496}], "I want this new site to be a space for that.": [{"content": "I want this new site to be a space for that.", "parent": "Fragments.txt", "score": 0.0}, {"content": "I want a space to be incoherent. I want a space to just throw paint on the walls.", "parent": "Fragments.txt", "score": 1.026655673980713}, {"content": "The idea will be for members to create their own pages on the site, to experiment with one-off ideas inspired by the website critiques.", "parent": "untitled-9-24-2021.txt", "score": 1.0870440006256104}, {"content": " The goal is to recreate the feeling of a musical jam session, but in a website. ", "parent": "untitled-9-24-2021.txt", "score": 1.1498379707336426}, {"content": "Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.", "parent": "Fragments.txt", "score": 1.1878209114074707}, {"content": "Two, we will maintain a collective website at [https://rhizome.world/.](https://rhizome.world/.) The site is open source, you can find the repo here: [https://github.com/nichwch/rhizome-club.](https://github.com/nichwch/rhizome-club.) ", "parent": "untitled-9-24-2021.txt", "score": 1.1960703134536743}, {"content": "I think eventually, I might want to deploy a blog with a full fledged backend, so users can query anything they'd like to my blog. ", "parent": "What is Yurt.txt", "score": 1.2632535696029663}, {"content": "Yesterday I had an idea for a club, and I've decided to start it. It will be called the [[Davis Hypertext Society]].", "parent": "untitled-9-24-2021.txt", "score": 1.270414113998413}, {"content": "Fortunately, it looks like there's progress being made here, with projects like [https://github.com/blocks/blocks.](https://github.com/blocks/blocks.) I want to build my own solutions, maybe borrowing from current projects.[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 1.2791900634765625}, {"content": "I desperately want programming to feel like this.", "parent": "Fragments.txt", "score": 1.286636233329773}], "I want a space to be incoherent. I want a space to just throw paint on the walls.": [{"content": "I want a space to be incoherent. I want a space to just throw paint on the walls.", "parent": "Fragments.txt", "score": 0.0}, {"content": "I want this new site to be a space for that.", "parent": "Fragments.txt", "score": 1.026655673980713}, {"content": "The world cannot be distilled into neat, concrete categories. Neither can your thoughts. Isn't it time your notes got a little messier?", "parent": "Manifesto.txt", "score": 1.17733895778656}, {"content": "Right now I'm listening to [Something About Us by Daft Punk](https://open.spotify.com/track/1NeLwFETswx8Fzxl2AFl91?si=bc9f206d498e4fdd), which might have something to do with how I'm feeling. What if words aren't enough to express a certain feeling? What if it's only the conjunction of words, images, videos and music, combined not in a determinate order like a moving picture or video, but presented indeterminately, in some form resembling a moodboard? That's the thesis behind [[synesthesia]] (a project I'm working on that will be closely integrated with [[exegesis]]).", "parent": "untitled-9-30-2021.txt", "score": 1.2342249155044556}, {"content": "Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.", "parent": "Fragments.txt", "score": 1.2463325262069702}, {"content": "The goal is to keep things creative and lighthearted, to mess around with as many ideas as possible.", "parent": "untitled-9-24-2021.txt", "score": 1.2492973804473877}, {"content": "None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking. ", "parent": "untitled-9-20-2021.txt", "score": 1.2615107297897339}, {"content": "I want to return to my roots. I want to get excited by little ideas and not worry about scaling them, or fitting them into a huge vision, or turning them into legible accomplishments. I still want to be ambitious, but I don't want to let my ambition choke my creativity.", "parent": "Fragments.txt", "score": 1.273524284362793}, {"content": "I desperately want programming to feel like this.", "parent": "Fragments.txt", "score": 1.279180884361267}, {"content": "So too, there exists a tool for each person that would vindicate their peculiarities. It is my hope that exegesis will vindicate chaos, disorganization, messiness, disorder, and all other epithets hitherto applied to what is rightfully called creativity. ", "parent": "Why I made exegesis.txt", "score": 1.2935943603515625}], "Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.": [{"content": "Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.", "parent": "Fragments.txt", "score": 8.276293215203623e-07}, {"content": "My favorite use of [[exegesis]] is to write down ideas that I have. I write about exegesis in exegesis, and a lot of features that I've added to exegesis started as sudden thoughts that were captured in exegesis. In my experience, ideas are like seeds, and writing them down helps them grow. I might think nothing of a simple idea I capture one day, but a week later it might have renewed significance, and it could even spark new ideas. ", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.7448953986167908}, {"content": "I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-20-2021.txt", "score": 0.8228412866592407}, {"content": "In some sense exegesis gave birth to itself, because I used it to organize my ideas about exegesis. On days where exegesis was not working because I had broken something while coding it, I noticed that I could not think as clearly. Its absence was felt.", "parent": "Second Brains.txt", "score": 0.8249458074569702}, {"content": "I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world. ", "parent": "untitled-9-20-2021.txt", "score": 0.828740119934082}, {"content": "What is the point of exegesis then? The point is serendipity - it's a place for me to capture little scraps of thought - ideas, feelings, anything that comes to you at the moment. ", "parent": "Second Brains.txt", "score": 0.8403849005699158}, {"content": "I want to write more. I don't really care about writing \"better\" or more \"professionally\", because I don't write for a living, and I'm not really interested in selling people on my opinions. Instead, I want to write to broadcast my interests, so I can attract others who have similar interests. Hopefully, [[exegesis]] will be an able and capable platform for me to do this. ", "parent": "Reflections for the New Year.txt", "score": 0.8696454167366028}, {"content": "Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]] ", "parent": "untitled-9-20-2021.txt", "score": 0.8751333951950073}, {"content": "I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]] ", "parent": "untitled-9-24-2021.txt", "score": 0.8766885995864868}, {"content": "None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking. ", "parent": "untitled-9-20-2021.txt", "score": 0.8846639394760132}], "Cardinal Newman said of Napoleon, 'He understood the grammar of gunpowder.'... Alexis de Tocqueville was the first to master the grammar of print and typography.": [{"content": "Cardinal Newman said of Napoleon, 'He understood the grammar of gunpowder.'... Alexis de Tocqueville was the first to master the grammar of print and typography.", "parent": "Fragments.txt", "score": 0.0}, {"content": "The way Napoleon understood the grammar of gunpowder and de Tocqueville understood the grammar of print and typography, I would like to master the grammar of hypertext.", "parent": "Fragments.txt", "score": 0.5577709078788757}, {"content": "But it is only recently that writers have endeavored to steal fire for themselves. Only recently have brave pioneers ventured to create tools for that one art synonymous with thought, that one medium separating man from animal, that one power \"which outlasts kingdoms.\" Here, the work has only begun.", "parent": "Prometheus.txt", "score": 1.3564292192459106}, {"content": "I may take a typography class this quarter. It's not required for graduation, but I figure it could help me design better products, and maybe make [[exegesis]] look prettier. ", "parent": "untitled-9-22-2021.txt", "score": 1.3975746631622314}, {"content": "Typography", "parent": "untitled-9-22-2021.txt", "score": 1.4087144136428833}, {"content": "It also seems like [[philosophy]] requires a war-like state of mind - against others, against oneself, against philosophy itself. I'm again reminded of an aphorism from [[The Gay Science]], simply titled \"excelsior\" - \"Thou wilt never more pray, never more worship, never more repose in infinite trust - thou refusest to stand still and dismiss thy thoughts before an ultimate wisdom, an ultimate virtue, an ultimate power, - thou hast no constant guardian and friend in thy seven solitudes - thou livest without the outlook on a mountain that has snow on its head and fire in its heart - there is no longer any requiter for thee, nor any amender with his finishing touch - there is no longer any reason in that which happens, or any love in that which will happen to thee - there is no longer any resting-place for thy weary heart, where it has only to find and no longer to seek, thou art opposed to any kind of ultimate peace, thou desirest the eternal recurrence of war and peace: - man of renunciation, wilt thou renounce in all these things? Who will give thee the strength to do so? No one has yet had this strength!\" - There is a lake which one day refused to flow away, and threw up a dam at the place where it had hitherto discharged: since then this lake has always risen higher and higher. Perhaps the very renunciation will also furnish us with the strength with which the renunciation itself can be borne; perhaps man will ever rise higher and higher from that point onward, when he no longer flows out into a God.\"[[quotes]] [[Nietzsche]] [[philosophy]] [[The Gay Science]] ", "parent": "untitled-9-21-2021.txt", "score": 1.421532392501831}, {"content": "The auteur believes otherwise. Language, he says, cannot communicate an idea without botching it. And if communicating an idea were not bad enough, mediating between multiple ideas using as flawed a tool as language is immeasurably worse. ", "parent": "On auteurs and language.txt", "score": 1.4226040840148926}, {"content": "Nietzsche argues that there exists a philosophical system for each person that would justify their existence - like the \"books of apologia and prophecies that would vindicate for all time the actions of every person in the universe\" in The Library of Babel.", "parent": "Why I made exegesis.txt", "score": 1.4264371395111084}, {"content": "The auteur is suspicious of language.", "parent": "On auteurs and language.txt", "score": 1.4306796789169312}, {"content": "A couple of ideas I think are very related but couldn't figure out how to weave in: [[Nietzsche]]'s distinction between the Apollonian and the Dionysian, the distinction made in [[Zen and the Art of Motorcycle Repair]] between Romantic Quality and Classical Quality.", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 1.446410059928894}], "From pg 28 of Understanding Media by Marshall McLuhan": [{"content": "From pg 28 of Understanding Media by Marshall McLuhan", "parent": "Fragments.txt", "score": 0.0}, {"content": "Thinking about Marshall McLuhan and the Medium is the Message. More specifically, thinking about his concept of sensory ratios, and how biased we are towards the visual sense. ", "parent": "NOW PAGE.txt", "score": 0.7396799325942993}, {"content": "Habermas", "parent": "untitled-9-21-2021.txt", "score": 1.1285191774368286}, {"content": "\"[Adam] Curtis attacks the internet because in his view it facilitates communities of solipsists, interpassive networks of like-minds who confirm, rather than challenge, each others' assumptions and prejudices.... Curtis' critique has a point, but it misses important dimensions of what is happening on the net. Contrary to Curtis' account of blogging, blogs can generate new discourse networks that have no correlate in the social field outside cyberspace.\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] ", "parent": "untitled-9-20-2021.txt", "score": 1.2896111011505127}, {"content": "Naturally, [[Habermas]]'s thoughts on the public sphere - which referred to salons, coffee shops and other public spaces in his day, and probably the internet today - are relevant to the social features of [[exegesis]]. ", "parent": "untitled-9-21-2021.txt", "score": 1.2905381917953491}, {"content": "But the feed has replaced the book as society's primary medium of information. Content flows in a stream, in no particular order, organized according to no specific topic - scrolling down some app, one may be confronted with content regarding math, science, politics, humor, or entertainment in any order. With or without our consent, our minds have been soldered to the system, programmed by all-powerful recommendation algorithms to swallow ever-increasing quantities of information. ", "parent": "Manifesto.txt", "score": 1.3085194826126099}, {"content": "[I'm reminded of the distinction made between Societies of Discipline and Societies of Control.](https://www.youtube.com/watch?v=B_i8_WuyqAY&ab_channel=Jonas%C4%8Ceika-CCKPhilosophy) Societies of Discipline control individual behavior by making restrictions in time in space (e.g. by requiring factory workers to be in the factory at certain hours, etc. etc.), while Societies of Control allow free movement but assert control through more direct, often computerized means. ", "parent": "untitled-9-30-2021.txt", "score": 1.3097811937332153}, {"content": "We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.", "parent": "Manifesto.txt", "score": 1.3108799457550049}, {"content": "The auteur believes otherwise. Language, he says, cannot communicate an idea without botching it. And if communicating an idea were not bad enough, mediating between multiple ideas using as flawed a tool as language is immeasurably worse. ", "parent": "On auteurs and language.txt", "score": 1.3115482330322266}, {"content": "Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]] ", "parent": "untitled-9-20-2021.txt", "score": 1.3138008117675781}], "The way Napoleon understood the grammar of gunpowder and de Tocqueville understood the grammar of print and typography, I would like to master the grammar of hypertext.": [{"content": "The way Napoleon understood the grammar of gunpowder and de Tocqueville understood the grammar of print and typography, I would like to master the grammar of hypertext.", "parent": "Fragments.txt", "score": 1.0082899279950652e-06}, {"content": "Cardinal Newman said of Napoleon, 'He understood the grammar of gunpowder.'... Alexis de Tocqueville was the first to master the grammar of print and typography.", "parent": "Fragments.txt", "score": 0.557754397392273}, {"content": "On the other hand, hypertext is built around the idea of a hyperlink, which is just a link from one document to another. Think about Wikipedia, and how every page is rich with links and connections to other pages. It is incoherent to talk about reading Wikipedia \"from start to end.\" Books create linear paths from A to B, hypertext creates entire worlds ripe for exploration.", "parent": "Why I made exegesis.txt", "score": 1.1146571636199951}, {"content": "Nomad Hypertext", "parent": "What is Nomad Hypertext.txt", "score": 1.1639107689646209}, {"content": "That's why I picked the name nomad hypertext. ", "parent": "What is Nomad Hypertext.txt", "score": 1.1652497928082866}, {"content": "I was greatly inspired by two blogposts. The first, [Hyperlink Maximalism](https://thesephist.com/posts/hyperlink/) by Linus Lee talks about generating hyperlinks automatically between documents, and comes with a [demo](https://notation.app) that made a deep impression on me. To be honest, nomad hypertext is just Linus' demo using semantic search instead of full text search.", "parent": "What is Nomad Hypertext.txt", "score": 1.1801854999000503}, {"content": "One last thing: There is a solution that combines the flexibility of plaintext with the aesthetics of rich text - Markdown! I don't think I'll support Markdown formatting in nomad hypertext, but for my static site generator Yurt, I will try to do that in the future. The utility would mostly be from having usable links. ", "parent": "Plaintext is your best friend.txt", "score": 1.1968759298324585}, {"content": "Nomad Hypertext is a writing app built around semantic search. ", "parent": "What is Nomad Hypertext.txt", "score": 1.2078209869687404}, {"content": "I may take a typography class this quarter. It's not required for graduation, but I figure it could help me design better products, and maybe make [[exegesis]] look prettier. ", "parent": "untitled-9-22-2021.txt", "score": 1.2253589630126953}, {"content": "However, when building Yurt, the static site builder for nomad hypertext, I found myself repeating a lot of logic. I found myself wanting to add features to the indexing engine, like being able to use cloud providers instead of local models (because doing all this processing locally can take ages!). In the future, I might want to use multimodal models, so I can see similarity between images, text, and audio. ", "parent": "The making of Nomad Hypertext.txt", "score": 1.2377779483795166}]}