{"": [{"content": "~", "parent": "Plaintext is your best friend.txt", "score": 0.6013116240501404}, {"content": "~", "parent": "Fragments.txt", "score": 0.6013129949569702}, {"content": "~", "parent": "untitled-1-4-2022.txt", "score": 0.6013137102127075}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 0.6013444587310941}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 0.6013444587310941}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 0.6013444587310941}, {"content": "~", "parent": "What is Nomad Hypertext.txt", "score": 0.6013444587310941}, {"content": "~", "parent": "Fragments.txt", "score": 0.6013447046279907}, {"content": "~", "parent": "Fragments.txt", "score": 0.6013447046279907}, {"content": "~", "parent": "Fragments.txt", "score": 0.6013447046279907}], "There is an intrinsic conflict between entrepreneurship and polishing craft. ": [{"content": "There is an intrinsic conflict between entrepreneurship and polishing craft. ", "parent": "Small Projects.txt", "score": -1.1920928955078125e-07}, {"content": "Entrepreneurship is not neccessarily incompatible with \"small projects\" and staying agile, because entrepreneurs still have to pivot often. - but you're pivoting with respect to what customers want, not what will improve your craft, or what you're interested in. Good musicians do two things: practice sections they find difficult to play, and articulate musical ideas that they find interesting. They don't go out and call prospective listeners and ask what they'd like to hear.  ", "parent": "Small Projects.txt", "score": 0.45104682445526123}, {"content": "Neither perspective is completely correct. The reality is that there is a tradeoff between the approach of creative collaboration and the approach of an auteur. What creative collaborators gain through specialization and the combination of talents, they lose in the fidelity of their ideas' expression; what the auteur loses through not being able to harness others' talents, he gains through the ability to express an idea to its fullest. Naturally, the more talents the auteur is able to accrue, the less he needs others, and the more worthwhile the tradeoff of solo work becomes.  ", "parent": "On auteurs and language.txt", "score": 0.5500580668449402}, {"content": "Anyone doing creative work must carefully toe the line between two extremes: the collaborative extreme of butchering ideas by putting them into words, the auteur's extreme of refusing to communicate anything about an idea at all. ", "parent": "On auteurs and language.txt", "score": 0.5514219999313354}, {"content": "In general, we should strive to have conviction in what we make. When minimalism is an expression of this conviction, it is good, but more often than not it's used as a crutch to mask a lack of conviction. ", "parent": "Minimalism.txt", "score": 0.6041544675827026}, {"content": "Speaking of which, Fischer has something to say on the social prerequisites for innovation. \"[I]t is now clear that a certain amount of stability is necessary for cultural vibrancy, the question to be asked is: how can this stability be provided, and by what agencies?\" His tentative answer to this is \"a public space that is not reducible to an aggregation of individuals and their interests\" (see the quote above where he says some innovations are impossible because the public has been displaced by the consumer) [[mark-fischer]] [[quotes]] [[Capitalist-Realism]] ", "parent": "untitled-9-20-2021.txt", "score": 0.6089895963668823}, {"content": "Creative tools vs rational tools", "parent": "On tools for thought: knowledge management vs creativity.txt", "score": 0.6159584989776576}, {"content": "There's almost a Jobsian element to what he's saying here. In fact, you could argue that Steve Jobs, with all his hippie/countercultural heritage, belonged to that \"postwar social consensus.\" Could our capitalist reality today give rise to another innovator like Jobs? Of course, I'm sure Mark Fischer was no fan of Apple or Jobs, but it's still an interesting question to raise.  ", "parent": "untitled-9-20-2021.txt", "score": 0.6188251376152039}, {"content": "Finished Capitalist Realism", "parent": "untitled-9-20-2021.txt", "score": 0.6191840171813965}, {"content": "But this is something forbidden to mortal men. We face a kind of creative asymmetry - to bring beauty into the world, it is neccessary to confront ugliness. Creating beautiful, original music requires endless, stupid, and frustrating scale practice, finger exercises, and theory study; behind the sublime beauty of a master's painting lies hours of practice filling sketchbooks with mind numbing still lifes and ugly anatomical mistakes. On the one hand, it seems paradoxical that beauty, freedom and originality require ugliness, servitude, and repetition. On the other hand, it is almost coldly rational - perhaps there is a kind of aesthetic entropy at play, like there's a set amount of beauty in the universe, and to \"produce\" any more of it, you first have to take on ugliness as a burden.[[music]] [[aesthetics]] [[art]] ", "parent": "Prometheus.txt", "score": 0.6218113303184509}], "Entrepreneurship is not neccessarily incompatible with \"small projects\" and staying agile, because entrepreneurs still have to pivot often. - but you're pivoting with respect to what customers want, not what will improve your craft, or what you're interested in. Good musicians do two things: practice sections they find difficult to play, and articulate musical ideas that they find interesting. They don't go out and call prospective listeners and ask what they'd like to hear.  ": [{"content": "Entrepreneurship is not neccessarily incompatible with \"small projects\" and staying agile, because entrepreneurs still have to pivot often. - but you're pivoting with respect to what customers want, not what will improve your craft, or what you're interested in. Good musicians do two things: practice sections they find difficult to play, and articulate musical ideas that they find interesting. They don't go out and call prospective listeners and ask what they'd like to hear.  ", "parent": "Small Projects.txt", "score": 5.960464477539062e-07}, {"content": "There is an intrinsic conflict between entrepreneurship and polishing craft. ", "parent": "Small Projects.txt", "score": 0.451093852519989}, {"content": "I want to return to my roots. I want to get excited by little ideas and not worry about scaling them, or fitting them into a huge vision, or turning them into legible accomplishments. I still want to be ambitious, but I don't want to let my ambition choke my creativity.", "parent": "Fragments.txt", "score": 0.5098994970321655}, {"content": "This is a lot. I doubt I'll be able to do all of this, and if I fall short on time, I'll have to cut back on some of these activities. They are not listed in order of importance, I plan on figuring that out at a later date. What is important to me is that I actually think about what I want to do, and the priorities for them. It's all to easy to spend a day noodling on guitar, wanting to get better solely because I saw some guy play a fancy solo on Youtube, or to spend a day learning a programming language I'll never use because someone on Twitter praised it. This is a recipe for mediocrity, because progress takes sustained practice, and I can't sustain these sorts of \"inspirations.\" Instead, I want to think slowly and deliberately about what I want to get better at, and stick to a slow and steady plan to improve at it. That is my \"big-picture\" goal for this year. ", "parent": "Reflections for the New Year.txt", "score": 0.5472124814987183}, {"content": "I have not had as much time to work on programming side projects. In general, I've been spending more spare time on music rather than programming. There's nothing intrinsically wrong with that, but I feel like it's less a reflection of what I want than it is a reflection of my environment. \n\nI don't actually find music to be more fulfilling than programming. I got into playing the guitar mostly by accident and to be honest I am much better at the guitar than I am at programming, but playing the guitar was never my dream growing up. There are software ideas that I am excited about and obsessed with. I don't really feel the same way about music.", "parent": "NOW PAGE.txt", "score": 0.5495615005493164}, {"content": "The usual way to think about technology, software, and startups is that they solve problems, and so it follows then that the best way to create a new technology is to find a problem people have and solve it. This is not a bad approach to take, and it's been successful for many people. Still, I think it's too narrow.", "parent": "Creating new kinds of people.txt", "score": 0.5515608191490173}, {"content": "I stopped working on little projects. The voice in my head that would get excited by little hints of an idea was drowned out by demands that everything be in the service of something ambitious, something legible, something monetizable. I let my ambition trap me.", "parent": "Fragments.txt", "score": 0.5678157806396484}, {"content": "The compromise that I've arrived at, and that I've tried so far with a decent amount of success, is to draw with my preferred medium (pen), in my own style, while also using a reference. I use the reference for the pose and some of the details, and use my imagination to make up the rest. This is infinitely more interesting for me, and doesn't feel like a dreary technical exercise. I've also given up on using pencil, or charcoal, or anything except pen. I used to harbor a lot of guilt over this, because shouldn't an artist be able to use any medium? Of course, this is ridiculous, it'd be like asking a musician to be familiar with every instrument. It makes far more sense to get really good with one medium than to be mediocre with multiple (feeling some cognitive dissonance here with my desire to learn both the [[piano]] and the [[guitar]]...). Of course, professional artists (and musicians) really should be learning multiple mediums, but I have no aspiration to be professional at either, only to have some fun. [[drawing]] [[piano]] [[guitar]] ", "parent": "Reflections for the New Year.txt", "score": 0.5761144161224365}, {"content": "Anyone doing creative work must carefully toe the line between two extremes: the collaborative extreme of butchering ideas by putting them into words, the auteur's extreme of refusing to communicate anything about an idea at all. ", "parent": "On auteurs and language.txt", "score": 0.5812540054321289}, {"content": "My goal in life right now is to focus more on programming, while keeping music as a hobby. I want to improve at both, and someday I'd like to unite these two interests - not in some surface level way like getting really into digital signal processing or generative music, but by making the process of writing software more like the process of making music (intuitive, embodied, modular, composable).", "parent": "NOW PAGE.txt", "score": 0.5827779769897461}], "projects are cool!": [{"content": "projects are cool!", "parent": "Small Projects.txt", "score": 2.384185791015625e-07}, {"content": "Fortunately, it looks like there's progress being made here, with projects like [https://github.com/blocks/blocks.](https://github.com/blocks/blocks.) I want to build my own solutions, maybe borrowing from current projects.[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.5102899670600891}, {"content": "Tagging this all meta-acropolis, an edtech project I'm in the early stages of working on. Don't have any code for it, just ideas, but I plan on putting something together soon™. [[meta-acropolis]] [[ideas]] ", "parent": "untitled-9-21-2021.txt", "score": 0.5798692107200623}, {"content": "That last project had a significant effect on me. Back in high school, I was heavily involved in Model UN and other political clubs. Making the [game](https://nichwch.itch.io/machinegods) made me realize it was making things and not winning arguments that really made me happier. It was also what convinced me that programming could be something more than rote problem solving, and even be a genuine creative medium. It was why I switched my major from Economics to Computer Science in college.[[personal-reflection]] ", "parent": "Reflections on exegesis.txt", "score": 0.5803830027580261}, {"content": "This is not groundbreaking news, but it's groundbreaking for me. I started my software engineering career writing code with cloud applications in mind, and the idea that you can ship cool projects without running database migrations or doing extensive backtesting against your monolith *is* groundbreaking to me. In college I wanted my own blog and instead of getting a static site generator I built out a cloud application with NextJS, PostgreSQL and Heroku. I did learn a lot and it helped me land my first internship, but now it strikes me as an incredibly wrong minded approach. ", "parent": "NOW PAGE.txt", "score": 0.583448052406311}, {"content": "The main focus here is personal projects - learning more code and writing more are auxiliary activities that help this end. First among these personal projects is [[exegesis]], but I have a number of other personal projects that I want to work on as well. ", "parent": "Goals for Spring Quarter.txt", "score": 0.5963743925094604}, {"content": "The vision is to have a tool that provides a visual interface for creating layouts, and maybe even rigging up basic stateful logic, or data fetching logic. I've more or less nailed down a preferred personal stack for creating projects with React, Express and Postgres, so it shouldn't be terribly difficult to even integrate database logic/fetching logic into such a tool (so long as some flexibility is lost on technology choice).[[code]] [[ideas]] [[tools for thought]] ", "parent": "untitled-9-24-2021.txt", "score": 0.6006453633308411}, {"content": "I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]] ", "parent": "untitled-9-24-2021.txt", "score": 0.6058704257011414}, {"content": " [[ideas]]: A tool that analyzes a react project and shows your component structure for you in a nice and visual way. Probably already exists, idk", "parent": "untitled-9-20-2021.txt", "score": 0.6092844605445862}, {"content": "[[meta-acropolis proof of concept]] Maybe do the demo for [[metaphysics]] instead. It's a subject I actually care about, and I'm taking the course this quarter. Also, I finished number theory last quarter and I have no intention of touching it again if I don't have to. testing edits. 5", "parent": "untitled-1-4-2022.txt", "score": 0.613848090171814}]}